[{"useful": 18, "funny": 0, "review_id": "AJ0IglpYAp2D0daOlVGIdg", "text": "This place doesn't even deserve 1 star. Horrible service! The service manager was rude and unprofessional. He shouldn't even have a job after the way he spoke to customers. Marcus Lamonis needs to step in and end this location. Repairs that were suppose to be done never were completed.", "date": "2015-11-05", "cool": 0, "user_id": "Ka7TIp74VHSa90rfdg4_2g", "business_id": "qdC2h3MqCNussc5lhzL7gg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "XIZeDNZdGnPvq6gGlqqACQ", "text": "Busy holiday weekend, but all the staff from the ticket counter, concessions, and rest room attendants we really nice. Smiling without a hint of annoyance due to working on a holiday weekend with heavy traffic. \n\nIt would have been a 3 due to smelly restroom but before I left, they were already on it. Service counts a lot.\n\nSeats were comfortable with good leg room.", "date": "2016-06-08", "cool": 0, "user_id": "0pf5VuzE4_1pwj5NJHG5TQ", "business_id": "VfX7rhtX03yNg56ISz8gVQ", "stars": 4}, {"useful": 3, "funny": 1, "review_id": "ytMNnwPkSBxmixfOrC--1Q", "text": "Having a craving for something spiced and exotic and motivated by a friend's comments that, \"there is a good Indian place over on Queen,\" I ventured out in hopes of finding something deliciously curried. Upon arrival we found that this is an odd spot on Queen West where a string of three of four Indian restaurants are all lined up side-by-side, so which to choose?\n\nOne thing I love about Toronto restaurants that you won't always find in smaller cities are menus posted on the outside of the building.  Little India stood out for it's well-organized, easy to understand and well-priced menu - in we went.\n\nIt is definitely an intimate spot, having no real capacity to hold very large groups, but was still quite comfortable for our dining duo. It was a cold Thursday night and not overly busy, so it did not feel crowded, and it gave the servers that much more time to be attentive.\n\nThe menu is substantial and has a variety of dishes. The price range is about $15 - $20 for an entrée, but be sure to ask which ones come with rice or Naan and which don't so that you can order them on the side.  First up was the mixed platter appetizer, which included samosas, onion bhajia, pakora and spring rolls. Everything was crispy, hot and just the right size for something before the entrée-and it came in at under $5.\n\nFor the main, I ordered the chicken kebab and my dinner partner had the Madras chicken.  Fair warning: if they tell you it's going to be hot, then it's truly hot.  We are all too accustomed to those Canadian-ized restaurants that tone down their spiciness to appease the masses, and it is arguable that Little India may do this too, but in any case, take the servers' recommendations to heart.  I do enjoy some heat, but my taste buds can't handle extremes, so I steered clear on this occasion-except for a little taste of the Madras.  For those of you who do like spice, you'll love this!  It has that heat that creeps up after a few bites, not that punch-in-the-face-burn that you might get from cheap chicken wings covered in Frank's Red Hot. Our server did lean my friend toward the less-spicy of the dishes she was deciding between at first, much to her dismay, but as it turns out his suggestion right on.  As for my tamer dish, it had more of a Mediterranean flavour to it; grilled, lemony and came with a cucumber salad garnished with cilantro.  It was a happy reminder of summer while dining in the depths of winter.\n\nOne of the greatest things about this restaurant is something I was not even able to take advantage of: the lunch buffet.  This is a bit of a hike from my own home and workplace, but for those of you in the area, I say go for it!  Buffets have a bit of a bad reputation (and for the most part it's well-deserved), but a small arrangement at a non-chain location like this can be a perfect opportunity to try a variety of what is on the menu, especially if it is food you're mostly unfamiliar with.\n\nOverall, I can't leave you saying it was the very best Indian cuisine I've ever had, but I can say that I wasn't disappointed, and I would go back again-especially for that buffet.", "date": "2011-01-22", "cool": 2, "user_id": "YHWsLBS8jzZiPjKHMFOaAA", "business_id": "P6JCepLy6zlq-jEsrAqkKA", "stars": 3}, {"useful": 2, "funny": 3, "review_id": "jk9POXdfBbBfLTjgO8YFFg", "text": "I guess I'm not excited about this place because for me, it not only has limited options, it doesn't actually have a good option. The \"Juicy Vegan\" is one of the most expensive items on their menu, and when I ordered it, the woman at the counter asked me if I want sour cream or cheese. And I ask... well is it vegan sour cream or cheese? to which she replies \"no it's not included\" (???) \n\nDear restaurants, if you have something labelled \"vegan\" on the menu, could you let your staff know what \"vegan\" actually means? Thank you.\n\nWe waited about 20 minutes to get our orders. After I picked out the big tasteless spears of tofu out of my not so juicy  \"Juicy Vegan\" it wasn't so bad. I liked the diversity of vegetables, it was an ok size, but I'd probably opt for Big Fat Burrito or Burrito Boyz instead of going to this place again.\n\nMy friend ordered the special of the day which was a Korean BBQ burrito and his reaction was equally meh. \n\nI wanted to like them, because I love burritos and I'm nearly always in the village, but it just didn't happen.", "date": "2011-03-03", "cool": 2, "user_id": "YgavGxfAdjhkkbwlAY_9ZQ", "business_id": "cRMC2eQ9CP6ivhEY8EdaGg", "stars": 2}, {"useful": 0, "funny": 1, "review_id": "VutlvXHXVH414zT7clhlBQ", "text": "Bangcakes - $12 (Only at the Liberty Village location) \nFluffy pancakes + caramelized banana + coconut + peanut brittle + pineapple\nI don't love pancakes but I enjoyed these. The caramel sauce was a bit heavy by the end but we did dip into it generously\n\nCorned beef + sweet potato hash + poached eggs + hollandaise - $15\nI'm glad we shared this one. It was pretty good but it would've been too rich and heavy for me to consume by myself\n\nService \nOur server was good. She came by at the right times, not too often but not rarely seen either.\n\nReservations\nI made a reservation through OpenTable but it didn't count towards any points. Too bad because it was the only reason I used OpenTable.\n\nMenu/prices\nThe price was about expected for the Liberty Village area. If I go back for brunch, I'd want to try the French toast (duck confit) or the pork belly fried rice.", "date": "2013-04-11", "cool": 0, "user_id": "UGW-9bbBEB3eP1o6mWD_WA", "business_id": "OAtJ992w2v2C8B3bQWhmxQ", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "BuQYpKfuLwQvAFBOONXOaQ", "text": "The food is not great but the price is ok. We don't come for the service but we don't have to wait for a seat during the Sunday lunch hour so it's bearable. If we have a group larger than 8, we get the party special. Otherwise the other lunch specials are reasonably priced (about $8-10).", "date": "2014-01-28", "cool": 0, "user_id": "UGW-9bbBEB3eP1o6mWD_WA", "business_id": "LWtKuyX8w5SFm-JviPr4qQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "4mKcidZOElQECnJ1-sEnNg", "text": "Pricing seems standard for Chinatown:\n\nMonday - Friday* 9pm - 4pm (*Except holidays)\nDim Sum Special $2.00/dish\n\nMonday - Friday: 4pm - close\nSaturday - Sunday & Holiday\n(S) $2.38 (M) $3.28 (L) $3.68\n\nOverall:\nThe dishes were all as expected. Nothing too greasy or too dry. Went on a weeknight and it was mostly empty. They charge for tea but it's fine given the price of the dishes.", "date": "2014-06-21", "cool": 0, "user_id": "UGW-9bbBEB3eP1o6mWD_WA", "business_id": "AVLj5MSJD1si-Rl6X6qTXQ", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "qO81z1KiEviyr2TEVOXaeg", "text": "The fish taco is really good. \n\nBurrito boys makes the best burritos this place... WAY too much bread ratio not enough of anything else. \n\nThe other meat tacos  not good meat tastes more like old leftovers from earlier that week. Lol gross. \n\nTIP: if your going only get fish tacos", "date": "2015-06-30", "cool": 0, "user_id": "kBNFdviedCPFWyR-wVaAzw", "business_id": "VRwT0pscR5vESCrAnUpNwQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "9E1uv1Ijy9LkO461c6m5SQ", "text": "Desserts and bread are always great at Nova Era. Customer service is terrible. \n\nDesserts always a great variety and always fresh. \n\nCouple recommendations; custard cakes, bean cakes are all amazing! \n\n\nCustomer service.... After waiting in line for 15mins with only two people in front of me I was told to go to the other counter to order my sandwich.... After ignoring me for another 10mins the extremely rude woman making sandwiches doesn't even greet me and in a very unfriendly manner tells me to basically go sit down and now wait to be asked what I want.\n\n\n20mins pass and I am still here sitting and waiting to have someone approach me to take an order. I will never be coming back here to eat and HIGHLY recommend only coming for the bakery stuff only here! \n\n\nTerrible fucking service.", "date": "2016-06-12", "cool": 0, "user_id": "kBNFdviedCPFWyR-wVaAzw", "business_id": "q-Mbr_XrA93pQkNaWJ6sMg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "STdRfSO1D_i9BKePNu8qVQ", "text": "This is a nice off-leash dog park. There are plenty of spots to sit while your pup plays. There's not a ton of shade which was fine for our visit in late October but I imagine it's miserable in the summer. The park is separated by weight. There was a third area not being used due to maintenance. My reviews is only 4/5 stars because it's kind of a small park. It certainly does the job though!", "date": "2016-10-26", "cool": 0, "user_id": "JIkVfsVYb7-26O3BxlyHAQ", "business_id": "ebEP_MZngIWKH0Ixobcqhg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "GgyrFtdqdVHdvqk7g95JZw", "text": "We had been recommended Pink Jeep from some friends of ours and we're really thankful they did!\n\nThe trip was well organised with them picking us up from the hotel and then heading out to the Canyon. Our driver gave us some great commentary on the way out and had the perfect balance of not talking the whole time but still being really informative.\n\nWe stopped at a few spots on the way out including Hoover Dam and a small store for a rest stop which made the trip out there feel even more authentic going into an actual country store.\n\nWe didn't realise when we got there that we would all be going onto buses afterwards but the guide was really good at making sure we all had the freedom of looking around each lookout and then still grouping back together at the end.\n\nThanks for making it an easy and great trip!", "date": "2013-01-20", "cool": 0, "user_id": "wcKvC0jov-kAHg-GIvWJqg", "business_id": "KPgyqG3MyFUDK7GRbUg51A", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "0FlTdE0Cqc7ujLNTzYpOMw", "text": "Earl of sandwich is a great concept and the menu is super enticing.  Prices are fair, quality is average.  The turkey is in the form of cold cuts (not roasted like Capriotti's) and mirrored the quality of a Quiznos or- worse yet- Subway.  The bread here is baked fresh to order and is fluffy on the inside and crispy on the outside- yum.  The All American sandwich was okay, but again the quality of the turkey was off putting.  It had cranberry sauce, buttermilk ranch, lettuce, tomatoes, and cheddar.  The fellow reviewer who said this sandwich trumps the Bobbie must have had a few too many, I mean really.  The tuna melt, however, was great- very simple with just tuna salad and melted cheese, but delicious.  If you like tuna melts then this is the place for you (that might have been a 5-star sandwich!).  Potato salad was average and they have a selection of other salads and kettle chips.  There is also an assortment of baked goods, unfortunately the chocolate cupcake we tried was yellow cake mix with chocolate frosting (lame!).  The earl gray lemonade was refreshing and delicious, and I loved that it was something different.  Major props for having good vegetarian options (veggie sandwich with feta and peppers and a caprese).  I'd probably come back for the tuna melt and an earl gray lemonade, but I am shocked that this place has better ratings than the much superior Tom Colicchio brainchild Witchcraft (which uses vastly superior ingredients and has more exciting offerings).  Mad props that it's open 24 hours.", "date": "2011-01-19", "cool": 0, "user_id": "dEgO4_n8thLMbG1dKfFMHg", "business_id": "DkYS3arLOhA8si5uUEmHOw", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "aLK9Zsevo1ddSvULAUjB-Q", "text": "I had a banquet event here and I was quite impressed with the service, as well as the atmosphere. The wait staff was very friendly and was able to keep everyone's order straight, despite the large group.\n\nI ordered a chicken dish that had a creamy sauce, some potatoes, and asparagus. It was a great dish, served hot. It had way more complex flavors than I was expecting. I also tried a bite of the pasta with vegetables.\n\nIn a catered, sit down dinner service, I usually don't expect the food to be great or hot, but the Grand Concourse is a nice exception.", "date": "2012-11-14", "cool": 0, "user_id": "djSJ6a9gsLSdj-7BoyNNQA", "business_id": "gHngt6zpP683GKe1i23LUg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "hojz-_qNzSCCDq-suZaSXw", "text": "I love this place!  When I have a hankering for the best burrito in town, Mucho Burrito is the only place I go.  I usually have a regular barbacoa (shredded beef) burrito with brown rice, black beans, sautéed veggies and lots of extra cilantro on a whole wheat tortilla...YUM!  I've been here several times and I'm never disappointed.", "date": "2013-10-27", "cool": 0, "user_id": "_O1ALDAM8lMoLxISeTdrfA", "business_id": "NqPwsLBzXeSKpn_ofotLMA", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "OqWTtSaJreN26dMbS8gjVQ", "text": "Went in on a friday night, we were seated in a far corner away from everyone else, our waitress kept forgetting about us, didn't want to get us refills, my husbands limeade was nasty, and we could see our food sitting in window for the longest time, with so many other restaurants in the area, we won't go back", "date": "2011-06-21", "cool": 0, "user_id": "pai0Ky1_xNGZebw0VzyJVw", "business_id": "Z5refCiM2cM1FIOAwFpiOA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "iWL20DdQRBHNWap7aPyH8g", "text": "I came to see the new Trader Joe's and had an excellent experience. The staff was very helpful and the store was nice and clean.", "date": "2016-07-17", "cool": 0, "user_id": "MmOlteGoOLp4uydXpW7EHg", "business_id": "BPyopyEntbl4obte91gNrQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "PSpicxruGCPJU12Ksk6Etw", "text": "Pretty eh.  I've certainly had worst fast food burgers, but given the relative wealth of burger options in Tempe, I can't imagine why anyone would stop here.", "date": "2015-03-02", "cool": 0, "user_id": "L1qYrPzoex6mBWQk3oaLUg", "business_id": "z_m9GstWrDagyZv9lNSKjQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "YkBswN9bEZBvGl7Go_D08A", "text": "I Love this pharmacy. They are very personable and I feel like a loved one is filling my prescriptions.", "date": "2017-02-18", "cool": 0, "user_id": "xUabzaW-fTrVjR5AvNGPqQ", "business_id": "EEucpi6TIZQNrXw3-opSEA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "RCDPnc8iy0O6rbTTv_VbUQ", "text": "Frite alors! c'est la brasserie/friterie belge typique revisitée pour les Québecquois (comprendre \"avec poutine\"). Comme d'habitude, j'étais un peu sceptique. Les frites, ça doit pouvoir se déguster sans sauce et juste briller par sa qualité en standalone. Après, ça m'empêche pas d'apprécier des sauces, mais toujours dans un petit pot à côté pour pouvoir alterner entre avec et sans sauce. Et puis, du fromage sur des frites? wtf.\n\nMais j'ai essayé une poutine avec champignons, oignons et boeuf et j'ai changé d'avis. La poutine est, en fait, une idée génial. Le problème c'est qu'elle peut servir à cacher un manque de qualité du produit (les frites par exemple) en la \"noyant\" sous une masse de trucs. Mais, à Frite alors!, chaque partie de la poutine et la poutine en son ensemble étaient de qualité.\n\nUn excellent souvenir de Montréal.", "date": "2014-12-26", "cool": 0, "user_id": "SHIysR-zKH_MzNsEzTp_-g", "business_id": "63qPRnFAjxtchnSTWBxwbw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "u58LG4uWejPwr8gHaijmvw", "text": "A keeper Korean BBQ place.  I think it is bit pricy above average but food was very good.   We had marinated Galbi but they also have seong? Galbi which is not marinated.   That Galbi is available at a good Korean BBQ place to taste real meat flavor.   Well one of us really wanted that marinated this time and it was an excellent choice.   \nAfter 11pm they deduct 20% and it is average price with really good dining I think.   \n\nThe receptionist was very attentive and we liked her service.  Table waitress is ok. \n\nWe had paejyong? Pancake also.  It didn't took my fancy but all small dishes especially Kimchi was very good.  \n\nI certainly would come back this place for tofu stew menu and other choices.  \n\nThey have a semi private dining area for a group dining.   I can use this for business dinner", "date": "2015-01-06", "cool": 1, "user_id": "ggUIxd2V8ryLPYUYJUBEaA", "business_id": "WO1sgbYB6u6VVcvChanp5g", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "cAgWNBmRhx4OYwzJ2YzJJQ", "text": "I had lunch at here. So no lobsters or oyster seafoods highlight. If you select specific foods, it is ok. I have to narrow down to following: \nIn sushi: salmon, eel, shrimp roll\nIn grill: yaki soba, shrimp tempura \nIn desert: green tea soft ice-cream, mocha cake, and of course fresh fruits\n\nI didn't try all but may be 80%.  Many others i cannot recommend unfortunately.", "date": "2011-01-04", "cool": 0, "user_id": "ggUIxd2V8ryLPYUYJUBEaA", "business_id": "zkhBU5qW_zCy0q4OEtIrsA", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "hAVXzBzYm_yXfrclv4_9og", "text": "Amazing service. The team at pure plumbing came out to check on a few things on the house I just purchased.  They looked at a old water softener system that was no longer functional. After discussion, they suggested a new system that provides softening and filtration.  I did NOT feel pressured for purchase.  Instead, they gave me all the information and allowed me to make my own decision.  After giving the thumbs up, they were back in a couple of hours SAME DAY with the new system and got it all installed.  All questions I had about other repairs on the property (replacing outdoor piping, checking for leaks, etc) were answered without ego or frustration.\n\nAnother problem they found was I had a leak in my laundry room that had been present for quite some time.  It caused damage to the drywall and required repair.  They referred me to an excellent service and repaired the leak by installing new valves.\n\nA couple days later, after moving in and getting my washer and dryer installed, I called AFTERHOURS and was surprised to get a callback almost immediately.  They came out next day to install the gas line for my dryer and check my gas fireplace quickly.\n\nThis service is amazing.  Had no issues and would certainly recommend them again.", "date": "2016-04-30", "cool": 0, "user_id": "yw4rNufjosU5ahURAFOZUQ", "business_id": "hL5tldgv2eLcL-AUnPZ9gA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "nzEgDBd2-HTnF2hO2vbL5w", "text": "OMG that food is amazing. I got the chorizo breakfast crepe burrito. So amazing. Lattes are amazing too.", "date": "2017-05-06", "cool": 0, "user_id": "6BGYhuAB9-DnH78dMJsLaQ", "business_id": "uKKNw68mZZaa1jcyszEbyA", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "oeEL4szfHeSX3mzpOXkL0Q", "text": "I heard a lot of good things about this restaurant from a few friends and decided to try it out to see what the hype was all about. \nThe hype is justified ... this is one of the best new restaurants I tried in a long time. The staff was friendly and helpful and the food was prompt and very tasty. \nWe had a variety of dishes and my absolute favorite was the black cod. It was tender, juicy and absolutely delicious. \nThe jumbo beef rib was very good too. It wouldn't be a great first date dish as it's messy to eat but I'd still highly recommend it.\nWe are already talking about when to go back.", "date": "2016-04-17", "cool": 3, "user_id": "JdC7Y4SN606CPTIAhM_FxQ", "business_id": "RB5-T39Ar2RqfG8DlTWLSQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "PVUBB9M9bM-vH9NSWKI1_A", "text": "Can you please open on of these in NYC?!\n\nI fell in love with this place. The food. The service. The ambiance. Even the location was perfect. \nIt's away from the Vegas strip which can be a bit too loud for one to enjoy a nice meal but at the same time its so close to Fremont St that has a lot to offer. The restaurant is located exactly across from the back of the Container Park, which by the way everyone should go to. \n\nThe wait time here is tricky, it depends at what time you show up. But don't be taken back by the amount of people waiting, every second you wait will be worth it once you go in and eat. \n\nThe menu is very basic, but everything sounds great and if you are like me you will find yourself looking at other table sot see what people ordered. So everywhere I turned everything looked amazingly good. For appetizer, we had some biscuits with strawberry sauce drizzled with confectionery sugar....TO DIE FOR. As soon as we took a bite of the biscuit we knew that we were in for a good eat. \nFor main course i went for the pancakes with an apple sausage and my brother and mom went for the breaded steak, yes STEAK. When they ordered they missed the part that said steak so when they went in for the cut they say that it was not a fried chicken breast, it was steak. And holy moly was that a big piece of steak. Both of them could of ate from one plate. The steak came with two eggs and potatoes. As to my pancakes, it was a simple dish, but boy were those pancakes huge.  They gave me three I only ate one and a half. I couldn't do it. And let's just say that for the price I did not mind not being able to finish it all.", "date": "2014-06-04", "cool": 0, "user_id": "e3s1x4LLqfSkRTWDy_-Urg", "business_id": "l_GV0hgEoTUf70uJVT0_hg", "stars": 5}, {"useful": 3, "funny": 1, "review_id": "FxZEO_mPXse1gthC073jSQ", "text": "Outstanding knowledge of cruisers, mountain and road bikes.  I have been to all of the other bike shops in town and Joe and his crew are the most knowledgable.  If they don't have what you need they will order it.  And they will even send you to their competitors if you are desperate for parts. Great selection of cruisers and an improving selection of road bikes.  They now carry a great selection of Cannondale  road bikes.  Looking for baskets and cruiser saddles, look no further.  The only drawback is a lack of more items for road bikes.", "date": "2013-08-11", "cool": 1, "user_id": "BjmYO90f7e7oiwyoffC82w", "business_id": "mZCUht2OMoTpa8XnppWYpw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "w_IQR7fGO8ESiFy69oNyEg", "text": "Objectively: $93 for an 8 oz filet (with a potato cake), salmon, Brussel sprouts, and a carafe of wine. Plenty of food for two people.  Subjectively: great.  The steak had a fantastic sear on it with a peppery taste and the meat was done perfectly, still juicy and tender. The salmon was moist and flaky.  I even liked the Brussel sprouts that were shaved and toasted.  (And I don't like Brussel sprouts!).  The potato cake had but one problem - too small.  Otherwise a near perfect tasting dinner.  Del Frisco's is an anomaly - hardly ever packed but turning out some of the best food. This steak certainly was on par with Durants and Donovan's.  (The ambience is in keeping with a \"grill\" and could be changed to make it a more intimate setting.). The carafe was a good deal at $19 and gave us almost four glasses of wine.  Enjoy!", "date": "2015-09-07", "cool": 0, "user_id": "BjmYO90f7e7oiwyoffC82w", "business_id": "H7_yu7MgzSXB0vb959yXdA", "stars": 5}, {"useful": 4, "funny": 0, "review_id": "dFfsPVpjMuFX1kIGaRYFZA", "text": "Jan is cultivating a culture here.   Every vape shop has a tasting counter, but they are all about processing customers - try, buy, next.  Jan's definitely selling mods, coils, and juice, but EBV has perfected the chill lounge model.  It's like Cheers for Vapers, building a community of practice and appreciation for tobacco counterculture to such an extent that the 'store' concept feels decidedly anticapitalist. \n\nWhich is why, perhaps, the Eastern Bloc brand is so apt.  At EBV you're not working with a disillusioned teenaged vaper getting paid minimum wage - you're working with a guru.  A vapor sommelier.  Somebody who is genuinely invested in your interest in vaping.  If you are looking for mod build tips, ideas, an incredible tasting bar with some of the best juices on the market (not just proprietary homebrew BS), or, most importantly, a place to just hang and vape with some great company you've never met before, Eastern Bloc is a must.  Go now.  Sit, vape, and be merry.", "date": "2015-12-14", "cool": 0, "user_id": "fsUMORfhG2rwE7rX8uYmmQ", "business_id": "kBQkdV4l1u7m9XPozHFWQw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "N7WVogy79U8uYyrJGQJRDg", "text": "Been here a few times, and am usually happy with the food, service and atmosphere. The rolls are not very special, just average, although the presentation is very nice. The tempura was very good, particularly the lobster tempura - very reasonably priced too. They also have monkfish liver sushi, which I always appreciate; good portion and tastes great!", "date": "2014-02-22", "cool": 0, "user_id": "hJulW1s6tOBr2NXD9nAoMQ", "business_id": "_F1_05YYlvePzomZ_NFijA", "stars": 3}, {"useful": 1, "funny": 1, "review_id": "k97zgZ4gsmyop_imJUosKw", "text": "Rude staff!  I rented two patio umbrella propane heaters for an event.  They were late on delivery the day of the event.  Then on the scheduled pick-up time, post event, they were also late.  I waited at home for 3 hours for the scheduled pick-up.  30 minutes post time block, I called and asked their status, or to reschedule.  The gentleman on the other end told me that now they needed to charge me extra money for a specific time pick-up.  I replied, I don't need a specific time, I just was hoping that you would meet the schedule you had asked for on the equipment pick-up.  I advised that the heaters were on the patio where the delivery technician had placed them the day prior.   The gentleman at A to Z said that again they needed to charge me more money as a \"set-up\" charge to get them off my patio, where they had placed them originally.  He told me that they needed to be curb side.  So, I alone, had to carry them up a steep driveway, and they were quite heavy.  It was a struggle and massive to handle.  The customer service individuals at A to Z were rude to me and non-helpful.  All they wanted to do is stick me with charges above and beyond already set contract.  I will never use them again!", "date": "2013-12-17", "cool": 0, "user_id": "IWGXrVJaQI6QW-_11cqTcw", "business_id": "s2FWW3HzoPHHpMmkca7maA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "EKJxsELERxMgD7jepl5i-w", "text": "I love Artigiano. Although, the service isn't that friendly or personable, they do they job properly and efficiently. \n\nI absolutely SWEAR by the Spanish Latte. One of the cashiers was the first to recommend me to a Spanish Latte and now I am addicted. \n\nBeautiful cafe inside too.", "date": "2012-06-15", "cool": 0, "user_id": "SL7flTbdIekoh9_1iHhxyA", "business_id": "PPfDGRXA4DXqejytd41umw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "JYVu3cuQX6HJueHkHYxSbw", "text": "Highly disappointed in this place.  First of all the line is long, the pick up register was empty and could have been used to make the line move quicker. We were not told that the sauces were at a station. When we got our meals my mac and cheese was cold and the pulled chicken sandwich was dry.  To top it off, all of the buns on our sandwiches were soggy and fell apart.  Overall save your money, there are better bbq places than this one.", "date": "2013-03-09", "cool": 0, "user_id": "BJNcLl4SHRdXlz0RUC7E-g", "business_id": "-B_4pHQkzU12AMaYkkY4cw", "stars": 1}, {"useful": 0, "funny": 1, "review_id": "jLn79oA51JjBylgBNfrCdg", "text": "We've been training with Ian here for over 6 months so far and highly recommend both the gym and Ian. Don't expect anything like a big-box gym experience - this is a performance training facility focussed on results!\n\nIdeal for athletes or former athletes but also is accessible with top-quality training for desk jockeys too.", "date": "2015-03-29", "cool": 0, "user_id": "KLLBg8pTzjiD1nWUHsjMAA", "business_id": "9RHaeLIbJ3NFzrJI8RaZqQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "xqh_V0dlgA57jqBbUukXpA", "text": "Priority Pools and Ron Rudy were referred to me by my brother-in-law when I had my pool built last summer.  Their service is exemplary! Any time I've had any problems or pool issues (from low water line to a murky pool), they send some one over right away and it is fixed immediately.  Very professional, super nice, and they know their stuff.  I cannot recommend Ron, and his entire crew highly enough.", "date": "2015-07-04", "cool": 0, "user_id": "Lol72qBdxMV96PJpjdR65g", "business_id": "d_3T8hgY7PAKGW-t4LCHvQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "dRUI4RAuGAV35X_rHm3KqA", "text": "Cute brunch spot, great service, enjoyed the breakfast sandwich, and bottomless coffee! If it was my neighbourhood I could see eating here more often", "date": "2016-09-01", "cool": 0, "user_id": "vexkrpa0-IAZ_j5z7ZJyxg", "business_id": "ufwkkMd9yr9cFU1R5ONArg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "qzy9QFWLkyauZefzmt7T8w", "text": "Quality, upscale barbershop with neighborhood prices in the heart of the newly updated Downtown. All barbers are equally talented, with a combined total of 25 years of experience. Come and experience a REAL barbershop with REAL barbers. No Bullshit, just great haircuts.", "date": "2017-02-03", "cool": 0, "user_id": "_9FJo67GBwS_jPaPLwnszw", "business_id": "MDmziyjffQLQDwjpK-7rfA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "HM7_PYpcBWZSmIhTc-RH7g", "text": "Great service! Friendly atmosphere! Lisa and her staff were absolutely fabulous and I am so happy with my nails!", "date": "2014-08-23", "cool": 0, "user_id": "ciL5golE8-RciDds1aLuvQ", "business_id": "cT1eYUOjz5CgvZJuxu87sg", "stars": 5}, {"useful": 15, "funny": 0, "review_id": "IrqcYcOvIx86Y4bw4qS8ew", "text": "This was the worst experience I have ever had.  I purchased a car that then had issues within the first 24 hours.  I took it back as they gave me the impression I had a 10 day return period.  Turns out it was just an exchange period so after many wasted hours I am still without a car and they will not refund the $2,750 I have give to them.  The owner, Jack, just keeps telling me to come pick up my BMW....which I said lets exchange many times to.  I've gone twice and spent hours looking for something else and they have nothing so then I was told I was being difficult and my expectations were too high.  NOTE:  If you buy a car from these guys you must have LOW EXPECTATIONS!  I strongly recommend you DO NOT BUY A CAR FROM THIS PLACE!!!!", "date": "2014-05-05", "cool": 0, "user_id": "z2rwgHZ_0gxQdysWw_0XCQ", "business_id": "Pbh0WNaKvkyI7HYwQMEWpA", "stars": 1}, {"useful": 7, "funny": 0, "review_id": "l4q5Opk2Btg69jD7iO1_jg", "text": "Worst furniture nightmare of my life!  Absolutely do NOT buy from these guys if you are planning on having your furniture delivered!  They showed up exactly at midnight on a Sunday and left damaged furniture that I tried to refuse.  They were supposed to send someone back the next day to pick up.  It has now been 4 days and I have taken 2 days off work for their so called scheduled pickup times only for them not to show up.  Absolutely ridiculous!!!  I lost more money in wage from unpaid work time then this was worth!", "date": "2014-05-23", "cool": 0, "user_id": "z2rwgHZ_0gxQdysWw_0XCQ", "business_id": "H8RPjZJMrDC7nNcx2S6nHQ", "stars": 1}, {"useful": 3, "funny": 0, "review_id": "1CJVt_LZ_3gZCGxa1chM8w", "text": "Coffee Tree has some seriously outstanding coffee. I guess they should. They tout themselves as being Toronto's first onsite roastery--since 1988. Despite all that time, it's not a colossal roasting operation. In fact, it's a small machine in the front window of the shop, but that's part of the appeal of this place: fair-trade coffee roasted onsite, in small batches, right in front of your eyes.\n\nAs it becomes available, Coffee Tree scrawls all of their different roasts and blends of contrasting kinds of beans on a chalkboard near the front entrance. Some of these blends and roasts change from time-to-time; others are Coffee Tree's signatures. On any given day, you can expect to find Casa Primi, Sensuous Morning, Tuscany, and Millionaire's Mixture; some of their well-known signatures. Other days, you can find blends that have been created exclusively for the week or month.\n\nRegardless of what you choose, this coffee is superb, roasted perfectly, and balanced. Sip it slowly, and you'll definitely find complexity. There's the perfect blend of sweet and savoury and none of the unpleasant bitterness you'd expect from other coffee shop brews.\n\nBut it ain't all coffee at Coffee Tree. They've got a surprisingly detailed food menu, considering it's a coffee joint. From breakfast, lunch, and dinner, to French toast, sandwiches, and empanadas, they've got something for whatever time of day you go. They've also got a chilled dessert fridge featuring in-house made desserts, which includes what they call--and I'm inclined to agree--the World's Best Carrot cake. If you're there, give it an unregrettable try.\n\nThe shop layout is the typical long narrow space of most Toronto street-level businesses, and unfortunately, their furniture and decorating ideas aren't much of a help. Despite having unforgettable coffee, the space makes the experience of drinking it feel closed off.  They do, however, support local art by featuring a local artist's work on their walls for sale, and that certainly is a plus, but when I was there, the art wasn't something I was particularly captivated by; but I'm told it changes. All this place really needs a little reno, and it would be near perfect, or at least get 5 stars in my review.\n\nDespite the poor decor choice, they still roast some brilliant coffee. Even if you're not in the neighbourhood, it's worth the trip.", "date": "2011-01-05", "cool": 2, "user_id": "YHWsLBS8jzZiPjKHMFOaAA", "business_id": "xD293QcX3kHO5Z1Kz5zPww", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "Lav3eOBnH3RMhgTa_GpQfA", "text": "First, I have to comment about how CLEAN this place is!!! It's weird!!! Coming from the service industry, I always look at the cleanliness of the place and this place exceeds my expectations! I was in awe how clean their cutting board was! lol. This place will make you feel like you're not in Vegas. The food made me reminisce that time when I was at the night market in Kowloon! A place I definitely will frequent more often. I tried the BBQ duck with rice and washed it down with a Thai tea. I will recommend both! CLEANEST Asian restaurant I've been to!!! You gotta try it just for that reason!", "date": "2017-04-19", "cool": 0, "user_id": "WrOumGq1dZ1CiBtz5DAtkg", "business_id": "aD0EslPREWGDlSpD0RMlEg", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "bDcAgkS8UZePukgVcDnGDA", "text": "I'd give them a zero if it where possible. Usually I don't care if the employees are rude and don't want to do there job, it's whatever. Today though one manager was such a jerk and didn't even try to correct the error that was made. Like I get it you have a lame job but at some point you have to do your job. I was so mad I use to go weekly now I'll never again.  I even cancelled the charge on my bank card. So beyond rude. If you hate your job that much don't take it out on the customers like just go home. Rude blonde lady.", "date": "2016-04-10", "cool": 0, "user_id": "W7h6VbiQ9F8PRh_yGnL_hA", "business_id": "C5H-eZfnxBkYN40xcNbDPQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "PcpXaTBTnPljzmCD9QAWkQ", "text": "The best!  Incredible theatres, seats, screen size, menu.  I can't imagine going back to Harkins or AMC after this experience.", "date": "2011-11-06", "cool": 0, "user_id": "GWGAv8h20-vkQi1U5rKhEw", "business_id": "Y5CTA3S9TVkpr3Yvwaki-A", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "k2cKunydWNN6QEvIjY2y_g", "text": "sunday night dinner, and not a busy restaurant at all.  not a problem at all!  it was my first time visiting this restaurant, and while waiting for my friend, i was welcomed to sit at the bar while i waited.  wasn't a fan of their rail gin, but was very happy to see something on the shelf that i liked.  gin and tonic it is!\n\nbah, forget the play by play.  it's a 3-3.5 star for me.\n\ni haven't been to italy, i haven't searched out \"proper\" italian restaurants in toronto, but as one other poster wrote (can i quote?  or will this post be removed because of plagiarism?)...   well CHERYL C. wrote \"...If you want poorly done Italian-ish food in a very 1988 atmosphere, go.\"  i LOVE that she wrote that.  i couldn't have described it better!  except that i didn't mind the food at all.  perhaps it's not a \"real\" italian bistro, or perhaps the guys in the kitchen don't have that much hair on their arms, but the food was decent i thought.  i don't think it's right to compare it to the restaurants downtown in little italy.  i mean, this IS scarborough, right?\n\nbut i'll tell you why this get's a bit of a higher rating than some people have given it.  service!  they were friendly!  they were professional!  and really, the prices were pretty decent and food wasn't THAT bad.  would i expect better food when i get my butt to italy?  of course!  and that is why we're in canada!  it's a sample, not a mirror image.  hell, you can't even go to mcdonalds here in toronto, thinking it tastes the same in south america or asia!  it will be different.  don't believe me?  then get off the computer, and go buy yourself a plane ticket and taste for yourself!\n\ni will go back to remezzo.  i won't be running to go back, but i'll go back.", "date": "2013-03-05", "cool": 0, "user_id": "hFgYkJzdBhR1whLwuG6oUw", "business_id": "iNhP0ejUf2jVzaR5YCOoEQ", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "l8ujBuM5mWMTdmY-OMIVqg", "text": "One of my favorite pizza places! The crust really is that good. Ive tried just plain cheese, roasted red peppers, and mushrooms -- all great. Make sure you get a drink though -- it can get a little salty. Best eaten fresh, not as good reheated later.", "date": "2016-11-13", "cool": 0, "user_id": "jD19Y-AJgGD9CBt6vrYDoQ", "business_id": "CJvN2k3gjR7JspTx21icTQ", "stars": 5}, {"useful": 4, "funny": 1, "review_id": "F5LuI2mVvdpJIbFNhl1X1A", "text": "This is my FAVORITE restaurant in Cleveland. I'm a vegetarian(though I admit I'll still eat seafood) and this place had a ton of extremely delicious options for my boyfriend(a vegetarian who does not eat seafood) and I to try. We shared everything and were very pleased with everything we picked:\n\nGuacamole / pineapple / jicama / chile habanero / mint- Extremely delicious starter, but be prepared for it to make you insanely full, we didn't even come close to finishing it.\n\nChile poblanao relleno / smoked gouda / chile guajillo / tomato sauce- The best chile relleno I have ever eaten in my life, the smoked gouda was a fantastic touch to spice up an old favorite.\n\nButternut squash + goat cheese empanadas / oaxacan red chili + chocolate mole- Absolutely wonderful, the squash and goat cheese blended perfectly with the semi sweet mole sauce.\n\nRemolacha / roasted beets + spinach / spiced peanuts / chihuahua cheese- This the was entree we split and the beets were roasted to perfection, since we were splitting the server went ahead and brought us extra tortillas without us having to ask, big plus in my book!\n\nSpicy Mango Margarita- You burn my mouth in the most delicious way! I am obsessed with spicy food and cocktails and this one hit the perfect balance of sweet and spice for me. \n\n\nI really hope I get an opportunity to dine here again before I leave Cleveland!", "date": "2011-08-23", "cool": 2, "user_id": "-uNFo2rNWRh8YpAYG8bfbw", "business_id": "F2pfjAZ_3dMTGCKv6c5wOw", "stars": 5}, {"useful": 3, "funny": 0, "review_id": "uNF3o9kuAm8wMlzSSWF9cQ", "text": "The macarons here are a work of art. They have mastered these little desserts to be the perfect mix of a bit of crispiness, followed by a delicious chewy center, and then followed by a burst of subtle flavor. How can a burst be subtle, you ask? Try one and find out.", "date": "2016-02-01", "cool": 1, "user_id": "8Rzkw9XdCN30sUlpFKKjdA", "business_id": "w2tr0PA0b3tg8pId0kjM-A", "stars": 5}, {"useful": 3, "funny": 0, "review_id": "foOQHE9ySrppRGxf0EgOgg", "text": "Had a dynamite meal at this great place. A couple of us had The M.O.A.B (Rightfully named, Mother of all burgers) The best of the big burgers I've had. I requested med. rare and it couldn't have been done better. The flavour of this burger with melted cheddar, fabulous, the onions mushrooms and bacon all still hot and freshly cooked and fresh toasted biscuit, top notch. The brightly flavoured accompanying  chipotle sauce is excellent as an intermittent addition of flavour. \n\nMy wife asked if it would be possible to order Eggs Benedict which was not on the menu. The chef was happy to oblige and 4 beautifully prepared eggs Benny showed, she was in heaven. The ham and eggs along with the a terrific hollandaise sauce were excellent. The Exec. Chef  stopped by our table to see if everything was to our liking and was surprised to see the eggs Benny were almost gone but by the way my wife was raving about them we all had to try some.\n\nNice casual area w/ upbeat atmosphere on the main floor and a beautiful comfortable dining room on the 2nd floor. We ate at many places while in Vegas and this one is defiantly a place to go for great food.", "date": "2015-08-13", "cool": 0, "user_id": "vQ0fqKaoq9yU5N1jluwHjg", "business_id": "fAlKTsfsUF6A5iujEI2Z1w", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "jZxoSrXPb29B-3kKBp-iSQ", "text": "We are locals that often have friends visiting from out of state. This most recent batch asked to see a Cirque show.  I told them that Mystere might be a good start - none of us have seen one of your shows. They booked rooms at TI and we purchased tickets for tonight's show, Tuesday, October 10, 2017 at 9:30pm in the front row 105, seats 1,2&3.  We stood in line to get tickets, stood in line 35 minutes to get into the theater, stood in line to give the snack bar $20 for 2 bottles of water and a coke, and then sat in our, excellent, seats for another 30 minutes eagerly anticipating the show but was told, 35 minutes after showtime, to 'exit our seats and proceed to the exits' where those of us who bought tickets could get our money back.  As if ticket price should cover our investment?  Because you couldn't pull your sh** together enough to go on, you SQUANDERED OUR CASH (ticket price doesn't reflect wasted, over-priced concessions), WASTED OUR TIME, and most heinous of all you EXPLOITED OUR EXCITEMENT.   For you it might have been just another Tuesday night; for us it was special.  Never again, Cirque.", "date": "2017-10-11", "cool": 0, "user_id": "8mtcV419UVm8nzeH7Y5-1A", "business_id": "KmuLLSyZJdNoarwcIERHcw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "wvzNjU1Og3rgHweCik-Vdw", "text": "Fantastic fresh beer, exquisitely prepared food - great deal for the price! Better key-lime tart than in Florida topped with real freshly whipped cream. Definitely going back before leaving town! Which we never do - usually like to try new places.", "date": "2015-04-04", "cool": 0, "user_id": "3ZkUO738I62m4D4dygkr3w", "business_id": "Mkb7dYT-tBGQPy6tUpWMKA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "A5VHAqagDqjjBVlr41PUYw", "text": "Great tasting food with attentive and knowledgable service. Family dinner with our 11-year old was a pleasure.", "date": "2016-04-16", "cool": 0, "user_id": "peFxHFeltAmJXazI4jwEHw", "business_id": "CnzzfFzVB4us-NHY-NhmsA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "XnGpUEZLnonmwbqLzyIk8g", "text": "We recently purchased a vehicle from Geoff Williams. He was professional, knowledgeable and extremely helpful. I appreciated his willingness to let us think about our purchase. We had been to other dealers who pressured us to buy immediately. We are very happy with our vehicle and with our salesperson.  If you are looking for a new or used car, call Geoff.  We highly recommend him and Chapman.", "date": "2016-03-01", "cool": 0, "user_id": "xJVgRZuKNRSmvIlub51YaQ", "business_id": "YAODkC2s68TbF_kB9rFmMQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "lveRcvN_2Fw8wlFhIXlOgg", "text": "I totally agree with these positive reviews- old school Vegas style that us locals sometimes forget. It warm and inviting. And live music-- ya just never know who you'll bump into. And just wanted to suggest the pizza for tasty takeout-- far better than one of the pizza chains! Still quick and much better variety of toppings that are fresh not canned. And they love garlic like I LOVE garlic!! Yum mm my!", "date": "2011-06-04", "cool": 0, "user_id": "snBLOw_NEhslK_LSlp48OA", "business_id": "k8BqCejnaMlw7aoVthvqyw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "2RUZZZWiy0-6r1KzeP6dmw", "text": "It's good pizza. Happy hour from 3-6 has good prices on both food and drinks. However I have to take a star away for the regular menu prices. We both felt our sicilian pizza was good but certainly not worth $32. We will probably return for strictly happy hour food and drinks but I doubt we'd go back at night.", "date": "2015-06-17", "cool": 0, "user_id": "AdxhlxXSGjRsCQxG6ZjfTw", "business_id": "y6QP5IrOJ7_FsB51jN2_Jg", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "AnLJ15U-tCjRlmiOKgmQcA", "text": "Short and sweet: Beautifully presented latte, but weak. Lukewarm latte, when I requested hot. Music was terrible. At some point the couple next to me started to rave dance to the music. I almost wanted to join in if I wasn't so busy yell-versing. I like the variety of clientele though.", "date": "2014-03-12", "cool": 0, "user_id": "ddUsCHQmQr-N4cHMl3S3fg", "business_id": "pkO54EbPl6E57Q0yu2XYRA", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "vQnuADdKmcYgq19L1bzdRw", "text": "Seriously the worst Walmart I've been to, I asked an employee where I could find clothing dye she just gave me this look and replied very rudely about it. Also when I tried find it almost half the shelves were empty or low on stock...this Walmart is slowly becoming like target empty shelves,low to ZERO stock and failing horribly, also the last time I went here I was looking for a brand of dog food I bought here before and there was none in stock I've come back to check numerous times and still EMPTY f***** shelf as always! All they had was the smaller bag. Avoid this disaster of a Walmart as they don't seem to stock up on their products", "date": "2017-07-14", "cool": 0, "user_id": "YnKgniSSRLCfEmtVxaOS5Q", "business_id": "HBYoTLOTyZSKTMk0c5b9pA", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "nieMawZeVRHLZLSyqoKECQ", "text": "Pretty good pizza! A little pricey but you get a decent amount for the money. Other people have mentioned Jet's and for whatever reason I prefer it's pizzas (the smaller square ones) to Luisa's.", "date": "2011-04-03", "cool": 1, "user_id": "g_gasrzH_1-On-MbIdeqpw", "business_id": "n5wZxYrle8ROuK-Saq-yyw", "stars": 3}, {"useful": 1, "funny": 0, "review_id": "GrvqWrfY1DCNnCRcBYesbg", "text": "Just love coming to this friendly place. The atmosphere and workers are great! Love my black tea and organic decaf Peruvian coffee. So relaxing and comfortable.", "date": "2014-09-27", "cool": 1, "user_id": "hjfUdZC218wZjhw_JLHqgA", "business_id": "zRn21C-gM2JOC6W8KoqVgQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "BNheFT9ZAqbpTD0IWISbVg", "text": "This gym is awesome!!! They keep it so clean and it's big enough that people aren't on top of you. Like any gym though there are those people who are just rude but it's NOT the staff. The staff is friendly and willing to answer questions quickly. This is my favorite gym of the LVACs not just because it's new but the layout is awesome. The pool is still under construction but I will love this place even more when it's finished. They also have fun group classes!! Brandy who teaches some of the Les Mills classes is awesome!!! \nBEST GYM!", "date": "2015-08-08", "cool": 0, "user_id": "SByZV0HByWV2RlxnzQ1hTg", "business_id": "cMHEWGbGdGy1WkThoh6oXA", "stars": 5}, {"useful": 3, "funny": 3, "review_id": "iR-AXpNl5TgnK1n3y5bhbg", "text": "Just by chance I passed by the studio and saw the ad for the 'Hip hop hustle' workshop.  Four sundays in June for $40--never mind that I live an hour away, never mind I'd be out of town for one of those sundays...I. Wanted. To. Live. My. Dream.  Yes, it's a save the last dance/step up kind of dream but dreams are quirky.  You want what you want.\n\nI told this all to the husband, he quickly agreed-not because he really wants me to achieve my dream-he didn't mind spending a day in Madison every week.  \n\nThe dance space is nice, a bit over the top pink but there was a respectable mirror ball.  My instructor, Jeanne, was friendly and, more importantly, helpful.  The first 15 minutes was a little warm up, learning some pretty easy choreography and then the majority of the class was learning a longer hip hop piece.  We learned a chunk every week and put it together at the end.  I felt pretty accomplished by the end of the lessons and wanted to continue the dream...\n\nThe studio offers lots of different lessons, even a thriller workshop or a britney spears set of classes, and---my next dream: west  african dance.  I had been to Mali and there is really nothing to compare dancing with live drums; you are alive and you are joyful.\n\nI either wish I lived closer or they moved here...but moving to beloit? or janesville? hehee....highly unlikely.  I could probably fit a couple more classes but once summer is over, I'll have to put the dream away.", "date": "2009-07-08", "cool": 3, "user_id": "UKwewudvMYdupcP-e4119g", "business_id": "556i_WzeMeptcpd7ALQroQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "1XxuKnkEjql3y2EOZ6tyng", "text": "kitsune udon\ntakosen\nsalad", "date": "2013-10-09", "cool": 0, "user_id": "w0PGaBMEUjYPSqUYGeU1sw", "business_id": "HUYEadSbGSQNHXFmT2Ujjw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "o1bLOfESeo6ecZ52wIy3BQ", "text": "????\n\nLobster combo", "date": "2015-09-23", "cool": 0, "user_id": "w0PGaBMEUjYPSqUYGeU1sw", "business_id": "Lv9wzkvPrVG-VdPGcw53_A", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "QxD_nf5BVkqXOeWG8VGEgQ", "text": "The food is not the greatest and they really need quality training in customer service! I found hair in my food and when I called to report it for a refund, I was asked how long the hair was! And then I was told I will not be given a full refund...I will not be returning!", "date": "2017-02-08", "cool": 0, "user_id": "zvsx526yJDhl-ckbz7B97w", "business_id": "LAKs5UatFvOhlaF4sZ1obA", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "7hDcQoidqL0MzYm_lfuehA", "text": "Outstanding Southern Fried Chicken!  Quality chicken, with a flavourful crispy coating. Some of the best I've ever had!  Coleslaw was fresh and uniquely seasoned. Def go back!!", "date": "2017-09-30", "cool": 0, "user_id": "rSlsywnkymvlvggoGDCx3g", "business_id": "r1yhavKIFik5sH0ovujlYw", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "lWXjKcU8PDRaq4tzvC589A", "text": "I've purchased their downpipe for my 2013 civic si. However, downpipe doesn't fit properly it is hitting a bottom of my car causing very loud rattling/vibration, horrible sound . I did some research, and I found  that all 4 doors civic si 9th gen have the same issue. Jeremy from full race, with the biggest attitude (worst customer service ever experienced) was trying to tell me to buy a new mount for the engine and that that would solve the problem. I tried to explain that other downpipe brands, like ultimate racing, don't have the issue and that their merchandise is faulty. Very disappointed!!! I'm selling the downpipe and buying different  brand.", "date": "2014-05-21", "cool": 2, "user_id": "Xx3iJroZkAMJq593-cCJxQ", "business_id": "-jfUzBSkFc4bxTOoi2BViA", "stars": 1}, {"useful": 0, "funny": 1, "review_id": "62m8AWydz3cNk3Yg3et86A", "text": "This place is great for breakfast. The food always comes quick and the staff is always friendly.", "date": "2015-06-19", "cool": 0, "user_id": "1WzprRhGqDbd3XcjJignTA", "business_id": "leBz5w1fa1F_ChFcHorBwA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "L1dKbKEiSxxbS4n8hvvUaQ", "text": "Great 6 night stay. Very quiet, large rooms with a huge bath, great service and. Lovely pools . It was a bit crazy because of the new year but it was handled well.", "date": "2015-02-21", "cool": 0, "user_id": "3cZPpN-IrA8CSc5PkZLbXA", "business_id": "na4Th5DrNauOv-c43QQFvA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "WN1N9YfllEJqrR5CcsAcCQ", "text": "I have stayed at this hotel 3 times in the past year and a half. There was a reason for that..it was clean, had nice staff, was inexpensive, had no crowds and most of all...no resort fees. As many have stated on here, I went on here a week ago to book a room, and there it was in bold letters..RESORT FEE. You're really going to charge a resort fee for a hotel that's off of the strip? Oh, and what do we get for the wonderful $25 PER NIGHT? A measly bottle of water, some DVD's, and a long distance call..oh and terrible internet? I am disappointed by this and I hope they soon realize that this decision will turn out to be a terrible mistake in the future.", "date": "2015-08-27", "cool": 0, "user_id": "H3hOAacpaHwIOdb2GJUU1g", "business_id": "UadjF8_TEWUbuU-QnzQicA", "stars": 2}, {"useful": 4, "funny": 0, "review_id": "z2Ak_fRSVlxyV_BttS1btw", "text": "I really liked dealing with Charles at Subaru South Boulevard. He was very low-key and easy to work with. I wanted an Outback in a configuration (color, style and engine size) that proved a bit challenging to find, but the Subaru South Blvd team worked their magic and the car is exactly what I wanted. I hope that the service is as good as the sales!", "date": "2013-10-14", "cool": 0, "user_id": "4N_DKmLap-hoY-LrG2JZGA", "business_id": "2Ky1Fi_siE7PQTpyGyo0YA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Uvk1mdUCzqoGoNYYfre9-w", "text": "We had a great experience with these guys! They had the best price out there and were nothing but courteous and professional throughout the whole moving process! They did end up being a half hour late, but they called ahead of time to let us know and they brought an extra mover (at no charge to us) to help make up the time. They did a great job wrapping our furniture and even helped re-anchor a shelving unit to the wall in the new apt. Above and beyond great service!", "date": "2016-01-21", "cool": 0, "user_id": "HEpxnJNUwTwviNvTfX5hMg", "business_id": "PKSslavO2Bbgpl3dlTypgA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "kICOGz5Nx_Kq_7by_ftMVQ", "text": "Delicious. Family and I had Calamari, the soup, lasagna, chicken parm and clam linguine... \n\nAll was awesome, best italian in charlotte", "date": "2015-07-27", "cool": 0, "user_id": "CgtVlevIEgY38aQ4tIwqtQ", "business_id": "tIiiq23utFKTs1At2bVD6w", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "7P0ggBT4n9h0DQ93RYaOFQ", "text": "If you like hot dogs you MUST go to Happy Dog.  I suggest you go hungry. The dogs are the best and the toppings are over the top (pun intended).  Seriously, you must try it.  They only do hot dogs and they do them extremely well.  Great service, yummy food, casual atmosphere and later in the evening all types of live music.  This is a go to spot for me, once you try it, it will be for you too.", "date": "2013-03-26", "cool": 0, "user_id": "HD2FUPkPVoe6-3RYx12ejw", "business_id": "anzCdD5eIEHwydTpXhLlUA", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "iXEJAF1XTscMh8_0F_4Ikw", "text": "Surprisingly good food for a dive bar. The all-you-can-eat fish fry is their specialty and we get it often. I do think it is priced a little high, but if you eat a lot, it's worth it. Their coleslaw is the best. Pastrami sandwich is great and so are their fries. Nothing fancy, just cold beer and good food.", "date": "2013-03-29", "cool": 1, "user_id": "QP7X9GLutn-q6g_kWocsGA", "business_id": "UHSN_kZGfG-jBL8iCfvgvg", "stars": 3}, {"useful": 1, "funny": 0, "review_id": "SX2n148TygygFBaXGp2GxA", "text": "I have yet to be disappointed by this place. They have a sampler where it's 25 wings for I believe $18? We chose 5 diff flavors, and they have so many to chose from! Garlic lemon pepper was not our favorite...I'm a fan of honey bbq and ming sweet chili and we always go with medium for a little bit of heat but not too much. The wings are HUGE! If your in the area try em out!", "date": "2015-03-21", "cool": 0, "user_id": "9U__mJx6LrcklZeENRwH6g", "business_id": "dPWHFb_sDduzcJdOZSqR5Q", "stars": 4}, {"useful": 32, "funny": 9, "review_id": "mVgbjejJ-yr1GjRv_Z3gqw", "text": "I had my vision of we of what my website would look like. Anthony and Jen understood what I was aiming at. And hit the nail on the head! I could have not asked for a better website. During the build of our website they communicated with us to make sure we would be happy with it and after our site was done. They took the time to show me how the use and update our site. They made me feel like family and not just another client. Kudos to the team at Las Vegas Web Development and Design!!", "date": "2013-12-11", "cool": 29, "user_id": "1Pd_8E2QMt39dH9Wd7OxiQ", "business_id": "a50NCNUXq3o8DpveZxI1XQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "dbFNIfjHZYsEOhQZWC24zQ", "text": "I absolutely love this place! I come here once a week, and always order the same thing, the bento box dinner special. It comes with a soup, salad, dumplings, rice, salmon teriyaki, shrimp and veggie tempura and one sushi roll! so much food and all delicious. Salmon is always cooked perfectly, and the tempura is the best I have had! Super crispy and tender inside! I will continue to come back weekly!", "date": "2014-04-23", "cool": 0, "user_id": "ijFzX5UHYFD709gncOSfqw", "business_id": "2SbyRgHWuWNlq18eHAx95Q", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "zFt8gTMJpCj1hjuV79c_0A", "text": "Needed to return a package to sender, they wanted to charge me $2.00 to put one piece of tape across the box. Got the wrong item from amazon and it said to take it back to a UPS store. I had to explain to her that my wife has a PO Box there, then she rolled her eyes and told her daughter/assistant to \"just tape it\". Poor attitude, poor service. I didn't need to buy anything so I understand I wasn't contributing to their business except for the amazon prime service I have that allowed UPS to ship me a package, but the attitude was unnecessary. Would've gladly paid $2 or more if the lady was just nicer.", "date": "2014-07-10", "cool": 0, "user_id": "M8V_esp0ddkCOFiPl9iBrg", "business_id": "6K8aodsJE0BBlZ0_zlHJ1w", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "k-QjuZCgnLqN74TVyhQkMQ", "text": "Absolute SLOWEST food service ive ever visited. They're consistently slow to a point of just plain silly", "date": "2014-09-09", "cool": 0, "user_id": "rWsmIlUA961Gl6kZSZUvQg", "business_id": "0OvM4_xU5cJYCo0bsbVEQw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "7R2K31tIPvY6STmWYbev1w", "text": "You want the deal on tv? Well they don't honor that at this location & also your chicken will not be hot which means not fresh. $10 to the trash. What morons hired these morons? They need to quit & hire people that will do the job right.", "date": "2016-08-16", "cool": 0, "user_id": "qjnwrcZPOIXnJWLznQkhTg", "business_id": "mAIPUQPJiWXudRbOaBX33g", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "KKrCp2NlUZXPmBXfDXTNFQ", "text": "After a year of being a vegas resident i found it necessary to pay some dues to bob flay and hit up mesa grill for my birthday dinner. It was good, but I am left wanting more. The apps were good, smaller portions than I was hoping for. The margaritas were amazing, i dont care what color the cactus pear margarita is I am drinking it (its pink). But my entree is what left me wanting more. I had the bone in rib eye and it really didnt have that much flavor. It tasted like a steak, which is good of course cause it is a steak, but a steak from mesa grill should have had more of a kick to it.", "date": "2008-11-01", "cool": 0, "user_id": "TuAuPTDZEldXkOt0a-n4Xg", "business_id": "XZbuPXdyA0ZtTu3AzqtQhg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "Ftd8gd2wgle7MasT_71q6A", "text": "We actually had a decent meal here at baja miguel's the other day. They have a daily lunch special from 11-3 daily that includes a frozen margarita, fideo soup, and your choice of two items to make up your entree that comes with rice and beans. The chips and salsa also come with bean dip and guac. I think its actually a pretty good deal if you are close by and especially since the special is seven days a week.", "date": "2009-01-05", "cool": 0, "user_id": "TuAuPTDZEldXkOt0a-n4Xg", "business_id": "Oto60yDwk1z72WmfWEYrjg", "stars": 4}, {"useful": 0, "funny": 1, "review_id": "xSt4DPGmf1TCNxJKH8Ltlw", "text": "dirty and grungy and small and intimate and everything a dive bar / music venue should be like... not to mention pretty well known bands play here... anyone ever heard of hilltop hoods from australia? they've played concerts in front of tens of thousands of people, but even from the back of the place, we could see them in all their white, suburban, hill top hoodiness.", "date": "2010-02-27", "cool": 0, "user_id": "cx-kUXWTf90AHoPcv25__Q", "business_id": "aC0PXKoObd5ax6Hc8afUnQ", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "RUX1GkezpAx6EX1SR14clQ", "text": "Terrible experience.\n\nWe placed an online order for delivery and the estimated delivery time was 45 minutes. After an hour and twenty minutes I called the store we ordered from to get a status update and they ensured me that the order had left and was on the way.\n\nAfter two hours the pizza still had not arrived. I called them again and the guy I spoke to was nice and apologetic, unfortunately he wasn't the manager as I think things would've been handled properly with him.\n\nThe manager, Robin, told me that they never received the order. I asked her why then, during my first call, did someone tell me the order was on the way. She had no explanation and claimed that I must've called another store - I didn't, I called the same number. It was also her assertion that I probably ordered from a different store, but would do me the favor of checking their computer to verify this. She said she would call me back in 15 minutes.\n\nFifteen minutes later, she called back and confirmed that the order was indeed in their system and I finally received an apology. She reviewed the order I placed, including the tip and total. I asked her if I was getting a refund and she told me that I wouldn't get the pizza if she gave me a refund.\n\nSince I wasn't about to pay full price to get a pizza delivered in three hours, I told her to forget it and take the charge off my card.\n\nLast time we order from there.", "date": "2014-02-28", "cool": 0, "user_id": "AeebNCHmOQjXYeL3bRJDxw", "business_id": "hlhXDG5GfUUWLduFbbAXzg", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "mddI9jHax7ryMqbzYXrnxw", "text": "Phenomenal , he goes above and beyond. I went in to get my hard drive for my MacBook replaced and was given the most reasonable price by Calvin. He got it fixed much quicker than anticipated and even took care of a few other issues. Would definitely go again and recommend him to anyone.", "date": "2016-09-09", "cool": 0, "user_id": "QUfHFbe9fG_gsN2yPvPxyw", "business_id": "YbCtyhwWljsfT9tuYwVIZw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "inzaAq1oTH24EFkPC0iJgQ", "text": "This place is awesome!!!! Everybody that works there is extremely nice, especially the owners and the bartender!! I drove 35 minutes just to get there and would have driven an hour if I had to, this food is amazing!! Best breakfast I've had in a really long time!! Will definitely be coming back over and over!! Keep up the good work!!", "date": "2015-08-03", "cool": 1, "user_id": "BSShwCtoIUbpnyhz0d2VSg", "business_id": "Yl05MqCs9xRzrJFkGWLpgA", "stars": 5}, {"useful": 1, "funny": 1, "review_id": "UDiRKMTuXfyWM-hGtACqKQ", "text": "First time here at there Vegas local. It was a big store with some nice selections. Jeffrey was helpful and so was Priscilla. Thanks", "date": "2014-12-01", "cool": 1, "user_id": "h6JSFt9OGwYvW0Owjte38w", "business_id": "zi181jKdVvt2gq1U6oX2BQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "NCdL59NbJfjpk7jct7yPOQ", "text": "One of the worse companies ever.   I wish I would of read the reviews before buying my ticket.   I didn't know there were other shuttle options and would of picked one of those.  Again do not use this company unless you only have $8 and have no other option.   And if you only have $8 call me and I will wire you the extra $2 to ensure you make it to your hotel.   All the excuses the company makes are BS.  If it is a busy weekend get more help or don't sell as many tickets.   Please increase your fees so you can afford to go to business school.", "date": "2015-08-14", "cool": 0, "user_id": "daDhzXSfqo_pUMwV8IKq6A", "business_id": "-2ToCaDFpTNmmg3QFzxcWg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "vthnHeKYu5RvjwXxH12XjA", "text": "Absolutely love this place!!! It's a bit pricey but so worth it. The food is excellent and the service is amazing!!", "date": "2016-02-26", "cool": 0, "user_id": "8edJqIsFjlQq3osF9iJ7qg", "business_id": "TkoyGi8J7YFjA6SbaRzrxg", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "N-caKQrWaEnkDP4MzRKSPg", "text": "Pros- bbq is good/location inside seafood city\n\nCons- food is not too bad i hope they can make it better\n    \n             Workers need to learn good customer service their kind of sad people hope they be happy...", "date": "2016-01-14", "cool": 0, "user_id": "-LDgq6wShQAsvEaBrkohnw", "business_id": "IEJFia0wQX7UezfXsenI5g", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "nppQ_PGX7VLT661aUDSwlQ", "text": "Checked out this place over the weekend since I bought the living social deal & it was about to expire! It was definitely worth the $25 we spent on the voucher. We had a flight of 3 cabernet wines & a flight of 3 chardonnay wines. We received a plate EACH of 2 cheeses with grapes, apples & nuts. Surprisingly we had a bit more cheese than we did of the fruit & nuts. Could have used a piece of bread on each plate to finish it off.  The bistro wasn't busy at all but the vibe felt a bit stuffy even though they did have baseball on the TV. The staff was just a couple of bartenders who seemed friendly & our server. The server was a tad odd & he mumbled when he spoke. All in all the food was just decent. We did only have the sweet potato fries & 2 teeny street tacos (2) for $5 on HH.  The prices were reasonable since we stuck to the Happy Hour menu. I think I have a couple of other wine places in the East Valley that would be my choice before I go back to D'Vine. I'd say 2.5 stars if there was a half to give.", "date": "2011-10-07", "cool": 0, "user_id": "N3ieT9TJvdpVZ3eMyl32uA", "business_id": "XJN3OhXLBDa8zAqdi21FFQ", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "HX_F53QqlsD9n_CrL8U1bg", "text": "We decided to try this place since a band we like was playing there. Nice selection of craft beers on draft. And the menu is a good mix of different options from burgers to wing & a prime rib special on the weekends. \n\nThe place wasn't very busy when we arrived around 7pm on a Saturday night. We were told we'd have 2 servers one of them being in training...\nNot sure what happened - service was fine thru dinner but the service took a nose-dive after dinner. The place wasn't particularly crowded but we still had to hunt down the server a couple of times for more drinks. \n\nThe bacon blue burger was good with a healthy serving of thick cut bacon. I would recommend the steak fries over the HOB fries.  The honey hot wings were good but didn't blow me away. We may go back sometime just to try out the prime rib special or the potato soup. I'd rate this at 2.5 stars if a half-star was available.", "date": "2011-08-15", "cool": 1, "user_id": "N3ieT9TJvdpVZ3eMyl32uA", "business_id": "soqpbgQt0v4BrEOwV03FkQ", "stars": 2}, {"useful": 2, "funny": 1, "review_id": "Keqpw24WJBQMUD5Qol5cIA", "text": "Ran across this smog station on Yelp and got a discount for mentioning Yelp as well.\nPulled right up and Ronnie came out, greeted me and offered me a beverage. He took care of everything extremely quick and had me in and out in less than ten minutes.\nGreat service and a friendly guy! I'll definitely be back next year to get my next smog check. Thanks Ronnie.", "date": "2016-01-14", "cool": 1, "user_id": "TedS4QG2aj5BCAQ-LOIiCA", "business_id": "d8WZtx4dZUvT9Sg9NXGb3Q", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "vT9koKgCMWq0TLK05eXIBA", "text": "Ridiculously slow and bad and inefficient service... Even though they're nice enough people doing it... So I blame management for not having enough staff", "date": "2017-10-04", "cool": 0, "user_id": "RQk_rXm0cuDO3AYJ-InCug", "business_id": "K6XIGkyk7-fuOQtA8i7p6A", "stars": 1}, {"useful": 3, "funny": 0, "review_id": "G4C_1IS0CLvv7NyEskQYtg", "text": "Have taken several cars to this place.  Always one time and it is fixed.  Recently had a noise issue.  It wasn't my transmission but they fixed it anyway and did not charge me because it was a simple fix.  Great service.", "date": "2014-04-11", "cool": 0, "user_id": "1uYXBeQG2B4Ew6DmkyjpaA", "business_id": "_YHMyBxsf9rw6LQYVejuZQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "42sOsXbuph7Wc_4ZuKrxug", "text": "Stayed here because it's one of the lesser expensive places on the strip.\n\nWe booked online a couple of months in advance.  When we go to check in (which was a zoo, but the lines moved along fairly quickly) we were told that the room was paid for but that they needed our credit card for the $8 resort fee (!!!!??)  I knew some of the resorts had fees but it said so on their site!  I never saw anything about a resort fee when we booked so that ticked me off.  \n\nWe were famished by the time we got in (flew in from oakland) and had met up with some friends so we went over to Rock & Ritas for a bite to eat.  Decent margaritas, food was so so, definitely not worth what they charged for it, but it was ok.  Checked into our room. I was pleased to find that it had a large bathroom, but our view was terrible.  We were on the 3rd floor of the Skyrise Tower and had a view of the roof.  Meh, get what you pay for I spose.  The bed was surprisingly comfy, but smelled slightly of cigarettes.  Thanks to the very loud A/C, I didn't get but 2 hours of sleep that night.  Only blew air about 30% of the time and it wasn't even cold air so our room was not only noisy, but muggy the entire night.  We tried turning it off but then it got even hotter so we just dealt with the noise. (not good when I had to fly home and be to work the next day!)\n\nThe Adventuredome was not what I remembered it 10 years ago during my first trip to Vegas.  The sign said open til midnight and we got there around 4 and when we went to get the wristbands we were told they were only open until 6 and if we wanted to stay til midnight it's an extra $10 (some sort of halloween fest).  We said forget it and used our free ride coupons we got upon checkin to ride the rollercoaster and left. \n\nThe midway was the typical Circus Circus midway, with the games and shows.  I was disappointed to see that the carousel bar was out of service.\n\nWe didn't gamble here (we went down the strip) so I can't review their games.\n\nFor the price and how little we stayed in the rooms it was ok.  I will definitly try other places next time I'm in town.", "date": "2010-10-12", "cool": 0, "user_id": "uG6C3WT4bcpv_M6utVIJYA", "business_id": "6Q7-wkCPc1KF75jZLOTcMw", "stars": 2}, {"useful": 6, "funny": 1, "review_id": "jWpKu3J-HQ6wpugIcCSk0w", "text": "We had a major move across town.  I can't say enough good things about this moving company.  Besides providing me a great price with no hidden costs, more importantly, from top to bottom, these guys were dedicated, professional, approachable in a willingness to ensure our belongings were taken care of and that we were pleased.  Truthfully, these guys take customer service to a higher level.", "date": "2015-04-05", "cool": 0, "user_id": "mj1Zjhqyl-BduuiA054CqQ", "business_id": "uLi1uij3L3Np6L3BXLEpqw", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "uZ4S67wbziBZZ0CWjFpK0g", "text": "Got the Asiago Omelet.\nIt's not all that,  but good enough to get me through lunch.\nQuick service.\n16oz cup of coffee is $3.49! might as well just get something at Starbucks. \nWould return, try a different sandwich. \nNot bad for airport location...", "date": "2016-09-19", "cool": 1, "user_id": "dQuSMLAbDO_zVduKNVD40A", "business_id": "ykfsYdN3QF8HEBa9EbJRBg", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "74dL4tEhxGvS-ZJnnHeJtg", "text": "Too bad only 5 stars could  be given... because to me they are on 10. I enjoy my stay every time I'm here. The staff and the experience are both great. Speaking of staff Kathy and Mai (who told me not to be talking about her) are my fraaaans! They are always laughing,  talking and very friendly when doing my nails. Edison and LK are also top notch! Couldn't ask for a better experience when trying to have your \"me\" time\n\nWould absolutely refer a friend here!", "date": "2017-07-15", "cool": 0, "user_id": "crt5ZxhUCJxA-nep5nMb7A", "business_id": "PRD-k4_317ofTh9TflO5dA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "a7RWcyPC-meUDu4WHCXBJA", "text": "Deb did an awesome job on our son's 1st Birthday Cake.  We live out of state and held the party in Cleveland for all our friends and family.  To work with Deb was seamless!  I sent her a photo of what we were looking for and she certainly delivered!  I would definitely recommend her to anyone looking for a custom cake.  Not to mention... it was DELICIOUS too :)", "date": "2017-05-30", "cool": 0, "user_id": "RlQJtd_9xti7dZxceVM0-A", "business_id": "_L8K2hGDB7X-4_CvgT5ekA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "7wmBnw0zpSJevVQ30HWxTw", "text": "I've gotten pick-up orders from here many times. It's standard Americanized Chinese food that hits the spot whenever I'm driving by and get a craving. The food is promptly made (about 10 minutes after I call in my order) and the vegetables taste fresh. I'm a big fan of their crab rangoons; there's lots of filling in them compared to the rangoons from other places. The sauce and meat in my meals isn't as flavorful as other Chinese take-outs have been, but it's still tasty. And my experience with the staff has been fine. Also FYI, it's cash only, and there's an ATM right outside by the door. I've never eaten in (there's a few tables) or in the buffet that's attached next door, so I can't speak on that. But overall, if you're getting a craving for some inexpensive Chinese and you're in the area, might as well give it a try.", "date": "2015-12-17", "cool": 0, "user_id": "jqmaBlwq5Zy3kwSYEScRsA", "business_id": "-UjCvAsvBOr19y8lqPueiQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "Ezf8J7vsb_NSkAe_X1XYiA", "text": "Their vermicelli and charred pork is freaking delicious.  However if you eat here the wait staff is pushy so be sure to have your entire order ready when they come to the table because they do tend to rush you out the door.  It is almost comedic,  if you can over look the service,  you'll enjoy this place.", "date": "2015-02-09", "cool": 0, "user_id": "XkF3_q7-ZCX8xGRsWOzRSQ", "business_id": "yfxDa8RFOvJPQh0rNtakHA", "stars": 4}, {"useful": 2, "funny": 0, "review_id": "qTJlC92T96IT6tgYHdFs6A", "text": "First class all the way. This place is nestled in the Town of Carefree. The staff, the service, the property is outstanding. We live in AZ and felt miles away from home. Very tranquil and laid back. This is a great alternative to Sedona. In fact, we'll visit the Boulders quite a bit more now.", "date": "2011-05-31", "cool": 0, "user_id": "_syH6ryl48-UFYL5KsXqZA", "business_id": "OzUlkI3NZtXpsuZtJ9Zmbw", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "eejG3bujoONdYUZNBFt1PQ", "text": "Excellent pizza (cheesy, chewy, )and wings( crispy, meaty and spicy). Menu is kinda extensive and I am excited to try it all out. Looking forward to try this pizza bowl thing that I saw( insert drooly face here)! Staff is super friendly too, always a bonus.", "date": "2016-09-20", "cool": 0, "user_id": "DQcuu6xlq6es-eqTMZlV7g", "business_id": "CRVtzesMuwHK-phmS_ojaA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "3saQg90lOGSzQ1foZ9bdog", "text": "I love this buffet, most of the food is delicious but the sushi is a DISAPPOINTMENT. The ice cream  is delicious! I love it! So is the fresh bread! Also a big pick of fruitsIt's an ok place to spend time with your family I go there often and I see a LINE of people, ( it goes by fast ). This is a good place and depending on your taste you might like it! Altogether 85% good (4 )", "date": "2015-02-28", "cool": 0, "user_id": "uw-aCFJHO_WeuvDd8uphMA", "business_id": "0WoQQlMXVIDEgI0xNdENKA", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "UnNv4oso2JD-UjbftRJ3uA", "text": "Loved the medium fat burger and onion rings. Shake was great too. Sitting outside in the mist was brilliant in the heat of a summer night. Good service and quality burger.", "date": "2015-07-29", "cool": 0, "user_id": "ORff8VuSb_wXvie93oi64A", "business_id": "LtXy1VinKWfuLFslVarKRw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "vr8QK6mua0fNcPm9NTh2Tg", "text": "Wow. Amazing homemade marinara, best garlic knots I've had, and $9 with will last 3 meals for me. We came in for lunch on a Thursday and the one guy behind the counter gracefully balanced taking orders, cooking (even tossing dough and stuff) and bringing everyone's stuff out, and chatting with the regulars. Indulgent, great value, a real winner.", "date": "2013-01-18", "cool": 0, "user_id": "fasMqlckv8YXMrMEOwZkmg", "business_id": "SkSkWld_ijmWVEDo9_ztKw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "owY2wR1VPvz04RheiQR3eg", "text": "Just realized that as of today I have been going to this nail salon for a whole year already! I have no complaints. I've gotten my nails and toes done by almost every single tech. They're all great.", "date": "2015-04-24", "cool": 0, "user_id": "lTJ3wCesoPJe95t41cCa_w", "business_id": "FOqYmI24hSVP4EUibW-9zQ", "stars": 5}, {"useful": 3, "funny": 0, "review_id": "aCZxOvwyyEh090KrJRL73w", "text": "This has been my favorite restaurant for years but the New Year's Eve service has totally ruined it for me and my friends. I will continue to eat there but I won't tip much anymore.\n\nBasically, we ordered. The food took a long time to get to us which is a little abnormal considering they weren't too busy. Especially since I frequent this restaurant several times a month. It took around 40 mins for food to arrive. My boyfriend wanted to order a second item and the head cook actually walked by our table and glared at him. Maybe because he's black? I'm suspicious. Around 12PM a rude waitress told us: \"You have to leave.\" No, sorry - we are closing. Just you have to leave? So, we left abs paid our bills but they hassled us to leave even more so no one got change. We all over-tipped by $3-$6 dollars. Once our small group was out we had a waitress chase after us, specifically, my boyfriend saying he never paid in full. Bullshit, considering he fucking over-tipped too because I saw him put over the amount and complained about it. Being a nice guy he paid the waitress more then the difference on the fucking street. Too bad I was walking ahead of our group at the time and only saw the latter part of the transaction. Or else, that waitress would have a bleeding ear from my yammering. \n\nWorst service I've ever had in my life. It doesn't help that the black couple beside us had a similar experience too and they seemed to target the black customers at the time. The whole group was Asian including me. I like their mediocre food but that doesn't mean I'll tolerate the way they fucking subjected my boyfriend. Never tipping again. Fuck you, Hosu.", "date": "2011-02-04", "cool": 1, "user_id": "aIBePDfR0XuMOAFO4c67fw", "business_id": "QTSCFDPcuROE8UCvGS8Fiw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "F1l-uvLT5_WOnTCE4xs5og", "text": "Excellent view on the observation deck.  Had a great time, don't miss it.", "date": "2015-07-12", "cool": 0, "user_id": "TVLzZizN9_xGqeg4MAKlUg", "business_id": "zNOfHgMWZtG1vVA3Ca9fCQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "aYDCHqozeXATYcO9n5R5Xw", "text": "My wife and I had our date night at the Esplanade for the first time since it's renovation.  I was surprised at the changes made to the place.  Gone was the old ticket booth, and the lobby/concession stand area was turned into a bar lounge type atmosphere.  Looked like a cool spot to hang out and wait for your movie if you were early, or even to it and chat, if on a date, after the movie.\n\nYou can purchase your tickets at the automated machines, or buy/pick them up inside at Guest Services.  \n\nThe employees were very cordial as we passed them on our way to our seats inside the theater.  We decided on the Cinema Suites, since it was 21&over.  We were impressed with the layout, and the very comfortable seats that recline.  Our server was very nice and informative.  I was surprised when she was entering our order into her pad, the other servers were bring our drinks and appetizers.  WOW!  That's faster and more impressive than a restaurant.  \n\nI had the sirloin tips and mashed potato's, and my wife had the fried shrimp with fries.  I can't comment on any mixed drinks, (another reviewer complained of watered down drinks) mainly because we had wine. \n\nAll in all, it was ok.  Kinda like food at an Applebee's, or Chili's.  Nothing to go crazy about, mediocre, and over priced, but it WAS a MOVIE THEATER.  I mean, It's not a Michelin Star restaurant.  I don't care that it is in the Biltmore area.\n\nThe thing that annoyed us the most were the 2 pompous couple's we sat between.  They constantly complained about something.  Mostly their refills.  The waitress explains to you, should you need something, PUSH the call button.  They never did.  They expected someone to come by.  The point of the call button is to minimize the wait staff running around disturbing patrons who are watching the movie.  \n\nThis is the main reason I gave 4 stars instead of 5. They were really annoying. \n\nIt's like this.......You are at a THEATER that serves food and drinks.  Not at a Fancy restaurant that shows a movie.  You're paying for the comfort and experience of being able to relax, enjoy a drink or dinner, all while watching a movie.\n\nBottom line, Food was ok, a little over priced, so watch what or how much, you order.  If you like to drink, have a beer, wine, or straight drink, if you are so worried of getting it watered down.  The employees from beginning to end were excellent.  And the over all experience was very enjoyable and fun.  We would definitely do it again real soon.", "date": "2011-10-10", "cool": 0, "user_id": "FTEME8jXoaQZofiVAYvX0A", "business_id": "MM8n7SPaIuMlDGbUM5SZhA", "stars": 4}, {"useful": 2, "funny": 0, "review_id": "71Qw0Jk1R2_uXVh79dRLGQ", "text": "Adrienne is by far THE best! I don't trust my hair to just anyone, but with her I have no worries.  I've been following and going to her for hair cuts, color, and eyebrow waxing for years.  She is definitely amazing at what she does. Check her out... you won't be sorry.", "date": "2014-08-09", "cool": 0, "user_id": "00TnZeglz_8gxeJnABWe-Q", "business_id": "VkIUoGHYfXyOIzoHUNr-9g", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "yJKNDnDiPo1JT4rvpCN-rQ", "text": "Worst china and gifts store in Toronto and the GTA! Clueless and dishonest staff. I was looking at both the Denby white french onion soup bowls and the Gordon Ramsay french onion soup bowls (both with lids). I was told the Denby were discontinued and final sale. As this was a gift, i decided to play it safe and i purchased the Gordon Ramsay bowls, i even said aloud that i would return them if they weren't quite what he wanted. They knew it was a gift, they knew i wanted to return them if they were not suitable. The next day, i went to return them, and the exact same woman who assited me with the my purchase (blonde hair, heavy turquoise lower eyeliner) said that i could not get a refund, i could only get a credit note ONLY. I was furious. BEWARE of this store, they are not up front with their clientèle. I will also be posting this to the Better Business Bureau and elsewhere.", "date": "2014-11-06", "cool": 0, "user_id": "rljKsD-dStp_jCZ9stMlLQ", "business_id": "JhVqicPFe-ms-6sibBER5g", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "c2NWd67hDlmmM7SM2WaV9g", "text": "This was my first time trying Egyptian food and it was amazing! Came here with my whole family after a long day exploring Montreal and everybody agreed on how delicious the food was. The most memorable for me were the falafel (vegan option for sister- very yummy, especially with the sauce) and the Hawawshi (so dang amazing, my mouth is watering right now just thinking about it. The minced beef was spiced to perfection and the flatbread was nice and crunchy. Each bite was happiness.)\nThe service was very prompt as well. The server was very nice and answered all of our questions with patience and thoughtfulness.\n\nI will definitely eat here again the next time I'm in Montreal!", "date": "2016-09-05", "cool": 0, "user_id": "fC4MprZBOD8po-2DOXTRCA", "business_id": "99i_1G3APKgIEh1VTK0CpA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Fjmk4srqQujHD-ktczAfEQ", "text": "Nothing but top notch services from Lexus of LV. \nIf you are looking for a new ride, look up Johnny Chang.  He will get you the best deal and put you in a car that fits you. You won't regret it. \nWe've gotten two vehicles from him and will be back for more when the leases are up!", "date": "2017-01-23", "cool": 0, "user_id": "uwGUVjnIeDY0fen5YZPraA", "business_id": "8UBOqmp97HzYB15PfKsChw", "stars": 5}, {"useful": 4, "funny": 1, "review_id": "HRLSFtjVAQI9M3FIbm_f-g", "text": "I moved to Vegas over three years ago and was looking for a new skin care clinic. I can't stress enough how happy I am I chose to go with Lakes Dermatology. I was diagnosed with rosacea and was looking into treatment options. The technicians at the Lakes Dermatology Spa are amazing. I have sensitive skin which reacts very unpredictably to topical treatments and lasers, and they knew exactly how to treat it. It's the only spa I've come by that knows how to find that elusive combination of gentle and effective. I'm happy with the results I got from my spider vein and redness treatments. They knew my skin better than I did, and also provided recommendations on the right products to use, which finally put an end to my search for a perfect moisturizer. This is the ONLY place I can fully trust when it comes to my skin.\n\nDoctor Rueckl is very professional and knowledgeable. He recommended the right treatment for my condition, explained why my skin acted the way it did, and honestly informed me of my options. He also provided at least 6 sessions of laser ABSOLUTELY FREE OF CHARGE when he realized my skin was very stubborn and needed more treatment. That is superb care, and I'm very grateful for it. Not to mention, the consultations are always free, and I received all the answers I needed and got a bunch of product samples without spending a single penny. Needless to say, I'm sticking with this clinic, as I couldn't have asked for better treatment. \n\nIf you want to get excellent care coupled with professionalism and generosity, this is definitely the place to go.", "date": "2013-11-18", "cool": 0, "user_id": "kwV24XuUKN5ncelesciW-A", "business_id": "B7Oe-JGVlN2ksdSfA4UZYw", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "s9Im2198fxUCxyMh8Q8U0Q", "text": "Expensive MOTEL.  Loud wall coolers (not central air), suits have no coffee maker although it was part of the pkg.  clean room (mostly because it is new).  Check in staff including management has a \"take it or leave it\" attitude.  $28 resort fee pays for somewhat decent WiFi, pool which is not yet finished (use pool in hotel down the street), and gym. \nValet, bell, housekeeping staff are pleasant and helpful.  Wake up service is not on time.  Just because you request a suite with a king sized bed, don't expect you will have it when you check in (staff claims it is only a request and therefore not an obligation for them to have it for you.  still under construction so if you want to sleep past 7 am, choose a different place to stay.  \nOverall, not at all worth it!!", "date": "2015-03-01", "cool": 0, "user_id": "NQT68XPL0xqxDt3EVVYylw", "business_id": "ThNGovQZjZ5mn-ZwX_N2BQ", "stars": 1}, {"useful": 7, "funny": 2, "review_id": "NkYmtvlCcNhNOx41t0NTVg", "text": "Technician came out promptly but misdiagnosed my AC. Recommended $2000 fix that ended up not even being a fix to problem. Diagnosis through another company revealed a $150 control board replacement. Tech was fast and efficient but what can I say? He missed the mark, almost got me to overpay for unnecessary service, and nearly swayed me into replacing the whole system. While impressed with presentation, broken AC stayed broken till a more thorough tech took the job.", "date": "2016-08-13", "cool": 0, "user_id": "yNC2hsLkKlC0XMZ02QuHIA", "business_id": "v0gv0vS2MAj63orJ0MeWfQ", "stars": 2}, {"useful": 2, "funny": 0, "review_id": "nIbRQGRvjwQz6_MHfdVllA", "text": "We love this place, genuine taste of the cuisines and great service", "date": "2013-07-07", "cool": 0, "user_id": "WaIcO6KYk6ZFfAffzkq4jA", "business_id": "eLMCasvWCkJYDkvkKREz7A", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "qVkPwGJaDMAPgi7P16wejA", "text": "The buffet always has a long line to get in. Then It is pricey, but The seafood is good tho. I might come back. But i liked The ceasar palace's Better :)", "date": "2015-12-04", "cool": 0, "user_id": "PnTSCTTvI1TKSmuv0omw4Q", "business_id": "ujHiaprwCQ5ewziu0Vi9rw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "yeb2AmkjwxbDh2ZOBD41yA", "text": "I've never gone for a spray tan before and was nervous about many things ,stripping down in front of a stranger, having someone I don't know in my home, and of course I don't want to be orange! No but seriously I'm very fair and was terrified lol \n          I felt so comfortable with Samantha, she walked me through the process before we started and during. She is friendly has a great personality and makes you feel comfortable &  beautiful :) The tan its self was perfect and I love that the product smells great and last at least a week. I've had many compliments about how I have a nice brown tone and not orange.\n        I have now had 3 tans with Samantha and will continue to maintain with Sunless Beauties!!!! Happy client here!", "date": "2016-03-22", "cool": 1, "user_id": "OKBJaZlXMmp_GZrE94yWUg", "business_id": "7xR3-u5uU4_flEpCQB8h4w", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Zd1KKOZr5JbEcQF3yNvQoQ", "text": "Met up with a friend for lunch. Wanted a hamburger, but didn't want to go to B spot, so headed to Paladar instead. \n \nWhen here, you have to try the guacamole. We shared the traditional, but if you are with a large group, order the sampler of guac. Yum! The avocado is fresh. It's smooth with a nice kick of onion and tomato. It's served with assorted chips: tortilla, banana and taro? \n\nI ordered my hamburger made with avocado and fried onions. Side of sweet potato fries. Nice combo. The ketchup also had a nice kick...maybe mixed with some sort of hot sauce?!\n\nMy friend tried the Tilapia, which was moist and fresh! Came with a side of green beans with a nice crunch. He finished his whole meal, which is always a good sign! \n\nThis was not my first visit here. I have probably been here more then a handful of times and most if not every time, I enjoyed my meal. The price is debatable, but the portions are large. \n\nIf the weather is nice, enjoy your meal out on their patio!", "date": "2013-09-08", "cool": 0, "user_id": "OtDyoP9vZt3ucXou4K88Kg", "business_id": "Yevhl8bTwdJuu_LWKv-4Fw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "3B0bDfZmMyTIDyKdZ5BbFA", "text": "The worst cab company in Las Vegas, NV. You should get minus stars. I have used this company for the last time. They consistently try to long haul me even thought I tell them how to get somewhere. They drivers play dumb and say I don't know that way or they catch you on you're phone or they think you are drunk so they try to hop on the freeway as fast as they can or they say they make a mistake. I just don't understand why they always operate this way. Please do not use this cab company.", "date": "2014-02-19", "cool": 0, "user_id": "kp4ES15mhsPHR1uIx2AYHA", "business_id": "9NBkIExYYz3w9O5JdzDOMA", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "Mzo2DadpGd0SGMbeGPnOpg", "text": "I was driving down 74 the other day. Before I had time to change lanes I run over a giant piece of metal. I continued driving to Urban-Champange regardless. I got off on prospect and drove to Meijer's. In less than 5 minutes the fire department was there because my car was gushing out gasoline. \n\nThe fire department called Don's towing and I had it towed to a shop 5 miles away. When I asked how much this was going to cost me he told me the charge a different rate for calls made by the fire department. I was nervous. At that rate they would've charged me $120 but the guy told us he'd charge us their standard rate and only charged me $60. I would go through again if I ever needed a tow.", "date": "2013-05-03", "cool": 0, "user_id": "EUX9606ubHmRhIEPs1J2yA", "business_id": "6h4QQxgZ84PBN3nIea-DLA", "stars": 5}, {"useful": 4, "funny": 0, "review_id": "QeaDcCDWcWRL3qLaBr-zBw", "text": "After consulting with francis johns about a very small wrinkle , wanting a skin pinch like 3 previous doctors recommend including his previous teacher dr lazzaro, but what I ended up with was my entire lower lids to be  to the point of being right against my face with no distinctive roll or \"pockets\" defining the eye . johns said he only tightened my lower lids.  Well he tightened them so tight that they lost the curve and they are completely flat.  Yes I don't have any roll at the bottom of my eyes making them look unnatural.  I traveled though out the US seeking ocular surgeons (many of them lecturing all around the world writing books etc) all but 3 turned me away saying they have never seen eyes like mine before and couldn't repair what is going on. I went back to johns but he didn't offer any solution but to end our doctor patient relationship.  Not only are my lower lids almost non existing he also injected fat by fat graphing and now I am dealing with fat lumps that can not be removed, he gave me only one 5fu injection after months of my complaints and 6 weeks later he said he couldn't see it.  Well trust me it's still there along with many other lumps.  I agreed to pay him more money to have my cheeks injected with filler but i guess he must have seen my review on realself.com that's when I was notified that he and I are on different planes, and he finds it best if I seek another doctor.   So i just want to write this review telling of my experience with johns.   He was a nice person, but that's shouldn't be a deciding factor on your face, eyes etc and that should be for all doctors and any surgery. What i have learned I believe the best doctors to do your eye surgeries are ocular plastic surgeons who know everything about eyes, muscles (that should not be removed or trimmed ) fat (that too much makes you look older)  You can see 2 doctors I wrote about in yelp, very famous ones, highly experienced and knowledgeable writing and publishing books and articles.", "date": "2016-09-08", "cool": 0, "user_id": "yCJ5oKveYN2n8e2DFoJh1w", "business_id": "SeCqB4wiYEXMP5B1NYQ8UA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "a4Gs3SPfPrx8xeC9Ltj0IQ", "text": "Very pleasant experience. Surprised it wasn't more crowded. Their mini cheeseburgers were simply amazing.", "date": "2015-10-03", "cool": 0, "user_id": "GoV69Se_CTzZbGpx50uFjA", "business_id": "HtIDJhLEUUmIyOGsBEs1Rg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "QrZy9lkQNlr_zn5G1DRBpQ", "text": "If it is Tuesday night and you are in Pittsburgh, be sure to make you way to Harris Grill for Bacon night! That's right, every Tuesday night bacon is served at the bar as soon as happy hour ends. The best part is that it's free! If you can, try to go a little before 6:30pm to enjoy the last of their happy hour specials right before they start serving bacon. They have a nice selection of beer along with an extensive seasonal cocktail list (definitely recommend trying the frozen cosmo!) and a wide variety of wines. I enjoy coming here when the weather is nice and sitting out on their front patio.  I have only been here for happy hour and bacon night and have had the Spinach dip and Buffalo chicken dip. Both are great to snack on while drinking with friends.  Fun place to get together with friends for drinks and a few laughs.", "date": "2014-09-30", "cool": 0, "user_id": "Xc5kDgd59yJ3sxdS4_Ufsg", "business_id": "pHDLRIG2Xu1_1mkGAbyEmw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "5ajuRZr4YJiFxfypUxGV0A", "text": "A great place if you have friends to drink with! Lol. I dropped in solo one evening since it's close to home and only stayed for a few minutes due to the large groups of people that clearly know each other.. I'll most likely stick to pub houses until I'm feeling extra socially extraverted haha", "date": "2017-10-01", "cool": 0, "user_id": "dMa-i4HRsq7IpDYxS_Kmfg", "business_id": "LR1JNvpNrx2N4HNAyhHvrg", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "4QxrU-aDgcwb2qM2ji0_2A", "text": "Meh. There's better BBQ in Charlotte. Wasn't super impressed by the place or the service. Not sure how any place in nc can have bland BBQ but if you're looking for the best in CLT try Midwood. Also heard that their baked beans...the famous ones..are actually from a can. Not impressed.", "date": "2014-04-17", "cool": 1, "user_id": "pgAxExQn93XP8ugy0fgbZg", "business_id": "M10n-ivjDkkdLaxIYNafFQ", "stars": 2}, {"useful": 6, "funny": 0, "review_id": "7ZMS4I5tHAGXi70adimctA", "text": "I am 6'4\" and 250 lbs, but my patio door was getting the best of me. It took both hands to open and my wife really struggled with it.   It was sticking and jerking so much it was cause for a discussion to replace it.  Mr. Verner visited the house and in less than an hour had it opening and closing with one finger.  It is smooth as silk, better than when the house was new!  We saved a bundle and could not be happier.\nThanks SW Patio Door Repair!!", "date": "2010-08-10", "cool": 1, "user_id": "RXTxKm5D2cc1hzcbGLHnYw", "business_id": "ExfzaCio09VjMY97sslegg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "b7sH-_2OZKtJU8HiQSaMAg", "text": "The staff and Dr. Hoban are amazing! They are so patient, kind, and loving to their patients. My daughter is 2 and just had her first visit. She didn't cry at all, and she normally hates anyone looking in her mouth! I highly recommend this practice!", "date": "2016-11-03", "cool": 0, "user_id": "-EdydGwbdaqcDFBpaMNYbQ", "business_id": "JLIBSTHI4bsTqNmzcIWkqA", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "GaN0wVmwsf9oQ4lTe4PQkw", "text": "Nearly 2 weeks ago we had a 2nd technician to come out and fix our Samsung washer for a balance issue.\n\n1st technician said the problem was from the drain hose being too long. Next day- washer was displaying same error code, balance issue.\n\n2nd technician said the washer needed new springs. He replaced it with Samsung springs but then said they are not for this model because they are too short and \"we could use the washer\" and \"it may work.\"  The basket is now rubbing on the washer frame.\n\nThe 2nd technician said he will seek an approval from warranty company and order new springs. That has been 2weeks this Wednesday.\n\nWe have been without a washer for nearly a month.\n\nI have taken over 10 hours off of work for the window the technicians give.\n\nThe first technician arrived at nearly 6pm, second technician arrived approximately 5:15-5:20.\n\nThe window I was provided for both appointments was 1:00-5:00.\n\nThis company was only used through Lowes warranty.", "date": "2016-09-19", "cool": 0, "user_id": "I0kWqLdMMiJRvjTK0pGv2A", "business_id": "eyhW9aHrdzpxhp3rkreX-Q", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "2WFBv_eP_INFoBMf_v09nw", "text": "Food is great, fresh and hot. Could swear you are in San Francisco or Pearl district Portland Oregon Great music and drinks and very clean. Stop wasting money at the waterfront.\n\nRuben sandwich is very good reasonable\n\nSteaks and Brussels sprouts perfect\n\nBeet salad recomended", "date": "2016-09-23", "cool": 0, "user_id": "rHrAukLCE-HhcOr2ab_ruw", "business_id": "pJsJBzOeBIV9pOWMuq-vMw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "bhhI4uaQnoH9-6M2fGhvTQ", "text": "We moved down here from Flagstaff, so the first time I had Pita Jungle was up north. It was great food, but piss poor service up there. Occasionally we'd get sat and then the server or whoever would never show up... ever.\n\nWhen we got down here we found out there was a Pita Jungle down the street and we were a little apprehensive to go there due to a few bad experiences at another location. When we finally went, we had great service, and have returned quite a few times since.\n\nWe try not to come here too often for fear of it getting old. The food is not always great, but still eatable. When it's not great, it's just a little bland (only thing keeping it from being a 5 star). The Chicken Curry Salad is hands down my favorite dish. I'm usually shocked by the portion sizes. I don't think I've ever had a small portion here. The Chicken Curry Salad and the Medchilada are HUGE. And that's not a complaint. They also have, hands down, the BEST hummus.\n\nEvery server we've had here has been on point and speedy. I read a couple of other reviews about this location and I have retort: I don't care what my server is doing elsewhere in the restaurant as long as I get good service. If he/she is serving a table clear on the other side of the restaurant and my service doesn't suffer then I'm a happy camper.\n\nPart of the other reasons we keep returning to this location are the prices. Good size portion dishes are right at $10. Other places with similar dishes would be in the realm of $19-$23.", "date": "2013-04-22", "cool": 0, "user_id": "_uuzD2YiEYGzT6LcOmvtxg", "business_id": "cnfYugAYBFKgwDCTAVdViA", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "lze72yogyV7UpghtDRBP1w", "text": "I have recently moved to Tempe having driven here from the Midwest. Those dang bugs in Texas are huge and nasty.  My car was a hot mess.  I was in terrible need of a wash since the Az sun was baking those suckers right onto my paint job.\n\nI saw this car wash when I was getting groceries. Figured that it really didn't matter how good it was, something had to be done.\n\nI chose a special for $7.99.  First I want to say back home this is the price of a standard wash....so all these extra services were great.   I was given a wet towel for mu dashboard and a little scent wafer.  He gave the front some extra spray on those bugs and thru the wash I went.  \n\nThere was no one to towel dry my car but that is ok it dried pretty quick.  There was free vacuum with the wash which I did not use, but nice in case I needed it.\n\nNow about those bugs...... this wash cleaned aboit 98 percent.  It looks great.   I figured I would need bug cleaner applied first, bit over all a great job and I will go back!", "date": "2014-06-14", "cool": 1, "user_id": "SdJKJlb6W_kMvI_2k3fI_Q", "business_id": "8TBt9XAVZIZR2Y0EqBHskg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "jdYP5EA6TiDkrablPu8gXw", "text": "The high roller ride was so worth the money and was a great experience unfortunately I have to give a 3 star because the bartender in our pod was very grumpy. He looked and acted like he did not want to be there and was not very fun. We tried to engage in small talks, but he reaponded with single word answers. However, once we started tipping, I think his body language and facial expression seemed to have improved. Maybe he's just grumpy that people don't normally tip but it's his job and he shouldn't go in with any less expectations.", "date": "2016-08-13", "cool": 0, "user_id": "HnIlTSjBHESoA4BVxsB_TA", "business_id": "JAmQCmczUclNUfZjkNdjQA", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "jUpjI2cNpyvJ9Vl0M56rZA", "text": "Very disappointing sushi and very expensive. Slow but friendly service. A dark decor. Not a good experience -- we would not return.", "date": "2015-04-20", "cool": 0, "user_id": "F2CXjjUfp-ypnDo6joI4JQ", "business_id": "KuqvrDyfbhsOnv7U-MtQTw", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "3ORuGq1_jU-CR0yXwhXrkA", "text": "I've been going to Tonyc for all my hair needs for 4 years now. Not sure what I would do without Antoinette - so thoughtful and talented! I've referred multiple friends to her and everyone came back with only the best reviews.", "date": "2017-08-28", "cool": 0, "user_id": "atZuly7GgRZD2P0FI29fGQ", "business_id": "Bd0wABcsTNoFPYhD9gOQug", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "wVvyoUfRKjkdvGxUiKuQsQ", "text": "We signed our contract on September 1, 2016 with Mike Dzinglewski, during our meeting he told us that our job would take one week to complete.  4 1/2 months later we are still dealing with issues.  We have leaking pipes/valves, dead plants, plants with root rot, soaking wet walls on the perimeter of our yard.   We have asked Mike to make repairs, he stands us up, says he is coming and then never shows up, days go by without a response, and then has constant excuses on why he didn't show up.  Every single time he has been out to \"fix\" something, another issue arises.  From more water, to additional leaking pipes/valves, to ammeters being installed incorrectly, which meant zero water to our plants, to wires being cut, etc.   We finally had to hire another company to make ONE of the necessary repairs, they showed us that our old system was still in use, rusted wires, no water filter, no pressure reducer, and old valves.  Mike told us that he had replaced all of it to new, not only was he using our old system but other parts were installed improperly.  If you want a job done right with a respectful business owner and don't want to pay twice DONT HIRE THIS COMPANY!!!!!", "date": "2017-01-13", "cool": 0, "user_id": "zVQaWCBjJZTct62lWbmmxw", "business_id": "4a4ZAOwO_DyDo0q7zUINiw", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "ldV2ZeOuUxEV0Yu6Jts3zQ", "text": "Alright, but very expensive for what you get. Pork was way over cooked, almost like rubber but the apps were good. I would go somewhere else and others in the party agreed.", "date": "2014-08-06", "cool": 0, "user_id": "i5YitlHZpf0B3R0s_8NVuw", "business_id": "VUOn9pztnaEX49Xfb_9L7A", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "mK_JJ14QAhiuVDuzALin_g", "text": "HORRIBLE HORRIBLE HORRIBLE. The best three words I could use to explain the service, quality and accountability. Bug guts galore still left on my car and when I confronted the head of the \"finish line\" he wiped it a little and that was it. I could easily wipe the bugs off with a finger, and the cherry air freshener smells like cough syrup. I purchased the supreme wash and the service at the front was impeccable and friendly. Thoroughly disappointed with the quality of the wash and UNWILLINGNESS to fix their mistakes. WILL NOT return here and will be sure to suggest no one else comes. Great atmosphere. Unsatisfied with the finished product.", "date": "2014-12-23", "cool": 0, "user_id": "tjPvjdSGuyEjbDGqY-DDSw", "business_id": "_BinpQSjqtEgycxQxKHIGg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "tDVOOJOCp0PBwOcL975AUw", "text": "I have never had anything I didn't really really love, this is by far my favorite Vietnamese restaurant. It isn't a magic trick, it is good honest food.", "date": "2013-04-22", "cool": 0, "user_id": "Y-usbW6JShKQVSPFSUYAXQ", "business_id": "RYBGhnFtyZGjlREEfcRFrg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "iwZxSLq7-ZyR4IYDrquFbw", "text": "Excellent cheese curds, good menu of burgers and great drink selection.  The service can be good, but the way of ordering at the bar can be a hassle with larger parties and/or kids.  Worth checking out.", "date": "2015-07-19", "cool": 0, "user_id": "BRPgV6kaxYLyqSRYje78aw", "business_id": "RJNAeNA-209sctUO0dmwuA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Onj_9xGLJ2Ddb7N84dnHEQ", "text": "I really wish it was better.  We had the greasiest BBQ we've ever eaten, especially the brisket, which was in an inch of grease.  The sausage was better.  The ribs have some potential but were badly overcooked.  Even the loaded potato with brisket was swimming in grease.  \nThe service was very friendly--I do hope the food can get better.", "date": "2015-12-03", "cool": 0, "user_id": "BRPgV6kaxYLyqSRYje78aw", "business_id": "y2YHddCEO-OLukNppajGIQ", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "i2bdBWGnpJ2PRM4uAX5g9Q", "text": "This is true Neapolitan pizza and it is great. A light coating of tomatoes, buffalo mozzarella, a few leaves of basil and olive oil. If you're into the stuffed crust, all meat, drowned in cheese \"pizza\" you usually get in this country, you will be disappointed. Italians would love this place. They're usually grossed out at our food, with good reason. If you want the real thing and don't want to go to Naples, this place is for you.", "date": "2017-07-28", "cool": 0, "user_id": "QT_i0HOKGCO-OJypQbRucA", "business_id": "ROeCBwuy5lfHUo8v0SMwSg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "dLF9m14UOHkbvmjxqyRlWQ", "text": "Amazing working with this company. Rudy and his wife are the sweetest. Needed my engagement ring resized and not only did they do an amazing job it wasn't to pricey (via my ring is platinum) and they could have had it done the same day. The only reason I didn't go back same day was because I had to go out of town. Super nice, super efficient and a very warm and inviting environment. Thank you kindly", "date": "2016-10-28", "cool": 1, "user_id": "xJU_8kB-QVdK-_BOotvi9Q", "business_id": "LUWMn6XeEDdXNsJaWJSoMw", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "9cqH2O1sbRVDTCS51mb4uw", "text": "I've gotten a few more estimates since I wrote my original review.. I found that Joe Dilorio's repair estimate was three times the price of the other auto body shops.. If you don't believe me= check yourself..", "date": "2015-08-20", "cool": 0, "user_id": "pL9oSNSWZXJZq8dyEyhHbw", "business_id": "7l7wkGDyLqAVChk1Qehhxw", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "weTyqRrJaaZ8TgKmNU_5ag", "text": "Best pho on this side of town.  Not as good as the Spring Mountain location, but a really good substitute when you can't make it across town.  Egg rolls are the bomb, chicken bun is one of my faves, and the #31 is my go to dish!\n\nBiggest drawback is the service is kind of slow.  Food comes out pretty quick but sometimes it can be a wait to get drinks and/or the check.", "date": "2010-10-13", "cool": 0, "user_id": "gOX01Pa2zsTB2Ab5ivg7vw", "business_id": "YavRvjbLsvh4DYDJPAfJIA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "iDZEP8tcuJ8pMNZY-WEaTQ", "text": "I live here in Las Vegas . When I need a gift for my son back in NY  this is where I come. Always leave with more than I anticipated!! \nJulie as always is a big help as is the rest of the staff! Lenny is another great help!! The store is located in the Miracle Mile. Love this store!!", "date": "2017-07-08", "cool": 0, "user_id": "4jTuelFFPk1nVdsTIQvWIg", "business_id": "r6MwVe9ucsHh4ZOUMnl6AQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "0eQ6wyHWEar8pXSVy_X4sg", "text": "This place is awesome!  The rolls are delicious, and the prices are reasonable.  I was in Phoenix for business and needed a place to catch a good quick lunch.  This place was perfect!  Delicious!", "date": "2012-05-20", "cool": 0, "user_id": "hxuFcAsE8VCdQSWiri3Vww", "business_id": "eLTPBSiovhvWPMhnGK1ndQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "ejW8wq2iWDZ-AOK5RT31wQ", "text": "This restaurant is excellent.  The view is outstanding and even the bar area is nice if you just want a few cocktails and bar bites.  They are closed on Saturday and Sunday for private events.  I had the wild boar and my husband had the bison ribeye.  We ordered mushrooms for a side.  For dessert we had the chocolate mousse.  The meals were expertly prepared and the presentation was perfect.  Our waiter was top notch.  Their bread is good and the cornbread is also very tasty.  Cocktails are very good (and unique) as well.  If you have not been to this restaurant put it on your \"must do\" list!", "date": "2015-12-01", "cool": 0, "user_id": "aBXJK7fk2GDhDmgJEKiBeA", "business_id": "JMiaNitMzMbJm6Kh0RbT5A", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "iJwIsWR_h6DzThbjS3nCkA", "text": "The coffee is amazing! It is fresh doesn't have that bitter aftertaste. I will definitely be coming back!", "date": "2015-12-15", "cool": 0, "user_id": "ubvVbuJEQnqgNu2hDLvoLg", "business_id": "yDtVs0NnuYdYwsUHfQWmZw", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "EjB00aBVUSAkMGfFAyIkrw", "text": "Great old fashioned food except for the OWNER'S audacity to request a tip for his service.. Completely taken aback \n\nMakes you NOT want to return and kinda turns you off", "date": "2014-08-17", "cool": 0, "user_id": "zqymKwkO4zi8JudGQqNAJw", "business_id": "LWDWVUJnwSUyDWOmgW1rqQ", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "bAOownN9xWW2NxV0-6wJlw", "text": "We had a 5:30 reservation because we were going to a 7:30 show. We arrived at 5:45 and were told that due to the \"dining experience\"  (2 hours)they would be unable to accommodate us. They directed us to the bar area. The menu was exactly the same; just not in the dining area\nThe \"dining experience\" in the bar was fine but not what we expected when we arrived to enjoy a very expensive meal. \nThe hostess was rude and would not even consider seating us in the main dining area. \nFood was good, except for the \"grilled potato\" side. It looked like something from a fast food restaurant. \nIn the future they might want to inform people about the \"dining experience.\"", "date": "2016-03-30", "cool": 0, "user_id": "MlS3IsG0Gq-v6z-NhGoL8Q", "business_id": "WI1xBMN_rEaVPOL9Ad2gpQ", "stars": 3}, {"useful": 2, "funny": 0, "review_id": "3bRAw7SSS8C1Zim_mLaqkw", "text": "Brian S, the owner, not only did an amazing job at a fantastic price, he is the most ethical businessman I've dealt with here in AZ. I have all travertine floors and Brian and his team filled holes, sealed the edges, and polished my floor so it looks like new. He even recommended a sheen level that would be best with my dog ban unfortunate mistake happened where one of his workers scratched my dining room table. While some tradespeople might ignore it or try to cover it up Brian called me right away, vowed to make it right, and paid for a professional repair at the place of my choosing. Mistakes happen and I was mightily impressed by how he handled it. Combine the great work he did on my floors with that level of honesty and you have a winning combination. I would HIGHLY recommend Sir Grout under Brian S's ownership. He's the real deal!!", "date": "2015-02-10", "cool": 0, "user_id": "awrX5JVVk3bzItjc496nzQ", "business_id": "gV9eJzBzRA2Mx_iTktzmWQ", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "Bum_wRipHbeMFrOV5xQn-g", "text": "Decided to give it a try on the way home tonight. I placed an order online about 3 hours before my pickup time. When I got there, no one acknowledged me, and when they did I waited about 15 minutes for my food. Not sure what the purpose of an online pickup is.. there was also about 5-7 people working in a fairly empty restaurant", "date": "2017-06-02", "cool": 0, "user_id": "qLD1_8Ao3Fhi-FrkWZgBNw", "business_id": "PGr18rKxQ41vLkqL5WT8vw", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "ACAWDut0DgyUURZIDR6SNA", "text": "Seating layout. \nI came here on a Friday evening looking for a place to sit and be productive on the internet. If you are a student in need of a place with seating that isolates you in a corner, you cannot go wrong with this location! If you need a place to meet with a friend for a quick get together, you cannot go wrong with this place either! Need outlets? They've got roughly 10! Free internet? No problem! \nOn the other hand, if you're looking for a place that provides an environment that gets the creative juices flowing, this location probably shouldn't be your first choice (Then again, it's only Starbucks). Personally, this location doesn't harbor any type of inspiration, unless your inspiration stems from listening to baristas talk about their lives.  \n\nThe service is standard: drinks made to order and the baristas have a good level of enthusiasm about making your drink.", "date": "2014-08-30", "cool": 0, "user_id": "SMRxtr1Aztls6wRAW2HtAw", "business_id": "k41bo3i0k-PXQAKvVOLi_g", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "6mR6sWiip8kOzdDdjTB9UQ", "text": "A friend had recommended Jasmine months ago, but I just made it down here. Ful Medamas, a fava bean dish served with pita bread, started me off and all by itself was a delicious and memorable meal. So many different flavors, all of them great. Followed wit tabouleh, lamb and shrimp kebab on yellow rice and a house salad, along with a cold, pink jasmine drink, and I realized I had two problems: I couldn't leave anything behind and there was too much beautiful, delectable food! I had a square of baklava to finish, although I was more than a little concerned that a Mr. Creosote incident might occur. It didn't. I rolled back to my room to sleep it off. Wonderful!", "date": "2017-08-13", "cool": 1, "user_id": "0UefEks7xj1_BZFApx9dhg", "business_id": "22MYhTXwSXaS4rW2VOrR-w", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "D725Ps_HQ-J5Qg8eOKGKNQ", "text": "Not from the Madison area but was recently in town for the Marquette/Madison basketball game (Go Marquette!!!). After a disappointing loss and one too many standard drinks at the bar the night before, I wanted to get back to Milwaukee as quickly as possible the next morning. Much to my chagrin, one of the friends that I stayed with demanded that we get brunch at this fine establishment. I wasn't particularly hungry but ordered the two poached eggs with prosciutto, toast and a Bloody Mary (still trying to drown out the pain of defeat). Absolutely perfect. Food was delicious, portion was just what I was looking for and the plating was adorable!! The Bloody Mary tasted incredibly fresh as well! Needless to say, the meal had awoken my spirits and seemed to say, \"hey there, that marquette loss isn't the end of the world, THINGS ARE GOING TO BE OK.\" Wonderful establishment, pay them a visit as soon as you possibly can.", "date": "2013-12-21", "cool": 0, "user_id": "GUMk-g8AaTd1y7UJ8TDM0g", "business_id": "BuS11AF9XSHEShscxQEzeg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "sizukRfXuxwgK2bEjLtRrw", "text": "Green beans plus garlic....I'm in heaven!! Was kind of expecting those commercial, ya know, TGI Fridays/Applebees/generic American food joints in a neighborhood near you, kind of Fried Green Beans...but OMG, not such thing. Not breaded...more like sautéed.  So good. We are still raving about them a day after. \n\nNow to the pizza. Ordered the margherita, the menu says it was award winning. Hmmmm...after a good dousing of parm it was pretty tasty, but I've had better. \n\nRest of my party had the Mob Boss, had a few nibbles and it was delicious.  Sooooo many toppings, with crunchy red peppers...Yum.", "date": "2015-01-11", "cool": 0, "user_id": "bSSq1dEkDu2cFsIK2IR8EQ", "business_id": "3GEEy7RP6e4bT4LAiWFMFQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "qVkVw7tPqmLXeBlDupmz9A", "text": "Horrible, food was bad, we sat at the bar, the people next to us left about 3 minutes after we sat down. The bartender never cleaned the glasses, or dirty dishes the hour we were sitting there - there were several other spots around the bar in the same sad shape. Saw several people come in and then leave since there was not a clean place to sit.\n\nShe was busy drinking shots with some friends - it was only 1pm in the afternoon on a Saturday, guess she was thinking it was the end of her shift. I am all for having fun, but not at the expense of customers. \n\nFood - don't even bother. much better places for the same amount of $$ to put out and get some quality food.\n\nPlace looked great when observing from the outside, but the service, food and overall experience was totally a waste of our time and money.\n\nTheir only saving grace is the location or they would be out of business. please eat somewhere else.\n\nTried to find a manager to talk to - but no one around, must be why the bartender was drinking and the food servers had to get their own drinks for the customers.\n\nFoodservice is my business - I wouldn't waste my time calling on a place that does not take care of its customers...they will be out of business before long.", "date": "2010-02-01", "cool": 0, "user_id": "aOHAjmACFEMfEVLSyFC2ZQ", "business_id": "Trbt0Ex85yvwT8DHoEFCvg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "1_bTVrtA8yC20hucgprOBg", "text": "Great middle eastern food in a nice atmosphere.  Warm and friendly staff.  Tried the kebab sandwich with lentil soup. Loved both. The tahina and date dessert was also delicious.  Surprisingly good bar for middle eastern place.\n\nI'd go back if I were local.", "date": "2016-04-15", "cool": 0, "user_id": "-onlmoPVXvk_N2VcgwyK6A", "business_id": "v91eTDokcNCHzRvmamWVog", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "HjsV73JD8lxstS-_SDlXug", "text": "Pathetic service. This place is the worst run restaurant  I have ever been to. 20 minutes to get thru the drive thru smd then they got my order wrong. Avoid this place at all costs.", "date": "2014-08-30", "cool": 0, "user_id": "zbQBGxwmZsBdZg9g9AU-0Q", "business_id": "gnfRPDNr9aRaEMDh1zAl_w", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "S96KbDgaP1SpuPivcG1ILQ", "text": "New to Vegas, I picked this place solely because it was close and convenient. What a great surprise! We just got pizza to go but it was some of the best I've had; hot, fresh ingredients and perfect thin crust. Will definitely be eating here again!", "date": "2014-07-19", "cool": 0, "user_id": "7OHfDciIE1mFz8JZ-iFcbw", "business_id": "N6MzDoao6s68nAIW8vS9dQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "uX7M4RKMkUD-M-4w79t47g", "text": "The locksmith came to my house and re-keyed my lock he was quick and professional he did a great job and gave me two new keys for the new lock!!\nI appreciate the work this company did for me, they are very reliable!!\nWill use them again.", "date": "2016-10-14", "cool": 0, "user_id": "hCEc7Tf3g_YMy9pnBEyiWA", "business_id": "QcnWLxl2VPJRNpaMXovKAQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "kMZMiHUjF-ZJ8yohRH4f4Q", "text": "Stopped by based on the yelp reviews. Amazing customer service. The owner personally greeted us and helped with the lunch selection. I had the Cubano which was exactly what I was looking for even if I didn't know it at the time lol. There were quite a few customers, and the staff cranked out all of the orders including to-go orders. The wait wasn't very long at all. Great grilled sandwich that's reasonably priced. I'll be back!", "date": "2016-07-12", "cool": 0, "user_id": "bnLw-jMIuUsWBJ6rilrvzg", "business_id": "_MI20v3QRDrCVXgpzje-Ag", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "_lGhYVzvJZy4k9vPxNiPSw", "text": "Great place. Best indoor playset.", "date": "2012-05-14", "cool": 0, "user_id": "Z8mWNrx1z6jg2PTexhe9-Q", "business_id": "HMaxzaWhRg4d9g4e_gDtFg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "yPpUiv_Tlx0z6BJzXyZkkQ", "text": "Had the lunch buffet for 14.95. All the basics included. As good as any Indian buffet I've had, and I like to think I've sampled some good ones. Certainly won't find a better deal on the strip for this quality.", "date": "2012-10-21", "cool": 0, "user_id": "AO_kmYetRR_3b20NwVIqyQ", "business_id": "ohz8ljVxcZMo2bMGrBZfgw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "R8HjvRiKXN4hG5CTxEUYSw", "text": "I loved the atmosphere I loved the service...  I did not love the food I did not love the price... im not a cheap guy i believe you get what you pay for... maybe i just went at a bad night", "date": "2013-05-08", "cool": 0, "user_id": "D3wugDn6QnoKpKAndYKg7w", "business_id": "aKEEQqL1UFMieilnylI1gw", "stars": 3}, {"useful": 3, "funny": 0, "review_id": "mM6tJl4G9w9RP5i-z3mtNA", "text": "We recently moved to the area and were looking for a new salon for my children.\n\nUpon entering the salon we were greeted by a female employee and told it would be a few minute wait. No big.  \n\nThe look of the salon was less than stellar. It is very outdated and hair was absolutely everywhere. It looks like they hadn't  cleaned the place in weeks.  Really gross.\n\nAfter a few minute wait, a male employee told us he was ready for us.  I would guess his name is Joshua based on the name on my receipt. He was very standoffish and acted like he had a chip on his shoulder. He did not attempt to interact with my son.... Not even once!  He looked very unkept with a shaggy beard and chipping painted black nails. But that's not even my biggest complaint. Although I think it's important to have a kept up appearance if you work at a salon ...I really don't care if you do your job right. Unfortunately, this was not the case as his appearance matched his skill. He was a  very poor stylist with obviously little education/knowledge.  He did not know how to even do a basic kids haircut.  We wanted a simple fade.  No joke, it took Joshua 30 minutes to try to do a simple fade on a seven-year-old.  A kind woman he was working with had to come over and help him multiple times. He kept looking back at her for help to because he obviously didn't know what he was doing.  All the while, my son was sitting so patiently, wondering when he was going to be done.  Very disappointed. If the stylist does not know how to do a boy child haircut he should not have taken my son on. \n \nI was even more disappointed upon arriving home and seeing that he didn't at all cut the top. It was completely uneven. I literally had to just buzz it myself when we got home.  Talk about a waste of time and money!  I wish I would've checked his hair before we left the salon but honestly I was too shocked and upset about the poor service  and just wanted to get the heck out of there. \n\n \nWe have had much better experiences at other best cuts in the past. We will not be returning to this one.", "date": "2015-06-15", "cool": 0, "user_id": "NBATkvXttpL2n3fx4-rkjg", "business_id": "sJ8utPo2os3_Qll0act0IA", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "pkcsZVl2hQlQFERuUk1xrQ", "text": "This is on the top of one of my all time favorite golf courses in America.  I played both the Monument and Pinnacle Course.  Conditions, top notch.  Excellent service and staff.  Surprisingly they space out the tee time pretty well, didn't see many other golfers at the time I played.  Maybe it's the desert, Cactus, and large boulders, I feel so peaceful and relax.  Maybe I like it because that is where I got my first Eagle.  The Monument course has a short par 4, hole #6.  Drove it on the green and made a short 6 footer for an eagle.  Balls flies far in Arizona, you can add 20% further distance than my yardages in the Northwest.  This is a must go place if you go to Scottsdale.  Much better than the PGA Scottsdale.", "date": "2015-04-02", "cool": 0, "user_id": "vSvDwAnOD9G_HCrusAxOQg", "business_id": "CKIGXGlSweovWDljQyhSHA", "stars": 5}, {"useful": 4, "funny": 0, "review_id": "f7xnTFXBTiWd80TYHs-3rA", "text": "Dilworth Animal Hospital is the best vet clinic I have ever been to, and with over 30 pets throughout my life, I have been to a lot. They have always been able to fit me in for semi-emergencies right away, even before we were clients there. The staff really care about animals, and always ask how my other pets are doing by name. Dr. Wheelock has even called us after a visit to make sure my pets are doing well. I recommend Dilworth Animal Hospital to every single pet owner. If I could give more than 5 stars, I would!", "date": "2012-06-26", "cool": 0, "user_id": "Ey077L-fvsq2vWymzMQhPg", "business_id": "VGMSXomG3dibOS7xjplX5A", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "1EMV2R5pDH1ibIKkqKp6fw", "text": "I didn't want to stop here because of the ratings but was outvoted by my friends.  Clean, nice atmosphere and fast service.  The Dosa is amazing ++.  Chicken Tika Masala and the Buttered Chicken were also delicious. We had a veggie dish with cauliflower and potatoes~great too.\nThis is an undiscovered hidden gem.  Loved it.", "date": "2017-04-28", "cool": 0, "user_id": "Eo2CSgKfHbXIa0HfuCnoaQ", "business_id": "TAnzFr9NixvCbvUdJMWL5Q", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "7WpK8RskvF0fNAbonetxYA", "text": "Manny is the greatest.  So accommodating and we appreciate his attentiveness.   Lynn and Dick Parker.", "date": "2017-04-16", "cool": 0, "user_id": "Y6fWB3M4zZby_Y8XtIC8LQ", "business_id": "h3pMMRwqBjMeMtk0_qQzRQ", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "nMJ2kjNSvo69t79YBbm8-w", "text": "Price Gouging!  We own a Mobile Home Park and had an emergency.  We were charged $755.00 for 45 minutes and approximately $40 in parts.\n\nDo not use this Company. They say they 'quote by the job' and seem to charge whatever they think the customer will pay.\n\nNever again!", "date": "2015-05-14", "cool": 0, "user_id": "Wovop91Qy6So25pozbQx2Q", "business_id": "btQBI4ToTJM4Kts6_b0AiQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "09oGlkZ0is4bLCbcNw1czQ", "text": "I wasn't in the market for new insurance but after Jeremy explained my options with State Farm. His spirit of teaching I received great answers and made me feel confident in my decision. I have peace of mind thanks to Jeremy mueller with State Farm", "date": "2016-10-03", "cool": 0, "user_id": "eN5ldESzO_AR-9hcWX_NtQ", "business_id": "-4G-LJhOeTbAfQuaxCYeHA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "he6BaBsedwNNgdiUNWFH9Q", "text": "3 of us came here on a Friday night.  It was difficult to find a parking spot and didn't realize the restaurant was on the second floor.  We got drinks and there's plenty of alcohol.  Didn't care for the lemon one, it was way too tart, but our server offered to replace it.  The biscuits are really excellent. The fried chicken was absolutely AMAZING and the gravy that came with it was awesome !  I got the NC trout, which was good but I didn't care for the dry breadcrumbs in the middle.  One person got the blackened catfish which was probably the healthiest option, but nothing special.  The brussel sprouts were fabulous.  Didn't care for the potato cracklings. We got the Smores chocolate lava cake for dessert.  It was really good but would have been better with white chocolate sauce instead of chocolate on chocolate.  For Xmas, peppermint in the white chocolate would be really good !  We'll definately be back.", "date": "2017-11-13", "cool": 0, "user_id": "gERe-EPQPDsEkWu2fKeRYA", "business_id": "WbJ1LRQdOuYYlRLyTkuuxw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "1-lchJHB9gPXSeamV_g8tg", "text": "Fast becoming one of our favorite restaurants excellent food excellent value and the service terrific! Today's sushi selections were extremely oyshi", "date": "2015-06-15", "cool": 0, "user_id": "lMctqDDwnK8n0NPmlGUfxw", "business_id": "-ITj6Pu8Gdw8MmLf0XBEKQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "7V1PliAoHIOI6srGlPv2vw", "text": "Took a long time to be paired with an instructor, probably because of my son being Autistic and needing to find the right fit. We were a bit sad to start lessons so late in the summer but we absolutely love our instructor Artjom. He is very sweet with my son and is an excellent teacher. Sunsational has been good about following up on their process in getting us paired with an instructor and now in seeing how our experience is going. I'd recommend this place, just make sure you reach out well before summer to get placed in time during the highest demand time.", "date": "2017-08-09", "cool": 0, "user_id": "v7MllLn_9SLWI0pTRJ2JNA", "business_id": "_5WBxyToueeux24mj9TbpA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "inQsa-gyYAm3P0cv5_Ewqg", "text": "I am shocked at the previous negative  reviews.  I come to this restaurant often and I've always had a good meal, and some of the best service ever.  I would like to give special recognition to servers Kevin and Abby.  Both have spectacular personalities and are a joy to be around.  \nHighlights of the restaurant are cleanliness,  CONSISTENCY (very important), and above all they offer healthy small portion meals. My boyfriend loves the shrimp meal and I like the chicken.  I miss the pork chop meal that was discontinued! .  Hopefully they'll bring it back. There is nothing generic from their salad dressing to even their barbecue sauce. There's after 8 o'clock specials of $4 appetizers, $2 slice pie and discount milkshakes.  You also get 10% off if you are a Lakeland or Lake Erie College student.\nI love this restaurant and because it's healthy and cheap I could eat here every day.  I'm not sure why the (2) $$ because 2 people could easily eat for under $20!!", "date": "2017-02-24", "cool": 0, "user_id": "EScSt-0mJlAEt9EOhpLzoQ", "business_id": "HhOyjFxAIVugKJOhUK1QxA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "YHa2HSZp6XGrUmXiNAuuCQ", "text": "Overpriced and over salted pasta. Don't expect any bread unless you want to pay an extra $.6.50, no salad. Anything added to the pasta will cost an extra $4 to $6 on to of the $11 dish . Service good but our first and last trip", "date": "2014-02-14", "cool": 0, "user_id": "8YtP15XtW1jpYWEzQHno-g", "business_id": "m6rffQy85HUq82DjLq-YJg", "stars": 1}, {"useful": 3, "funny": 0, "review_id": "ewuuTvgMk_uNtMiNh92cvw", "text": "Just completed moving my parents and assisting them in downsizing to the Destinations Pueblo community.  I feel relaxed knowing that they are surrounded by plenty of  activities, beautiful grounds and that maintenance is just a phone call away.  \n\nFrom the start, Romeo was a true champion in helping us find the right unit and helped complete the process from start to finish with a \"smile\". Romeo truly shows compassion for the residents and the community.  Renee the activities director is always so friendly and inviting mom and dad to participate in events.\n\nThank you , Destinations Pueblo!  I know my parents are thrilled  and will have a long term stay at your property.", "date": "2017-05-21", "cool": 1, "user_id": "w4SSyHI0vNnv8wKEtRv9EQ", "business_id": "LUYB4fYZt5ZaitU4hXBDKg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "NtGSFFDPUwhc0f3vOqLg4g", "text": "The new Piccadilly liquid nitrogen ice cream is absolutely a must try. If at first it's a little confusing because you don't find your typical flavors on the menu and it takes about 2 minutes for them to MAKE the ice cream before your eyes, once you taste it that confusion goes away. This is simply your dream ice cream. A wonderful combination of flavors and fresh fruits that's unique to any ice cream shop I've try so far. It will blow your mind! This place is a hit and a great addition to the university circle area.", "date": "2014-05-30", "cool": 0, "user_id": "szHQY3KaADgswK_t_hOomQ", "business_id": "q4KI2aUkrCnje3jqKBMULg", "stars": 5}, {"useful": 4, "funny": 0, "review_id": "q-H7um0FK2k-n26ZoXR87A", "text": "I had an excellent experience! The assistant Melissa and the manager Lauren were both so helpful. Melissa made the experience so easy and stress free when helping me find my wedding dress. I couldn't have asked for better assistance.", "date": "2014-10-26", "cool": 0, "user_id": "4C4fT__1awmOo83xX9Zbvw", "business_id": "XJPPcsVJXAvc21FUeySC2w", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "28DFyXwCMKgKjPmDD5dW7w", "text": "There is a lot of hype about this place! It was pretty good but I'm from Cali so I compared it to Chik-Fil-A which I personally like better. I got the Caniac Combo! Overall, it was good. They're also known for their sauce which I wasn't a huge fan of but everyone seems to love it. Give it a try!", "date": "2014-01-08", "cool": 0, "user_id": "pMnKZ9DkgIBccHVsraWAlA", "business_id": "m2QQNcBKeZIFYy16lVMogw", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "tA7PyvpjHPWaHyiUymvNAQ", "text": "Im an average height guy 6', and I get into a comfortable position in seat g13 and there's a stupid piece of glass blocking half of the screen. The glass has no purpose except to block the screen. Remove it or I would never come back here again", "date": "2014-11-02", "cool": 0, "user_id": "EI8ZRkf46kd5TvzLuX9-NA", "business_id": "FJ4SYm6u4GbhkkXXnjYPcg", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "FWsAWKLho6Zcbg9ECPGSBw", "text": "Amazing service! Checked in on a Friday night and the place was packed. Service at the bar is in credible. I have several food allergies and our bartender was very knowledgeable. I ordered the Beef. It came with greens, a corn purée with goat cheese. The beef was perfectly cooked. My friend and I ended the night with not one, but three desserts! We tried the Smoked Chocolate, Sourdough Pound cake, and Pavlova. While they were all amazing I recommend the Sourdough Pound cake.", "date": "2017-09-17", "cool": 0, "user_id": "bSuEbLHJiJ8OCbkHTuPLBA", "business_id": "G2hXfdIKdhI6TVQrXpTnFA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "fPdEA9GNPfEc_lkgfBesuw", "text": "The office staff at Back in Line Spine & Wellness Center are some of the most kind and genuine staff people I have ever had to interact with. I've visited the offices twice for appointments that were about an hour long each with my 13mo. old daughter and each time, the girls in the front kept her entertained with no problem while I was away. Heather was especially helpful. \n\nDr. Covac is as pleasant and approachable as his staff. He doesn't rush his appointments and he took a great amount of time listening and answering all of the questions I had. He was able to lay out a comprehensive care plan for me and didn't sell me on any particular treatments. He gave me the facts straight and left me to be an informed consumer. I would recommend the Back in Line Spine and Wellness Center because they offer a holistic approach to health which is refreshing!", "date": "2017-09-29", "cool": 1, "user_id": "V2zebyVBBh6yGsMqYHiejQ", "business_id": "JBXUkuS44NR7psieWOo9vQ", "stars": 4}, {"useful": 3, "funny": 1, "review_id": "a7pQIOx8dXKBwRivNGvlCQ", "text": "How appropriate that the half-brilliant food at Picasso should so closely resemble the minor-league paintings, courtesy of the restaurant's namesake, that grace the walls of this mostly adequate fine-dining establishment located \"lakeside\" at the Bellagio Hotel.\n\nYou might think that I'd have felt cheated having been presented with such inauspicious works from an artist who's membership in \"The Pantheon\" is so rightfully secure.  You would be wrong, however, to make that assertion.  In my mind, even the least-interesting Picasso still veritably hums with the genius that has conferred upon him the status as a near-consensus choice as the single most important artist of the modern era.\n\nAnd just as one must, in the course of appreciating the art, ignore the piggish chauvinism that the artist himself exhibited during his reign... one must likewise ignore the missteps that mar the canvas of Chef Julian Serrano's menu if one is to be receptive to the more vivid charms that are in evidence.\n\nThe space itself is quite lovely.  Rich and sumptuous, with dim lighting that is punctuated by spotlights shining down on both the tables and the million-dollar canvasses that line 3 of the surrounding walls.  The fourth wall opens up onto the aforementioned \"lake\" and its ever-present circus of projectile choreography.  As cheap a thrill as it is, I must confess an abiding fondness for this brand of contemporary Vegas kitsch.  You would do well to note that the fountains are freakin' LOUD, though... and if you are the skittish type you might ask for a table a little farther away from the sideshow.\n\nOur meal commenced with an amuse of boiled quail egg and smoked salmon on a skewer served with a small cup of leek and potato soup garnished with slivered almonds.  The skewer was rich and silky, with the appropriate notes of salt and smoke, and the soup was earthy and luscious, the almonds providing good textural contrast.\n\nMy first course was a bowl of butternut squash soup, (a holdover from the fall/winter menu perhaps?)  Regardless, it was cloying and unremarkable.  It was helped, slightly, by the addition of some tasty bread and butter but on the whole it left me with that arched-eyebrow \"Oh Lord, here-we-go\" look of disappointment that I sometimes get.  Yes, sometimes.  REALLY, it's only SOMETIMES!!  Stop hitting me in the shoulder, dammit!\n\nSecond course found me sizing up a dish of langoustine tails with asparagus in a saffron broth.  Sounds delicious, right?  Well in this case everything clicked and I'm happy to report that delicious is exactly what it was.  A brilliant little piece of chamber music on a plate.  A richly satisfying meditation of harmony and balance and if I weren't such a neurotic snob I would have licked my plate clean.  In my shame I must confess that the best I could do was to sop up the remaining broth with more of that tasty bread.\n\nFor the main course I selected the veal chop and for the most part was happy I did.  The chop itself was delicate and toothsome.  My only complaint is that the pan jus upon which it rested was lifeless and ordinary.  Pan jus is one of those things that, when done properly, can elevate a simple dish toward unexpected heights.  Such an elixir should be part of every great chef's arsenal but on the night in question it's addition did little more than color the plate.  Pity.\n\nMy friends and I decided to supplement our menu with a plate of the night's special meat, an offering of Kobe beef, which we felt necessary to compliment the fine bordeaux and Rioja we had assembled.  When it was presented to the table, however, it was distressingly overdone.  Not even borderline, mind you, but just short of grey-all-the-way-through.  How it even made it out of the kitchen is a puzzle I am sure I will never decode.  To their faint credit, the offending dish was whisked away and replaced with a suitably-cooked replacement.  That said, the beef was only great, falling well short of the magnificence that it should have shown.  What a disappointing, yet somehow fitting metaphor for the overall experience.\n\nOne aspect I feel compelled to note is the incredibly gracious treatment shown to us by the Head Sommelier, Robert.  We brought our own wines and he really went the extra mile in creating a superb experience.  If only the restaurant as a whole had manifest such careful attentions I imagine I would have expected nothing less than the Young Ladies of Avignon to grace the walls.  As it was, the wine service was enough to catapult Picasso in my esteem to 4-star status.  And if you hit it really big at the tables, ask Robert to open one of the 1947 Cheval Blancs he has in the cellar.  Just be sure to let me know what time the reservation is.", "date": "2008-03-14", "cool": 4, "user_id": "yDbtyjFQKhqLhCFjfqQ08A", "business_id": "0q_BHpxbikVtPRRLRu-U0g", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "b8p88N08kn80EhQdsUGMCQ", "text": "Made very sloppy  wish I can give this place a big fat ZERO. Just meat and processed nacho cheese. Really?????   Soggy bread no lettuce no tomatoes  I ask can they cut it in half cashier said sure. But the lady who have me my sandwich  I asked her did u cut it in half? She said I forgot but there are some knives over there", "date": "2015-07-08", "cool": 0, "user_id": "2DmsHxO0zDpjvWVm6tZBcg", "business_id": "uCh2KhP-f9LFS6yp8UgN_g", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "SyZio2u8KOqY5wgUHeBFsw", "text": "I've been coming here for 10 years, and have never been disappointed. The pizza and wings here are great, and the staff are very friendly.", "date": "2013-11-05", "cool": 1, "user_id": "59nHM-sdejFUvJSRQ0rhCw", "business_id": "VFrSIKxEQvgNowJ0PJxUzA", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "wMsfma2Ti6GrkyjENkeHPg", "text": "Great \"Indie\" feeling Falafel house! We had the F-Bomb (in Pita form) and the Big Green Salad (classic, w/ 3 falafels) and they were both FANTASTIC, even a little too big on the portion side! The music, seating, ambiance, and most importantly, the FOOD were spot on for a great dining experience and delicious falafels!\n\nPros:\n+Great flavor, freshness, and quality to the food. The falafels are really top notch. Some of the best I've had in 4 continents, and truly, they are what they're made out to be-TASTY!\n+Really chill music playlist that helped add to the ambiance and environment\n+Nice decorations downstairs, with oriental rugs and paintings.\n+Chalk hand-written menu on an ordering wall is always fun.\n\nCons:\n\n-It can get quite loud inside, in the downstairs area even with minimal customers (due to poor acoustics?).\n\n-Free water dispensers aren't filled with ice and aren't very chilled\n\n-The Tahini sauce is not particularly flavorful, but the chili sauce you can serve yourself definitely helps bring out its flavor if you mix the two!\n\nOVERALL:\n\nYou can't go wrong going here...I hesitate to recommend it completely just so it doesn't get too busy and inaccessible (for me), but really, it's pretty great and the negatives are really minor things that may not bug you, so give it a try!", "date": "2013-10-05", "cool": 1, "user_id": "wjxbu8UBQmr-CGSgOPYGIQ", "business_id": "t67GMPZ0cv_ItKlID-JFiQ", "stars": 4}, {"useful": 3, "funny": 0, "review_id": "9hamkP-WOUAknvT-eWSZeg", "text": "I went here for a physical! The young man at the desk needs a personality. He doesn't even look at the patients when speaking to them. I finally got him to laugh a little! \nAs for Dr. Benton, he is a good old school Doctor and very nice, but seem to be rushed. It seems he has to do some of the computer input that the staff should be doing. Maybe that is why he was 45 min. late for my appointment!\n I couldn't get my bloodwork done, because when I made the appointment they didn't tell me they did the blood draw in the office and I should fast! It is an inconvenience for patients to have to return for a blood draw just because someone doesn't tell them to fast! \nThe office manager lady was extremely rude to me when I mentioned that they should have their schedulers tell patients to fast if they are coming in for a physical! She never apologized for the error, but said twice I was done and could leave!", "date": "2015-10-13", "cool": 0, "user_id": "IONXYuvNTnZNn6cth1qz0Q", "business_id": "lir3-VtoYAy-E0LB-9XBIQ", "stars": 2}, {"useful": 0, "funny": 1, "review_id": "i_8A64yYCD04OZTIBmlq2Q", "text": "THAT WAS A GOOD FOOD DAD!!!\nYells my 4 year old boy\n\nLittle dude ate a grip\nRight after he finished his food\nFunniest shit ever\nHe yells out\nMOM I GOTTA POO!!!\nHa\nCrazy fucker\n\nI crave this spot every time I'm in Vegas \nAlways get the spam and eggs\nAnd a small saimin\nThat's alot of food\nBut I always manage to get it all down\nEven if my boy is yellin bout takin a shit\n\nFood is great\nBut his mom lost her appetite \nShe had to wipe his ass", "date": "2011-10-24", "cool": 0, "user_id": "31E2n1757FiXibsfoM-8bg", "business_id": "wpnLPAnkMEb1NpC3xiD_qg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "eehMhwS0elxDEeQewimmqA", "text": "This place is awesome. It's quick but there's no machines to damage your car. 8 bucks for a wash with wax. They hand wash and dry your car, then you can use their vacuums.", "date": "2013-11-15", "cool": 1, "user_id": "0CShii4C7Foiid1lzAnA2Q", "business_id": "bJnikvRTWIoGp23TfQ0BTw", "stars": 5}, {"useful": 2, "funny": 1, "review_id": "QWbi2ZK7gLhGoLBndaLEfw", "text": "Lai Toh Heen is located at the site of the former Oliver & Bonacini restaurant Square on Mount Pleasant Avenue.\n\nAnd a pleasant restaurant indeed. The sister restaurant to Lai Wah Heen at The Metropolitan Hotel downtown, Lai Toh Heen serves similar fare at slightly cheaper prices.\n\nThe menu changes frequently depending on the season and specials are introduced frequently although the appearance of the same \"specials\" numerous times means they should just be added to the regular menu. There are no push carts here, items are selected from a menu and marked on a separate sheet.\n\nThe requisite har gow and siew mai are tender dumplings without leaving behind the greasy feeling. The bbq pork buns were nothing to write home about, but the bbq pork and pineapple pastries were delightfully filled with sweet meat and chunks of pineapple. Other highlights include the shrimp spring rolls - tall spring rolls filled with the star ingredient served with a side of sweet + sour sauce and sticky rice with chicken and mushroom - tender chunks of chicken enveloped in sticky rice (the only downside being there was only one mushroom per package) was kindly unwrapped from its banana leaf package before serving. \n\nDesserts run a gamut of the traditional Chinese desserts to cakes from Senses bakery. The traditional Chinese desserts are done with a twist. The obligatory egg tart is actually an egg white milk tart with a flaky pastry while the sesame balls filled with lotus paste were flavoured with a pleasant hint of ginger. With these selections, if I wanted Senses dessert, I would have gone to Senses.\n\nThe service is solicitous without being snobby. The lack of lines, even on a Saturday afternoon and the absence of the normal loud Chinese dim sum atmosphere will keep me coming back even though prices are at a slight premium.", "date": "2009-12-14", "cool": 2, "user_id": "XDlUWfqPsRi0PB3RSeXTnQ", "business_id": "JwtQWW1C_y6GhLQzNghrOw", "stars": 4}, {"useful": 2, "funny": 1, "review_id": "D9PahAV0_GqJ9uJvfhEqFQ", "text": "These tacos are the real deal - full of flavour, and huge! Very inexpensive, but not short on quality. I got two - one would have been enough, but I had to finish them... I took mine to go, and they got a bit soggy, would definitely eat there next time. Best I've had in town so far.", "date": "2015-10-31", "cool": 1, "user_id": "IWReVzg469ugQOzFE6nh0A", "business_id": "r76Jr-MchYOobglY6TguzQ", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "JI0lY-vw__PNASUJ7rx39w", "text": "Blossom has been the best to work with. Their office is so efficient and their staff are caring and knowledgeable. Dr. Apel took the time to answer all my questions, walked through the procedure with me and was straight forward.  I had a hernia repair on top of the sleeve and have had excellent care.  I would highly recommend blossom to anyone considering weight loss surgery.", "date": "2017-05-01", "cool": 0, "user_id": "APv69cE4WFcULbG6Y6D8qw", "business_id": "g7i_j8wXsD0XKsNA60eu_Q", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "AHoQM8q-MkMc0QHK1-ibIQ", "text": "Excellent location for dinner with friends in the south hills!  All of the seafood options were delicious, including the crab cake sandwhich and the shrimp po' boy.  \n\nThe happy hour specials were very reasonable as well, with a large drink and appetizer selection.   They offer a small plate bar with a selection of small dishes such as oysters, shrimp cocktail, and much more.  They also have multiple outdoor bars and is a great location I have dinner and drinks with friends during the warmer months.\n\nWorthwhile to check out with a group of friends!", "date": "2015-09-05", "cool": 0, "user_id": "FeXJpc4HqilnR8x7PgjnCA", "business_id": "w1c_Uy60LSDiMsSjAsEqkw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "G9nRShJ5biW706cP-X_pFQ", "text": "Pro tip is order a cone but get a cup on the side to house the leftovers or your spillage. The portions are probably enough for two or one committed sugar addict. I'm not a super fan of soft serve ice cream but they do trick it out.", "date": "2016-06-13", "cool": 0, "user_id": "3cJEotZ_wbpQv3p0FMGRZw", "business_id": "N_2yEZ41g9zDW_gWArFiHw", "stars": 3}, {"useful": 1, "funny": 0, "review_id": "lOmW34Vt2qBS5T5v7Em_Wg", "text": "When I moved to Vegas I was hesitant to find a new tanning salon. I tried at least three different places before I found palm beach tan. I LOVE this place!! They have, by far, the best equipment of any salon I've been too. Not to mention the cleanliness. I swear something is always being cleaned while I'm there. \n\nThe staff is out of this world. They make you feel so comfortable and get to know you personally. I had only been in a couple times by the time all the staff knew my name to check me in. I thought that was awesome!! Special thanks to the manager Avy, her customer service is outstanding and always in a great mood. \n\nBottom line, don't tan anywhere else!!", "date": "2017-09-01", "cool": 0, "user_id": "3-eBTxy7oPdFn-P1XDfN0g", "business_id": "q-gV8dS5DV0UEEt2owvHOw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "FD29GC2EBhQgGPCrFaTR5Q", "text": "My parents decided to move after youngest sister moved out, but their 'empty nest' was not so empty-it had twenty years of stuff that a large family accumulates. This job just felt impossible to us. Scott showed up with a crew of five and had the entire house moved in six hours to my parent's new condo, and everything was placed thoughtfully for unpacking, with the larger pieces set up for them. Words cannot describe how comfortable they made my family during the moving process which is usually a very stressful time in life. Scott's rates are excellent-competitive, and SO worth it. The crew was just incredible.... on time, SUPER efficient and extremely careful with their time, coming in under their estimate, but we compensated them anyway, and then some! Everything that gives you pause about hiring movers is not true with these guys-they totally break the mold with an extremely professional crew and a very nice, communicative, and thorough booking system. Hire these guys, and your move will be a breeze! We love you guys!", "date": "2016-10-20", "cool": 0, "user_id": "O2C8WiFxDdH5d4zl5C6BSg", "business_id": "Q5S7dP2Ui1Ikq6e8tP2IxQ", "stars": 5}, {"useful": 4, "funny": 2, "review_id": "XzmS60pJvIbbDbWuFZQGGg", "text": "Hiring bullies is a confirmed practice now.  I took my almost 3yo son for his first skate here over the 2014 Labor Day weekend.  I have no issue with the progress of the renovation and can overlook the lackluster service at the administration and skate rental counter.  I don't expect much.  But when my son wanted to rest on his first round, I stowed away in one of the benches opposite of the rink entrance.  I was notified by one of the young monitors that I could not stay on the bench.  I explained my son was just resting and we would move along soon.  He insisted that I vacate immediately staring me down and actually clinching his jaw.  Asking for further clarification from the operations manager, 'Phil' explained they had been hit with a lawsuit because some kid closed the door on their own hand last year.  He further clarified that safety was his primary concern.  I get it...I also pointed out I am a bigger safety problem by kneeling to stop in the middle of the ice with my son.  For those of you with children, you understand a legitimate call for a break is not negotiable...especially as I try to create a good first experience for him.  I explained this to Phil, adding that the safest thing to do was to take everyone off the ice...it has to be balanced with the experience designing it to have customers coming back.  I won't be back...not as long as they are hiring juvenile bullies as their employees.  If safety were really a concern, how much first aid training did these guys receive?", "date": "2014-09-01", "cool": 1, "user_id": "gEBM95Wg_YdWzbT0nm8UFA", "business_id": "aIVEJwP379EA0YOzUoNlnQ", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "EC-lSiXjWZKZg2qTAQHZ1w", "text": "Ubaldo Mora is a magician. We went non-traditional with a chocolate mocha cake. It could not have been more moist and more beautiful. He knew exactly what our vision was for our cake, executed it perfectly, was very pleasant to work with, and ultra professional.", "date": "2010-09-11", "cool": 0, "user_id": "xm9v2NJ6rjI915t7aMiVBw", "business_id": "M-caugKzJ9qLOmCBfD9Nyg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "CqVplKu4S31im9QNcs4EQw", "text": "Pretty good Mexican sit down restaurant. More on the Americanized side but still flavorful and tasty. I like that authentic Mexican food better though.", "date": "2013-05-08", "cool": 0, "user_id": "-7UsexHfgvTGoIkjDqySGA", "business_id": "0fyxLMASE5bfYAgW6MYM_g", "stars": 3}, {"useful": 1, "funny": 0, "review_id": "g6KQOnVH7zjNyWQrInQp1w", "text": "I have used these folks for church events over the past 6 months and they have been exceptionally professional and accomodating.   We have mainly had a need to order tables (round) and chairs.   They deliver and pick-up when they say they are going to. They issue invoices/receipts. We keep them as a referral in our directory for weddings as well. Our overall experience with them has been great.  In the future I will use them for personal events.", "date": "2015-03-20", "cool": 0, "user_id": "6-knygZ7x7x2LJ39w3xifw", "business_id": "xPFxojD83U2_17wHd8aCKA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "nbG6eERpeF4bD0O7639rGQ", "text": "La Casa Blanca is a consistently good mexican food experience.  It is very rare that I walk out only thinking of how full I am and less about the lack of service and/or food quality.   Clearly the customer traffic seems to have dipped over the past year or so (they have to big rooms and in the past, the main room was always full so they would have overflow in the back room) but I will continue to eat at La Casa because I know I will have a good and consistent experience each time.", "date": "2013-07-10", "cool": 0, "user_id": "aV-NwaWuXFaXU-ZWti-pQw", "business_id": "wdCH53icp_R2jJDrCZk42g", "stars": 4}, {"useful": 0, "funny": 1, "review_id": "8vhy_P6ydX29aIQ3D42FcQ", "text": "Omalza Fitness is the best gym I have ever been a member of. Ian and the rest of the trainers genuinely care about each and every person there. They all really take the time to get to know their clients and help them achieve their goals, whether it be to get in better shape or get ready for a competition. Omalza Fitness offers personal training as well as group classes. I have been to many group classes here and not one of them has been the same. They are challenging, but the trainers make it fun and are extremely encouraging. I am always excited to go to the next class. Ian is very knowledgable and is always looking for different types of training to bring into his gym so you will never be bored with the workouts. \n\nThis is a smaller gym so you do not get that corporate vibe where all they care about is your money. Ian is so welcoming and you will instantly feel like a part of their family. It is not like those other big gyms where they cram so many people in a class, therefore you will receive more one-on-one help with everything such as proper form to help prevent injury. You will have fun, be a part of the OFit family, and most importantly, you will see results!", "date": "2016-12-26", "cool": 0, "user_id": "3J35STMA9Y5oa8Ha_5xwAA", "business_id": "tQUdEckIHoIKoUpr-90d0A", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "EuqA533ONz--ZG9R0AXNwg", "text": "When our waitress was bringing out the food, the plate tilted and grease spilled all over my bag and hat. Needless to say food was overly greasy and salty. They also charged me a few bucks extra for choosing bbq pork as one of the options for the dish but the menu made no mention of extra charge. On top of all that, they placed a mandatory tip of 15% on my bill even when service was crap.", "date": "2017-08-03", "cool": 0, "user_id": "XqHgRaqoeZMTA4w4syG1_A", "business_id": "DVfCbJhJUDWRlUfrKzaKOA", "stars": 1}, {"useful": 1, "funny": 1, "review_id": "4-BUFGtJJhm6BNEEEInabA", "text": "The fish nibbling deserves five stars.  It's automatic giggles from the moment your feet go in the tank.  (it's also a little startling to learn where fish can find dead skin.  On my shin?  All over my shin? REALLY?  eek).\n\nSo that was a blast.  But the pedicure was merely serviceable. \n\nI will say that they managed to fit in my daughter and me as walk-ins.  We waited about 30 minutes, but they got us in - so that was nice.  And yes, the colour selection is good - although the front of the salon is so dimly lit the pale turquoise my daughter picked out turned out to be more green than blue, but she liked it, so all's well that ends well in that regard - but listen, just because I let two dozen fish dine on my dead skin doesn't mean the job is over.  My heels were still more Hobbit than Hamptons by the end of the pedicure, and the massage was lacklustre at best.\n\nThe actual polish application was good for me, but my kid had bubbles and chips from Minute One.  \n\nPrices reasonable, especially for her - but in the end, the job was only so-so.  Go for the fish and go elsewhere for the pedicure.   Staff friendly enough but we arrived at the end of the day - they were tired and it showed.", "date": "2012-07-24", "cool": 0, "user_id": "WA8enFmjfLmLXiBeVAHGcw", "business_id": "M6UqGENyN-AjjB8euu0GKQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "4t6b0hIgh8WQZVUl9WlAIw", "text": "Certainly not representative of Québécois cuisine, but should you just crave a comforting steakhouse meal, you will not be disappointed.  Over several visits both the food and service have been exceptional.  Great atmosphere, as well.  A perfect choice for a business dinner on an expense account :-)", "date": "2010-11-17", "cool": 0, "user_id": "69auY_I-3KkbEqMxzLzlow", "business_id": "u9t37U-maYXPJSSEikn7kA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "BYrZ-TUzLd0zu0BFEks24A", "text": "Love Ru's the only place I go for sushi! Great food, service, and prices. Always clean and fresh. Been going there for over 10 years and it still is my #1 go to for great sushi! Everyone I have introduced to the place to is now a huge Ru's fan!! Highly recommend!", "date": "2015-07-15", "cool": 0, "user_id": "IJ29XApkY2dMCAYq1_uUWQ", "business_id": "osSwv6CJy5hDKQdOKeyTow", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "z6q3atk8AMY5mzuoHg8tGw", "text": "Awful service. Indian couple in front Of us treated extremely poorly and talked down to rudely when they asked for vegetarian beans instead of black  beans, When I ordered my food they gave me literal scraps left in the pan, maybe like 7 pieces of dice chicken and half a spoon of rice, the food maybe took up one quarter of a bowl I ordered a chicken bowl, ridiculous. I was also treated poorly the girl rolled her eyes when I asked if I could have more meat and told me she would have to charge me double meat, what a joke, I didn't even get a half a spoonful of meat. I literally walked out, I just couldnt justify paying for such crap and terrible service. Went to earl of sandwich, same price way better food and service. DON'T EAT AT ROCKIN TACO.", "date": "2012-06-13", "cool": 2, "user_id": "O-2ti2y0UKJNCUwfQVwrHw", "business_id": "zY_YAwo4On0aqOABS-1cBA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "SGNAGBmPKhoTs8-di1CM9Q", "text": "The Best since decades. A MUST on Boul. St-Laurent in Montréal.-", "date": "2016-01-02", "cool": 0, "user_id": "84osP94rBhhhbQPAfYhhow", "business_id": "0W4lkclzZThpx3V65bVgig", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "FDiiMzD0Uq6HNXY6yLCajA", "text": "Not only did Jennifer lee do an awesome job foiling my hair, the prices were extremely reasonable and cheaper than anywhere else I've found in Pittsburgh. I will definitely be back!", "date": "2016-02-29", "cool": 0, "user_id": "u-eLTVoRTcEDOJSkHgs3eg", "business_id": "LEpAOZh8fo151rNKjLsAXg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "GXhMEtV2C6mwHn7g3AlEQA", "text": "I recently had a birthday and as part of the celebration my partner ordered a cake from Scot's. The cake was beautifully decorated and tasted delicious. I would highly recommend them for any of your dessert needs! I should also mention we split a cookie and it was fantastic as well!", "date": "2014-02-11", "cool": 0, "user_id": "MKOyX8nIic70UPJ5lYLUwQ", "business_id": "COqpcvg81W9ObhpzlzngVA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Rjj_echxgX7gcdqFIhnZzw", "text": "Parmi les meilleurs sushis que j'ai mangé, ambiance super agréable, une équipe de cuisinier au top.\nRéveil des papilles yummy yummy.\nAliments frais et", "date": "2017-09-27", "cool": 0, "user_id": "ID7IXpx--XolFWYlRhHbFw", "business_id": "IRIlwpomRvnXvpkeaGaM2A", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "4JM3m8KIQLsqGJOhcVQ0gA", "text": "Convenient hours, friendly service, and always have appointments for me to get my dog groomed and nails cut. The staff always cares about getting things right and listens to my concerns and questions.", "date": "2017-10-05", "cool": 0, "user_id": "T7PTcS27_H4v-XI9Icvh2g", "business_id": "j0_CApMCHDJBYJg1XvUKnw", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "Is5OU6uRF9_unsf1YXG1wQ", "text": "My husband and son and I ate here for the first time this past weekend.  The atmosphere is much better than we expected--the whole feel is more upscale than many Asian restaurants, with plenty of authentic decorations.  \nThe crab rangoons were among the best we've ever had.  The chicken satay appetizers were \"OK\"--other Thai places I've been serve more than just two skewers, but they were still pretty good.  Not as much flavor as they could have had.\nMy son (age 10) really liked the grilled beef entree.  It came with noodles.  The meat was very tasty, but the noodles were thick and served cold--kind of like eating worms.  Not good, but maybe this is commonly done--we just didn't like that.  Many good veggies with it, though.\nMy husband had the chicken pad thai and liked it--a generous serving.  Now, to my dish... I wanted to try pho since I'd never had it.  With my current cold/cough I was eager for a hot soup to soothe me.  Being adventurous, I tried the Pho Dac Biet (a combination pho.)  Big mistake!  It came with tendon and tripe--or \"cow stomach\" as I learned.  The odor from the broth even made it through my congestion.... I couldn't \"stomach\" it!  I picked around and tried to eat some noodles and greens, but kept scooping out chunks of bumpy stomach lining and tendons.  Not exactly appetizing, at least for me.  So BE CAREFUL!  I guess I was ignorant in my adventure, but I really wish I had tried the plain chicken pho.  \nThe servers were excellent and very friendly.  I would try it again but would order something safer next time.", "date": "2010-02-08", "cool": 0, "user_id": "iXLvbUUn_U7blZD-z2NMVg", "business_id": "Cw0JNNdPja9CVyT6ugGMdw", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "SQY8G-cLs1t2a8fgI7rXNQ", "text": "Fantastic!! Great service!! Awesome food!! The place looks great!!! You cant do better!! Plain and simple review!", "date": "2016-01-22", "cool": 0, "user_id": "tYmcjA9NAti8Wp0Xdo4yyg", "business_id": "kPR47uxGqmQNIQkIZr2_Tg", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "qzWzjymJYZZy93PJ6iYocg", "text": "Love Crema. It is a fairly pleasant place to sit - a bit cramped when it is full which seems to be most of the time. The coffee is delicious and the muffins are fantastic. I am not a fan of muffins usually but these ones are delicious - I think they might be Circles and Squares. Except the gluten free orange and olive ones - they look nice but taste like bitter sand. The people who work here all seem super-nice.", "date": "2014-02-20", "cool": 0, "user_id": "E50TRy3-BgaNAveAGDr7UQ", "business_id": "4Dqv3RVR7faMYfeJCChdyA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "0I78cByEYzXS-VdUlILIRw", "text": "I had a pleasant car buying experience at CBB.  The staff was polite, professional and honest.  Jamie guided me through the process like a true professional.  I would definitely recommend buying from CBB!", "date": "2017-10-23", "cool": 0, "user_id": "wt2Ls9gG0cLHdQVMaU9Tpw", "business_id": "Pbh0WNaKvkyI7HYwQMEWpA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "v-mb1UaeUxTVj-oGSDfePg", "text": "These guys made an appointment, and gave a rough estimate to pump my septic. They called to change the appointment after running late, and gave us a new time. They were late again, and showed up near the end of the day.\n\nAfter looking for the tank, he said he would need the camera that was on the other truck. Since the work day would be over when he got back it would be $150 an hour for overtime. If we wanted them to come back Monday (it was Friday ) then there was no charge for the looking they had done. If not, it was $90.\n\nI called the office to try and figure out why I was going to have to let my drains keep backing up, or pay $150 an hour, when the issue was the guys were horribly late and didn't bring their tools. The guy in the office was nice, but unhelpful. He described it as a unique situation with stuff under the ground in the yard making it hard to find my tank, and suggested I get someone with a backhoe.\n\nI had someone else come out with a metal poker and a tape measure and mark the tank off in less than half an hour, and charge me $25.", "date": "2016-04-12", "cool": 0, "user_id": "wZQNKDBEkJpsEGri7HM3JQ", "business_id": "vo-EekrtBvIRZvy1GALPRA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "2vubQoVzibQZJCL-buxEbQ", "text": "Husband and I went while on mini trip to Vegas- we got the open bar pod and it was worth the $10 extra. Short wait time during the day (less than 10 mins) - well worth the price- beautiful views- plan on going back at night! Also- this attraction is located on a little strip that is a nice place to walk and has cafe or bars available to sit outside and have drinks or lunch.", "date": "2015-06-03", "cool": 0, "user_id": "u97x4m6PkUpjl1jP1WEG1A", "business_id": "JAmQCmczUclNUfZjkNdjQA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "MxD1uoyBX027B6YGCGAvdQ", "text": "Big elvis was a lotta fun.  And I am not even an elvis fan!  It was a great show.  You have to get there early in order to get a seat.  Oh and dont forget about the one dollar margaritas!", "date": "2010-03-02", "cool": 0, "user_id": "Tn9XIN4Jq_O-O9sNgGZ6hw", "business_id": "SLJX2dksO_BeNMQUe3Nr8Q", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "AWumZMnuhnKEyLnABqx1sA", "text": "I meant to leave a review the last time I ate here this place is truly AWESOME!!! I had a great experience and the food I ate was tasty and there was a great variety. Best Buffett I have eaten at in a long time. Highly recommend!!!", "date": "2012-06-23", "cool": 0, "user_id": "wVqMbWLjrHkMd5ocEOKLJQ", "business_id": "2GtIC6u4hVneccWfTlOxHQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "9f08drpWcxTO0IQHcC803w", "text": "Horrible. Food had to ordered and paid for at counter. Cashier did not speak English. Food was eventually brought to table, Luke warm. And missing extras we ordered and paid for. Tortillas were soggy with grease.", "date": "2017-12-18", "cool": 0, "user_id": "MMMUTwomj2QCEeCeShKhHw", "business_id": "Hf64S1mE01qTOghyCa81cA", "stars": 1}, {"useful": 0, "funny": 1, "review_id": "T-1h1tTYu0r5-rOGPztyHg", "text": "Gosh. I love this place so. damn. much! It really is an awesome place to go if you're downtown for whatever reason (or if you're a cosplayer like me) Seriously, they've got wigs of every kind, color, quality, shape... The list goes on! In fact, I'm wearing the wig I bought as we speak. The only problem I had was that the salespeople (or at least the one I checked out with) was a little, well, blah. She was obviously tired and it took away from the experience a little, but I'm still happy because she was still helpful. But, I just have to say, even if you're not planning on buying anything, you should still walk in and check out the big costume heads lined up on the wall.", "date": "2012-12-11", "cool": 0, "user_id": "kA_lnKS6oi0fqZQuvrKrwA", "business_id": "5qsjQ2FiMrtXGTmkhCWalw", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "Uw7rzWBaYtyGo_r7w8bASg", "text": "I was in a pickle. My AC went out in the evening after business hours.\nI called 24 hr they said they would be to my house between 10:30 and 11:30 that evening. \nThey were right on time.\nMy service man was Anthony. He was very nice. We talked out the issue, made a plan of attack, and he went to work. My issue could have been a few things so it was process of elimination. Unfortunately the first plan didn't work and it went out again the next day. I called again, they arrived on time once again, and it was Anthony again. He did exactly what he said he was going to do. He went on to the next problem and, so far, so good. \nI got a refund for the difference between call # 1 and call # 2. The refund showed up right away, I have AC, and I am a happy camper.", "date": "2016-07-18", "cool": 0, "user_id": "rfA5iO7_hNVy48lDfRZqzA", "business_id": "8szCekDc2VT6nAE0gRdUUA", "stars": 5}, {"useful": 0, "funny": 2, "review_id": "M5jWY57UwYLRrXMmrRlA8g", "text": "Absolutely disgusting unless you like Totino's Pizza. Pretty sure the Italian Sausage was cat food.", "date": "2011-10-10", "cool": 0, "user_id": "yt3kGA8qyJDRYihAEY34yw", "business_id": "YDZRlB762hEebm2OyZISiQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "ye2Bzlucjm9ZRhHEXwMLAg", "text": "Excellent restaurant! Very good breakfast... the view can't be beat. The service was friendly and attentive to our needs..", "date": "2009-10-14", "cool": 1, "user_id": "kDodfemCZlvikFJmEXD3lQ", "business_id": "KBm72yWNxe-tkOSTQ0SWeQ", "stars": 4}, {"useful": 5, "funny": 1, "review_id": "2nJfwRPofTY6t8aYOKuoFQ", "text": "Accurate installed a Trane A/C unit at our house and it has required quite a bit of service over its first 2 years.  Recently, the thermostat broke and needed to be replaced -- of course on a 107 degree Saturday.  We had the technician come out and he told us that they do not carry the part with them and that Accurate does not provide access to the part over the weekend.  He wanted to put on a temporary thermostat but made it clear that he had no idea if it would work.  Given the fact the 2-year old unit has broken twice already and we had no idea if it would void the warranty, we decided that was a bad idea.  We paid him $146 for this call.  \n\nWe then called another provider who stocks the part (yes, even on weekends and after hours) and we got it replaced a few hours later, no hassles.  I do not understand how an authorized service agent of Trane does not stock parts over the weekend, particularly when we are talking AC during June in Phoenix.  As an aside, Accurate did call 4 days later, but not to try to resolve our issue but instead to make sure their technician followed the protocol of the company, which I guess he did.  \n\nSo, I'd say if you want quick service and expert repair, steer clear of Accurate.", "date": "2009-06-25", "cool": 0, "user_id": "X7o09w5ChEADT13dItr-TA", "business_id": "SiamekPdRn9JBc_D7DMTXg", "stars": 2}, {"useful": 4, "funny": 0, "review_id": "kpW1RIJkQbdg0g8L8P9D1g", "text": "I'm reading all the reviews about this place before I write mine and wow I can relate to a lot of these reviews. First off when I arrived at this location in Town Square I noticed that the AC didn't work. Drinking alcohol in a warm musty room doesn't help. Sweat just came pouring so embarrassing with friends around. \n\nSecond, there wasn't any cell phone connection. Couldn't access my phone.\n\nThird, the price for the food is outrageous. Make sure you go there during happy hour because it's 50% off on limited items. \n\nOverall it wasn't worth the $400 my bro in law paid, it was a sub par experience. Bring a sweat rag with you coz your gonna need it!", "date": "2014-07-08", "cool": 1, "user_id": "tra04YToNONtiq1k2jlwfQ", "business_id": "WDKTg468bkRPW0LqbAZfmg", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "5hbGVPrKujBy7H_Spg7WOQ", "text": "Super shuttle has always been a great experience.  Courteous and professional drivers.   Always on time or early and an all around reliable, reasonably priced and easy to use transportation service.", "date": "2014-07-15", "cool": 0, "user_id": "_0Ivk-eVzWKueh1UGNE6qw", "business_id": "nxCRx5_US4XLxufkF6-Tlw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "S9ePa1YW3MbLWuRx95ieJQ", "text": "We were in Vegas for our honeymoon and my husband is a HUGE MJ fan. We have seen numerous MJ impersonators and Jalles In this show is by far the best.  What he does is a craft and a true tribute to the legend. He is personable with his fans and takes the time to talk with them after the show. We also saw Brittany and I would not see her again but will see Jalles EVERY time I come to Vegas.", "date": "2015-11-21", "cool": 0, "user_id": "Zx9RtoyGkTIjEJTdBeT2iQ", "business_id": "C6pzMOksXBZ1sRZpzJ02cQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "zWqpKIooCnj2JFaP39DBOg", "text": "I'm updating my four star review to five stars because of the consistently great service we've had on every subsequent visit.  The food/menu remains great,...and the servers we've encountered are great...most recently, Cindy, at yesterday's brunch.  This has become our \"go to\" place and the servers (including the petite dark haired woman with the ponytail, whose name escapes me at the moment) are one of the primary reasons we'll continue to enjoy E&R.", "date": "2014-02-09", "cool": 0, "user_id": "ZdUFyF5eNyZxete-T4bmZA", "business_id": "igHYkXZMLAc9UdV5VnR_AA", "stars": 5}, {"useful": 1, "funny": 1, "review_id": "uyKYevi_HS5E5Ux22ubVeg", "text": "I went to beyond donuts &cafe for the first time today and not knowing what they had I tried called 4 time from 12pm to 2pm to find out if they had a menu on line. I went ahead and went up there since no one was answering the phone only to find the placed closed. The doors were locked and no one was to be seen in the store. There were donuts on the display case and no sign on the door saying why they were closed. This was a horrible I wanted to try this place because I have heard good things about it and we'll I will not be going back.", "date": "2015-01-16", "cool": 0, "user_id": "HsaolLhT50gCRUJMJLw5kA", "business_id": "rIRzDHgiPPivvjfySMeGtA", "stars": 1}, {"useful": 2, "funny": 0, "review_id": "7K3sTcJl9rg9Te-cTtqxnA", "text": "Great customer service. Honest, thorough, and quick estimates!  Only place we take our cars!", "date": "2015-07-16", "cool": 0, "user_id": "tQ80Tz8RXyhcdLzPJspj9g", "business_id": "eDJ0aUIAzc6PNuZ_6ELR1g", "stars": 5}, {"useful": 3, "funny": 4, "review_id": "VRt6plGGNHJ1lEi_J7JKyA", "text": "Switched coverage to State Farm with Jeremy's office 2 years ago. Paid in full in the office however they did not get it applied to my account. They sent a bill to my mortgage company, and received double payment. Still did not get applied to my account. Spent over two weeks dealing with this and Jeremy was totally uninterested in assisting. Just now moved coverage to Allstate. At that point Jeremy actually wrote me trying to keep business. Informed him directly I would not be renewing the policy. He wrote back said cancellation notices would be sent. He did not cancel. My mortgage company sent State Farm a payment, and I just spent two weeks again getting the refund processed. He is a salesman. Nothing else. I may switch back to State Farm down the road, but will never use his office again.", "date": "2013-05-17", "cool": 0, "user_id": "u9wPB5vrBu1IXVM6twa0eA", "business_id": "eTo4XP__WtX-R0lTPNYbNA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "v6eUKV4nQy05Hcv7Jg8UrA", "text": "I'm not a vegetarian and I thought it was good. I wouldn't do it everyday though. Defeats being a vegetarian if  ordering imitation chicken.", "date": "2014-11-17", "cool": 0, "user_id": "AUo_HbnE8elKc-5gvCWTpQ", "business_id": "L0d7r2zvjIaGCaj8fxJFRA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "Qvylv57TLsE3eWRH1pfSfA", "text": "Me and my boyfriend go here pretty much every weekend on Sunday for breakfast because it's right across the street. This place is old school. It's like it got stuck in the 70s and never updated anything. The service is always great. CHEAP prices. The food comes out really fast and is always good. The only change I would make is to update the building somewhat and clean a little more and thoroughly. Overall though love this place- just don't expect anything fancy or modern.", "date": "2016-03-12", "cool": 0, "user_id": "aIzGPXyh-2P0vc21qM8TAA", "business_id": "PHUcMHrbDKAmKxsqT2cewg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "f4U8iOSnpkX2TP2xkgBOww", "text": "This place is always packed but they do a great job and it's very clean! It's actually updated and modern. I find a lot of nail places are old looking and very dirty so it's nice to go somewhere that's very cleanly. I'll continue to go here.", "date": "2016-03-18", "cool": 0, "user_id": "aIzGPXyh-2P0vc21qM8TAA", "business_id": "ZfybM5c0BuLCrOtXbXai_w", "stars": 4}, {"useful": 3, "funny": 0, "review_id": "3yslNU33058TQUKTEIALYQ", "text": "Yeah so I'm no yelp elite.. I review one or two places a year for good reason; I really don't have the time or interest-- Unless i eat something freaking delicious or freaking disappointing. \n\nVery Peri (Chick-fiesta) is freaking delicious. Had it for lunch, brought my wife and kids that same night for dinner. \n\nGet the chicken (Peri or lemon, all good), and get the Peri rice. Go and you will not regret.", "date": "2016-06-15", "cool": 0, "user_id": "QzQImCCHd3-dkwzCYWlMmw", "business_id": "PGde9ygfV_a5oLQDNVedJg", "stars": 5}, {"useful": 1, "funny": 1, "review_id": "yBprRuhMjZF_4cg5vv6TYw", "text": "I'm not terribly familiar with this store but I can say that it is definitely the place to go if you're looking for pianos.", "date": "2009-03-23", "cool": 0, "user_id": "_pyEzgAtUSsogY8aqsZG4Q", "business_id": "fnYEdua0bAiRVWJ-MOdpew", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "nRQxcOPnztJP8T72PNV_ag", "text": "Our first visit to Lon's and it definitely won't be the last!  We loved the\nambiance and the food.  The service was great.  What a beautiful treasure!", "date": "2012-04-24", "cool": 0, "user_id": "4RC6p0R7-OhZQONaMBDrjw", "business_id": "oj8qk3W7O9oq15VIs-vYJQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "OMv-hs_XQ8L4ha7WY0wf2g", "text": "Normally I enjoy my food here but tonight it wasn't very good, I ordered cheese enchiladas and chili relleno, the cooks forgot to put the cheese inside my cheese enchilada and a very small amount of cheese inside the chili rellleno as well as very little sauce on top of the chili, plus the  refried beans were extremely dry and lacked the usual creaminess.", "date": "2015-02-18", "cool": 0, "user_id": "rcZZNn23_19uH5NqjTYAKA", "business_id": "IoyamGmKao_hfQBvFKihyA", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "73U88Zw0CJYY-ANevI_fCA", "text": "I went to Moes last night and had a great experience. I ordered my usual homewrecker with steak and a side of queso but this time was different.\nThe food the was great but the customer service was over the top! The employees were constantly checking on the guest and even refilled my drink for me. I go to a lot of Moes in Charlotte but the Moes in Southpark here at Sharon corners is absolutely the best the restaurant is consistently clean and the food is always fresh and the employees act like they want to be there. I will be back and I recommend everyone to go to the Moes in Southpark it's actually clean and the food taste great!", "date": "2015-06-16", "cool": 0, "user_id": "JpO1UYfu5b3ypVoE68O4ww", "business_id": "CR4fW7p_6bpTkul1SdpRsg", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "YZmZikDplvlfLhmYfmGe2Q", "text": "Dr Brad Roberts and his team are our dentist of choice for many years. Professional, great work.", "date": "2014-11-24", "cool": 0, "user_id": "vyZfNyeUJGRJvFDQfvKu-g", "business_id": "oro0VytYP7OxO8Hwv8bTng", "stars": 5}, {"useful": 7, "funny": 1, "review_id": "EmuFG2MUV_q_E_Tt7L6Dpg", "text": "What a waste of time!  I made my appointment based solely off the fact that this place could see me quicker than another dermatology center when I should have heeded the advice of the other reviews.\n\nI was held up with work and was a few minutes late to my appointment.  The receptionist asked me, \"Have you filled out the paperwork online?\"  I shook my head as I did not realize there were documents I needed to complete beforehand.  The receptionist says \"Well, let me go and see if they will still take you today.\" \n\nThe woman leaves and comes back a minute later and says to me \"They are running behind schedule as it is and are trying to get out of here so we will have to reschedule your appointment.\"\n\nI waved my hand and said, \"That's alright.  Dr. Blanchard has poor reviews on Yelp anyways,\" and I walked out.  \n\nI understand the fact that I was late, however, telling a patient, let alone a new patient, that the staff is trying to wrap things up so they can leave for the day tells me one thing:  \"WE DON'T GIVE A DAMN ABOUT OUR PATIENTS.\"", "date": "2015-03-19", "cool": 1, "user_id": "QWUCx_phlA-LNq8ykamQgQ", "business_id": "oKRrkIPfEotdlGkidc3M-w", "stars": 1}, {"useful": 3, "funny": 0, "review_id": "VEy-9_8wDW9-C_Utgf0PmA", "text": "I am very disappointed with Fanco fans. I spent over $4,000 in this store and have not had very good luck. Two days after installation the fan stopped working and I was told I needed to take it down and bring to the store. I said so you now want me to pay to have fun taken down when I just paid to have it installed. Not going to happen. So one of the employees came to have fix it. A year later it stopped working again. I paid $125.00 for a service repair call to find out that a portion of the light motor was bad. I called the store and spoke to Andy who troubled shooter with the repair company and identified the issue. This was on June 3,2016 that Andy committed he would order the part. On June 24,3016 I called the store to inquire and the person found no notes about ordering the part. He took my name and number and said he would check with Andy and call me back. I will repost when I have an update. \nI have had No trouble with the fans I purchased at Lowe's, which cost much less.\nStay away from this place!", "date": "2016-06-24", "cool": 0, "user_id": "IlqFEHGzOv1MJKJhcGTg5Q", "business_id": "hlCDoScWrxIQTQMBHL7ovA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "6CRAJbVsReTO1FqDwOBbkg", "text": "This is probably the best Chinese restaurant around. They have large portions with reasonable prices. The restaurant itself is small but it packs a punch. They have great Chinese food along with some great Thai choices. Highly recommend this place. Friendly and fast services.\n\nRecommended choice: Hunan beef along with the House Special Soup", "date": "2017-03-25", "cool": 0, "user_id": "bU4eG3p8X6yvC08Zx0kmzg", "business_id": "_VYUU5HPLYasd-xdKLimNA", "stars": 5}]