[{"useful": 1, "funny": 0, "review_id": "HkSebQqJmaCpodIdb_S6lQ", "text": "I shop here mostly because i live in Brampton. Great customer service, well stocked and clean. \nBut, beware of parking routes and stupid drivers. Gets hectic at busy times (weekends) so avoid. 'New' Canadian customers are rather rude and ignorant..so i go to Miss. or Vaughan locations when i can. You will notice the difference.", "date": "2016-11-18", "cool": 2, "user_id": "zx_Op2OAOM_fRic9tU-jqA", "business_id": "LFxa9cAfKY_OlALN8sArgQ", "stars": 3}, {"useful": 3, "funny": 1, "review_id": "iXp5A9Zl02oomdjHyIgVjA", "text": "The Duke of Kent serves up traditional pub food in a cozy spot at the corner of Yonge and Eglinton.  Kent is just one of a series of 'Duke Pubs' scattered around Toronto, and judging from the fairly comprehensive website, each has a slightly different décor, but all of them seem to tap into that English corner pub ambience.\n\nAfter a long week at work, I was on the hunt for a casual space to grab a pint, enjoy some hearty food, and catch up with some friends; the Duke of Kent was a great choice...for the most part.\n\nI snagged a corner booth with my dinner group on a busy Friday night.  When we first walked in, it seemed hopeless. We wanted dinner, but there was nary a table to be seen.  The staff did everything they could to make a space for us so we weren't forced back out into the cold to one of the other countless restaurants in the area.  That is what service is all about, and we were happy to stay.  Many thanks to the serving staff for being so accommodating on a hopping Friday night!\n\nAs for the food, it is the expected and welcomed pub spread.  They offer up fish & chips (yes, served in a basket on paper), pot roast and potatoes with buttered peas, and even bangers and mash.  You will find an array of reasonably priced English pub food on the menu, with entrees coming in at about $12 across the board.\n\nAs I've said before, I tend to go for the specials, and that night it was Moroccan Stew.  Unfortunately, I am sad to say it was disappointing.  The dish was somewhere between a curry and a Mexican chili, and I was given a healthy serving for the $12.99 price-point.  But, I couldn't help but become envious of those around me who had gravy-topped pot pies, crispy fish and chips, beefy burgers and gooey quesadillas.  I probably would not have been as put-off by the it if it was labelled on the menu, as it was on my bill - just 'vegetable stew'.  It was not as exotic as the name lead me to believe, and with a delicious-looking curry dish on the main menu, I expected more spice and life in my 'Moroccan' Stew special.\n\nFor a visit to the Duke, I suggest going full-English.  I saw enough plates of fish and chips go by to convince me that it is a popular item, and how much more traditional can you get than that?  Also, I have the 'famous' deep-fried pepperoni targeted - it has to be famous for a reason!\n\nAt the end of it all, the Duke of Kent draws in a wonderfully lively crowd, and provides a great atmosphere and service, albeit a bit slow - but hey, it was busy!  My food may have only been so-so, but the brew was cold, and my night was great.", "date": "2010-12-18", "cool": 2, "user_id": "YHWsLBS8jzZiPjKHMFOaAA", "business_id": "m7PPpShEdfhtV-7NnPN1Nw", "stars": 3}, {"useful": 8, "funny": 1, "review_id": "8x3RzF1L1w41DLBtYjXA-g", "text": "I would give zero stars, if I could.  We hired H & S to install new brackets on our gutters around our entire house-- we were told they also should have been screwed in rather than nailed, and they would do that, too.  They came, \"did it\", I paid and they left.  Only, they did not do it.  My husband got up on the roof to blow leaves and NOT ONE new bracket had been installed.  The assumption that I have made in regards to this is they had no idea that I am married to someone who still blows his own leaves and cleans his own gutters and thought that we would never know the work was not done.  \n\nThey have come out to do the job properly.", "date": "2015-04-10", "cool": 0, "user_id": "OQT9DjfBrzrwOEdVJjuYIA", "business_id": "4vxpq3gE4p710Wxh82traQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "xMabXlUlIQkmNn2NjnIOlw", "text": "Food is delicious, price is kinda high for breakfast place but the service is excellent & the ambiance gives an uplifting mood.", "date": "2013-07-25", "cool": 0, "user_id": "AuIK5tF2GjO7SftHawTLKw", "business_id": "C9ImzBi5fn742ZcAYDww2A", "stars": 4}, {"useful": 0, "funny": 1, "review_id": "oO7EklMNUuLWKCQCInAiSg", "text": "Quick service ... Tasty flavourful food... the chicken kabob is great and tender, tandoori special gives you a nice mix and the beef kabob is also very flavourful and tasty. \n\nSalad could use a little extra something something but is fresh ingredients at least for now. \n\nGreat place if you need a quick bite.", "date": "2015-10-06", "cool": 0, "user_id": "kBNFdviedCPFWyR-wVaAzw", "business_id": "A8yT6LIlgRn18p1qbW9-ZA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "YZ-18xeXPACWT8XSpC5vpw", "text": "I thought maybe this was a hidden gem, not at all! Food was okay, space is very dank, service was horrible! My dinner counterpart did not like her meal, the waitress' response: Sorry. After asking the item to be removed from the bill the waitress and owner literally argued with us since she had taken a few bites (how else can you tell you do/don't like something). A few days later, I'm noticing they ran my debit card twice. NEVER AGAIN!", "date": "2014-04-21", "cool": 1, "user_id": "OEhGkOZzU1Zz9rMoXlbHiw", "business_id": "dQwjYLmQXb06CpMPIpm5-g", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "nzdrfYMfd1DrPvv54WeWgQ", "text": "Let me get the one big negative out of the way: nowhere in the place are prices shown. Not anywhere. Not on the menu board, not on the counter or the display case or on any kind of sign. Sure, people who own homes in Baby Point can ignore such trivialities, but not the rest of us. More transparency, please!\n\nOtherwise, we love this spot. Bright, airy, and mostly comfortable (except for those metal stools), with exceptional coffee, fascinating and unusual beverages (I tried the tumeric latte most recently) and a great philosophy about environmental respect and quality product.\n\nLocation is a bit out of the way. But while not especially convenient for us, we go anyway. The video screen with updated bus information is a great idea--riders can grab a coffee without worrying about missing their ride. Wifi seems good, music is listenable, and faces are friendly.\n\nWe are looking forward to future visits. Just let us know the prices, okay?", "date": "2017-11-05", "cool": 1, "user_id": "2dZjPtHGkxYW1-XhRgs3zw", "business_id": "pDKITbL0no7HPHFodv9jTQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "rD3SzaR2BPflA4Ja2hIZ6g", "text": "Superior Tire handles all oil changes and services for my vehicles.  They offer great pricing, all work is done in a timely fashion and the staff is very knowledgeable as well as helpful.  They work on all makes and models, and provide very reliable workmanship.  Stephen, the Store Manager, is always there, always friendly and always willing to beat anyone's prices!  Ask for Jameson when it's time to make an appointment or have any questions - he has the answers and is happy to help!  I highly recommend Superior for all your vehicle service needs!", "date": "2017-12-12", "cool": 0, "user_id": "FWO8yo40ipS6eXeXtkIDBQ", "business_id": "qZcKRWui7oUfVJoGl0AIyg", "stars": 5}, {"useful": 3, "funny": 1, "review_id": "-newKncC4brje-iKC3JOcg", "text": "I had a very pleasant experience at this dental office.  Front office staff was friendly and helped me figure out my new insurance.  Had one filling done and it wasn't bad at all!", "date": "2012-10-02", "cool": 0, "user_id": "sHEGIUjcwG_qVmHtcdudxw", "business_id": "1cCh0fuVULWtWhJPr95jIw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "0BwOQFAqvsIK1qqdcrQwEg", "text": "Came to this location for some pre-surgery tests. Staff was super friendly and absolutely great. I would highly recommend this location.", "date": "2016-03-16", "cool": 0, "user_id": "AJVIsIzznYPDfuKm7tBg1Q", "business_id": "Zo0DWTyHTSyKRVIWIYVf-w", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "UEg-wPbqru5s_mXttXmvfg", "text": "Took my almost 6 year old today to try out the summer camp session , what a great surprised when I walked in the door 15 min before it was over and see all the kids including mine soo happy , dancing playing and the staff was super cool playing and dancing and helping each one of them do all the activities !! I will definitely bring her back , she asked me to please sign her for the camp!!! Well done my gym glad I found this place!!!!", "date": "2013-08-01", "cool": 0, "user_id": "KKgHnDVFe8y5F7BI7njrFg", "business_id": "iAKEqmYnttz54EmcQ1xhAg", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "PsXMmd1z_XiqMz8MlDMCfQ", "text": "When eating tacos, I like to have a good hot sauce on the side. Cantina definitely delivered in this respect. On the table, there are two hot sauces, the red one, chipotle based, and the green one, SPICY! \n\nWe ordered the octopus taco, fish taco and the LA truck taco. The combination of flavors worked very well. Each was enjoyable but the octopus was particularly good. I'm not sure how they cook it, but it was soft and flavorful. We also have the ceveche and plated chorizo burrito. The ceveche was not what I expected; I could have used some more salt and lime. The burrito was quite good, and unique. It had a fried egg on top, along with many sauces. \n\nThe reason for 3-star rating is mainly because of the price. With so many other fusion taco places around now, changing $5+ for a taco seems to be a bit steep.", "date": "2014-02-17", "cool": 0, "user_id": "hJulW1s6tOBr2NXD9nAoMQ", "business_id": "fK1oj0dk9Bc6KsBk5mMDxg", "stars": 3}, {"useful": 4, "funny": 0, "review_id": "RhYhZ4ectuMapt6B_MpYtg", "text": "I am back again. Happy to say the new location is even better than the last. The level of service is great. I will be back on a monthly basis. I had forgotten how good these massages are.", "date": "2012-01-31", "cool": 0, "user_id": "M1vcFzCYRS2WGcIaJ5U0_w", "business_id": "Zwg2TWwdm7y5ORK3yN6nDw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "hB-vJuQO43vlhXu9mQt4Pw", "text": "I eat lunch here at least once a week and the quality is top notch. Always. No rubbery chicken or beef in the form of leather snipets. Just the right level of spice.", "date": "2011-06-06", "cool": 0, "user_id": "M1vcFzCYRS2WGcIaJ5U0_w", "business_id": "FcNtrDGaWmkDzlHaq9F1UQ", "stars": 4}, {"useful": 3, "funny": 0, "review_id": "BYjrj8zZlt2PE-1kmCpgZg", "text": "Please, please, PLEASE do your body good and get your piercing done at HTC.  They are the best in Arizona, I can guarantee you that.  (+ positive, - negative, -/+ neutral).  \n\n+ Beautiful selection of jewelry.  They have bone, wood, glass...\n\n+ They know what they're doing.  I actually had my tragus corrected here because the last guy who did it (tattoo shop, of course) did it wrong.\n\n-/+ I have yet to decide what I think of their customer service.  Ninety-nine percent of the time they're very helpful, understanding and polite.  Once, however, I thought one guy was going to have a fit because I took my gauges out.  How was I supposed to know that was unhealthy practice?  Maybe he was just having a bad day...\n\n+ Ask them anything.  No question is too dumb, believe me, I've asked plenty of them.", "date": "2008-09-28", "cool": 0, "user_id": "dnSBTYaCnKk_zxjAic1QEQ", "business_id": "pApEPv1-ApXee4GYYMB5AQ", "stars": 5}, {"useful": 3, "funny": 0, "review_id": "FMzPrbJaYVj-aXc6_XTDOQ", "text": "West Side Story was absolutely fantastic last eve.  Michael our server was excellent.  However the chef should be totally embarrassed for serving pork chops that were so overcooked they were impossible to cut  even after trying with a steak knife.  What a disappointment.", "date": "2015-11-17", "cool": 0, "user_id": "kPjC3OAjggJm5mVttuKuxQ", "business_id": "FyucbcsZwdDs5RQ7Tk9z9w", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "gzBB-2e8fLOYFk997KnNvQ", "text": "So disappointed.  There were five hostesses standing around as we showed up ten minutes early for our lunch reservation,. We were seated about 12 minutes after our requested time.  Once seated we waited forever for a server.  The entire experience was just SLOW.  My meal was just average, the salad was overdressed and we had to ask for water and more drinks.\n\nI was glad I did not suggest this restaurant since everyone in our group was let down", "date": "2011-06-28", "cool": 0, "user_id": "Auxu_C_QmuyM_DW0jFK_hA", "business_id": "4JNXUYY8wbaaDmk3BPzlWw", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "1VH3cDm_oAo8RGvvWMGgmA", "text": "quesadillas (jalapenos), smokehouse (chargrilled) whole wings, Mighty Fine Bovine - highly recommended!", "date": "2015-06-18", "cool": 0, "user_id": "EENi5iWbYEvC2oeuldLTZQ", "business_id": "LQFmktF43j2NPncKdNd9mg", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "duVXjmNdgk_KMR4YVXKnfQ", "text": "Pretty tacky place but gotta love a rooftop?! Food was pretty gross American Mexican food. My taco salad was just like what you'd get at Eddie's under Towers. At least corn tortillas were an option for a taco, though. The margaritas tasted like jolly ranchers but my mimosa had a generous champagne to oj ratio. I'd go back to hang out on the roof..", "date": "2013-06-13", "cool": 0, "user_id": "KMinNwBquxsvvjeE91Mc2w", "business_id": "zMfZLd5_h5W8ZVxTNoeJyQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "ehlsZ3mxgyVIee1hNaNaTg", "text": "Great food, great presentation, very knowledge accommodating and friendly waiters, slow service", "date": "2012-11-13", "cool": 0, "user_id": "mR79x9r4o02BrTOOzXa-jg", "business_id": "hLThl4NxoJmHadtb6vLNsw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "wLqVeBGCDTtKelgH9NkfJg", "text": "The staff was excellent.  Food was great.  They went above and beyond.  We would recommend this place to everyone.  We've never experienced this much friendliness from a restaurant owner and staff.  He held the door open for us.  Went out of their way to make us feel welcome and to make sure we were satisfied.", "date": "2015-05-05", "cool": 0, "user_id": "8bUSLEwKp3oG3lDgkZstxw", "business_id": "om7YKYOC-Dulqq4Bl5lRYg", "stars": 5}, {"useful": 1, "funny": 5, "review_id": "MgrbfQ6wWNFM8B0VvJ1hGg", "text": "I'm so grossed out by this place & will only use it if I'm passing by & need to use the washroom, even then I'll hover. My son went here a couple days ago & was freaked out with some of the other users & filth, he won't go back either. This place is within a km of my home & is only 12 years old but boy it sure isn't looked after. The cleaning people clearly don't know how to clean, they don't have anybody training or supervising their work, yuck! You'll be sick for certain if you use the pool. I stopped going to the fitness centre there years back because they use a community cleaning towel & watered down spray cleaner. They regularly have out of order cardio equipment that's awaiting repairs & people are lined up almost standing over your shoulder waiting for you to finish on the equipment you've just started using. If this is what a fitness centre is I'd rather not have a membership. The cost of memberships here is higher than a city facility, this place hasn't seen any renovations or upgrades in 12 years. How are the interior concrete stairs in such disrepair. & chipped away so badly? The pool is small, no slides or waves - nothing to do there either. Even the food court is a joke. Go to a City of a Calgary recreation centre. Parking is impossible even at the best of times.", "date": "2014-09-12", "cool": 1, "user_id": "KjT3D4gZd5B-_WKgzmWjKg", "business_id": "rM0Z-G5WuJ-8bGK7PtRkzQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "M7uxRfNo2LofPdwcqbbnDg", "text": "I love ordering ice coffee from Wendy's because their coffee is larger than anyone other fast food joints. The medium is Macdonalds large cup.    I feel that it's worth my money.", "date": "2013-03-19", "cool": 0, "user_id": "xJIIN-QCYm4S7AJAyIhT-w", "business_id": "BZUhdg7GQJfNstUyH2BcSA", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "tRbsJE9aDxX9vnYHWKty4A", "text": "Every time I have been to a church social, mainly for dinners that were put together for the catechists (religious education teacher for those of you who don't know) this was the catering service used. I cannot begin to describe the food to you. It is so good (not as good as a nice home cooked meal) but it sure comes close.\n\nThe eggplant Parmesan is to die for. I had it for the first time about a week and a half ago. I never had eggplant so I was not sure what to expect.  More recently though I was privileged to eat there food again on Friday when I went to the Ordination of the Diaconate at the cathedral. The reception was afterward and they had food that represented the large majority of cultures which I though was good.", "date": "2013-06-04", "cool": 0, "user_id": "7QRec81IeLgHcG6Tln0D8w", "business_id": "upBVCVmIEi7H-JD8OU_gxw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Yt4mIWpzELCH4jodIcqINA", "text": "I contemplated punching my sister out when we rolled up to Yama, which looks like a run of the mill sushi joint placed in a nondescript shopping center off the beaten track of the Strip. She's a NYC transplant so I trusted her judgment of good, quality sushi but I was a little apprehensive when we drove up and saw degenerate/hobo looking types wearing cowboy hats and smoking cigarettes, standing outside of Sally's (or something or other) gaming spot, next to Yama. She swore it was delicious and convinced me to ignore everything else from the outside. The area is a little run down but don't be fooled, Yama is a total gem. The sushi is...just...so freakin' good! Super attentive waitstaff who are constantly running around to see what you need. Loved the salaciously named rolls like \"One minute man\" or \"Sex on the beach\" - so Vegas! My personal favorite is the Firecracker. I must admit, many rolls are slathered in sauces but that's how I like it. And, how on earth do you beat $23.99 for all you can eat sushi??!! Total yum. And rumor has it, Yama purchases their fish from the same wholesalers that Strip sushi restaurants use, and Yama is a fraction of what you would pay elsewhere. If you're in Vegas, and you love sushi, you must go (just ignore the cheesy, mismatched décor!).", "date": "2010-08-27", "cool": 0, "user_id": "R-U0I6Rx-R62F0hXcdYjAA", "business_id": "ugLqbAvBdRDc-gS4hpslXw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "_l2xFX7AM4vsAaL69cLANw", "text": "when i first walked into the place i was a little taken back.  being a local of Las Vegas, this was  not like every other nightclub.  it had a dark feel but in a good way,  live entertainment every so often, and characters walking around mingling with the crowd.  reminded me of a rave style place but after being there a little while it turned out to be a great place.  the music was great and although not that big of a place they did not jam pack the place like most clubs in this town where everyone is touching your shoulders unless you buy bottle service.  the only complaint was the drink prices, but other than that i would def. go back and had a great time.", "date": "2013-02-27", "cool": 0, "user_id": "JuIyVOouMHNDhpVJHHiU5w", "business_id": "3sHuMp7XtNHE28ZcQ1mk_A", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "o1bLOfESeo6ecZ52wIy3BQ", "text": "????\n\nLobster combo", "date": "2015-09-23", "cool": 0, "user_id": "w0PGaBMEUjYPSqUYGeU1sw", "business_id": "Lv9wzkvPrVG-VdPGcw53_A", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "XgH7WqQ_5c3dsebYuRjC-Q", "text": "Another gem at 130 Davis Drive, the strip mall of many dining choices. I was a bit concerned when I arrived and found the place to be completely empty at 6:30 pm on a Thursday. The decor was quite nice though, and I figured Yelp would not have steered me wrong. Several groups did show up just as we were leaving. Maybe people eat Indian later in Newmarket?\n\nThe host/server was quite friendly, and he turned on the house music for us, not that I asked. He cautioned my dining companion that the Korma was mild, which is usually the reverse of the typical \"that's hot\" warning you get at most Indian Places. I thought that was interesting.\n\nWe ordered a murg (chicken) korma, murg dhaba, both with naan, and a paneer pakora appetizer. The appetizer was pricey at $11, and there were only six pieces. It was good, but definitely not worth the price.\n\nBoth curries were delicious; the korma had an aromatic flavour, and was quite enjoyable. I had no idea what dhaba was when I ordered it, and it turned out to be a slightly spicy butter chicken-type dish, which was quite tasty. The naan breads were the show stopper for me. I'm a naan snob, and I was very happy with the naan here. I also ordered mango lassi, my go to drink at Indian places, and I was very pleased with it.\n\nOther than the overpriced appetizer, I was very happy with my meal here, and I'd definitely like to sample their extensive menu in the future.", "date": "2012-03-11", "cool": 0, "user_id": "Vs69Q_nKLfBcviqTUnZAzA", "business_id": "upV1mQ5v0wcKUuA2AY85WQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "5voO1GVvpgeeanJBpTJ_SA", "text": "First of all, let me say that I love our local Olive Garden in Rochester, MN.  I love Olive Garden's menu, so we dine out at the chain somewhat regularly.  We went to this particular restaurant yesterday for a dinner with an elderly relative.  I suppose when we walked in, they profiled us and didn't feel we merited any kind of special or polite treatment.  We were led to the most cramped, dingy and dark booth I had ever seen in an Olive Garden restaurant, where the lighting was so bad, we couldn't even see our menus.  Our server was Sergio, and he was just going through the motions--quite badly.  He didn't smile once, or come back and ask us how we were doing.  He brought the salad, and then we didn't see him for a half hour or more.  Then he came and picked up our salad plates before he served our entrees and actually left the dirty salad plates on the tray beside our cramped dungeon-like table for a long time.  To top everything off, the family behind us were the rudest, most uncouth trash I have heard or seen in some time--they need their own reality show on some trashy network.  Their 2 or 3 year old brat was allowed to screech inhumanly for their whole meal, which unfortunately overlapped ours.  When we finally got our food, it was hot (unbelievably) and tasty, but everything else about the visit was a complete and total fail.  I would be surprised to imagine that the Olive Garden franchise can condone this kind of service and atmosphere.  Luckily I was just traveling through and don't have to ever eat at this hellhole again.", "date": "2014-04-07", "cool": 0, "user_id": "Dyifp3W0a8ayisbTmy6m4g", "business_id": "qpBfYbkPmXIFWVQ7pLkQ_w", "stars": 1}, {"useful": 2, "funny": 1, "review_id": "rMbF2npWhrTmMk1BPTKUHw", "text": "Oregano's is OK. The pizza is passable but not a million miles from a toasted lavash cracker, the beer is all right, and the pizza cookie is pretty good (it's basically a cookie half-baked in a deep-dish pizza pan). \n\nThe problem with Oregano's is that it's something of a victim of its own success. They don't accept reservations no matter what the occasion, and there's almost always a wait. I've yet to figure out why, because it's really not all that. Unfortunately, I have friends who like it, and my polite requests to go elsewhere aren't always properly considered.\n\nOregano's relies on gimmicks--swing music, gigantic menus that are awkward to hold, and cutesy names for the pizzas. Sports fans take note: There is no cable TV.  When I  politely asked if they could turn on the Suns game (this was playoffs time, mind you), I was sternly told that Oregano's is not a sports bar. God forbid anything should distract customers from the frighteningly chirpy wait staff. \n\nSo after waiting a good long while to be seated, expect to be led through a gauntlet of manufactured greetings and well-wishing on the way to your table. If you're particularly unlucky, you may be served by the effeminate robotic waiter who avoids eye contact--he manages to be chirpy and rude at the same time, the worst of both worlds. I think he's worked there for a long time. If you veer off script, his head just might explode.\n\nI'm just too damn cranky for this overrated pizza joint, I'm afraid.", "date": "2008-11-11", "cool": 2, "user_id": "vuTMJH3wOS-cTIgda6UAOw", "business_id": "dUffgo9Lh_Vk9TLuFR5ywg", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "qI_GQL8CpFmfcLmySkpVtw", "text": "Grabba Green is a worthy guilt free splurge. Great atmosphere, friendly team. The smoothies are the real deal, and come loaded with fresh, colorful ingredients. The juices are 100%. I enjoy the premade elixirs they have available.  Always feel invigorated after leaving. The pricing is fair and comparable to competitors Who offer the  level of freshness you are getting.", "date": "2015-05-29", "cool": 0, "user_id": "ZY6qvHbhTnHuMn0pB7XBNA", "business_id": "DZpUH96f1Uomk7N8FlZLjg", "stars": 4}, {"useful": 3, "funny": 3, "review_id": "3k5ndfvGaLV66JxdD4gfbA", "text": "I had my choice between this place, Yours Truly and First watch. I picked Scrambler Marie because I haven't been there before....bad choice. \n\nWe stood at the hostess stand and several people walked by without even looking at us let alone saying \"hello\" or \"someone will seat you soon\" so we justs stood there for awhile. We were finally seated and offered coffee and OJ.\n\nAbout ten minutes later (they didn't seem busy compared to how much help was walking around) our waitress showed up with coffee and juice along with another girl and they literally twirled around each other to set a pot of coffee on our table and the table next to us. She apologized for the wait and took our order. \n\nI got the Mini Classic which was supposed to be eggs, bacon and a mini pancake, and my boyfriend got an omelet with sausage gravy (sounded gross to me). Our food was not good. It wasn't in edible or anything, just not good. And my breakfast was enormous with two huge pancakes......I don't know, having that much food in front of me is nauseating. I ordered the \"mini\" for that reason.  The waitress only came back one time during our meal and asked us how our food was, but she was facing the other table, and then we sat for a long time waiting for our check after we were done.\n\nWhen we left, no one near the exit said goodbye or anything. I don't need anyone to kiss my butt or anything, but it was just a very unwelcoming place. And the food isn't worth leaving your house. \n\nStay home and have a pop tart, it doesn't say hello either and the quality is about the same.", "date": "2014-04-24", "cool": 0, "user_id": "-x5EfjCVUxGX1NGbDabglw", "business_id": "D31JSfofD0dYbIx7Yak2Yw", "stars": 2}, {"useful": 5, "funny": 0, "review_id": "0HhCAnNbi9_12Y0dV09cjQ", "text": "I've been to a lot of restaurants..and if I had signed up on Yelp sooner I would have reviewed them all..but am soon going to catch up. I've been to very pricey places..that does not deter me, however this place was almost on the ridiculous side. \n\nHigh prices for sub-mediocre food!\n\nThe rice/paella was flavourless, my mussels were a bit off too. I could of had tastier rice in Chinese take-out. That's not supposed to be a joke. That's true.\n\n$30 for a paella for one.$30 for rice. and it was not good. not even \"ok\".\n\nOn Saturday's they offer suckling pig..mmmm.im thinking warm, juicy, suckling pig. $14 for a small tapas! NOPE! COLD! DRY! arrrrgh. I had read the bad reviews before going, but wanted to give the place the benefit of the doubt.\n\nAnd yes..the other reviews are true..there is Arabic dancing as well as the Spanish dancing..which I must say, was the best part of the night! The girls did a great job entertaining. \n\n..but seriously..don't bother eating here. there are a million restaurants nearby that will probably be more enjoyable.", "date": "2013-09-24", "cool": 0, "user_id": "GagjGfivWXV7y99P08VP3A", "business_id": "jesEHiUvX8CzF9gRjwMZ3w", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "3kFwEvK2PsNVc0ZL-cc4WQ", "text": "La banquise, arguably the best place in Montreal for poutine. I believe this could be true. The staff is really great and they have a great selection of poutines there. There's nothing better than going there after a night in the bars when you're craving for a poutine. Their portions are very generous. Whenever friends from outside the country come visit, I make it an obligation to take them there.", "date": "2013-12-03", "cool": 0, "user_id": "eWUWCTB5bKs_-rgxbcjALw", "business_id": "5T6kFKFycym_GkhgOiysIw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "jO7BLz93ty_CuDbqeXwRqQ", "text": "I've been taking my kids here for a while and I absolutely love this office. We currently live in the Goodyear Area and I'm more than ok with taking a 30 minute drive to get to the office. My kids see doctor Shepherd and she is awesome. Very knowledgeable, caring, understanding, and very gentle with my children. She always available for advice or to answer any questions that I may have. Anita, the MA is just as awesome. She's easy going and very knowledgeable as well. They make their patients feel like they're at home and that's what I love most. When I call and leave a message for the nurses, they call back ASAP and that's another thing about this place, you don't have to wait hours for a response on questions that you have. Front desk are always cheerful and greet you with a warm smile. This office is the way to go!", "date": "2017-06-27", "cool": 0, "user_id": "YpSGbewp2EFf1t8egdsvfQ", "business_id": "Wd0ojAfJ3JicmE0T2K7UqQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "JYYl83BilxsEpeNze7FteQ", "text": "One of my favorite dessert spots. Unique decor and yummy treats! Awesome central location and fast service. I would recommend the Sesame Street snoh treat. Magically delicious.", "date": "2015-09-04", "cool": 0, "user_id": "_IVw73h5SAgENCFsAHPTlg", "business_id": "I_a74zmgR-X03LsKISWPcg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "NwaIX49j2PFDCf4k1AalBA", "text": "Expedia was wrong, this location is not on site with the airport. I didn't mind, but it would have been nice to know that and not be surprised and confused after landing at LAS and wondering where the rental car co was.            \n\nPrice was quoted correctly, they do charge a $150 deposit, we're still waiting for it to be refunded. It's not just authorized, it's actually charged. The counter help was nice, George. \n\nWe had no problems until we left, I left my expensive sunglasses in a large case in the car; it was dark and there was no dome light in the car. We were rushed to catch the shuttle- I noticed my glasses were missing by the time were arrived at LAS. Luckily, we had time to catch more shuttles to return to Fox rental, where also luckily our car was still in the lot. Guess what? No glasses. We talked to the manager, who supposedly went and asked the car detailers, and they didn't have them. At this point we had to get on the shuttles AGAIN to catch our flight. The 1-800 number on the receipt is wrong- it doesn't connect anywhere. I googled and found another one, and had to call twice to get connected to a call center. After 3 passings around by operators, I got the HR office and left a message. \n2 days later (today) I received a call in the morning from HR who told me they didn't have them (duh). I'm certain a detailer took them. HR told me she'd call me back same day and didn't. \n\nI realize my mistake was misplacing them, but it's pretty obvious someone took them, and that disappoints me. Won't be using them next time we go to Vegas.\n\nETA: 10 days later and they never called me back. Lame.", "date": "2014-02-18", "cool": 0, "user_id": "Dyu93s1LuLbJPx4VOim8JA", "business_id": "e0CTLPxTnFEQSqQ1FJUqog", "stars": 1}, {"useful": 0, "funny": 1, "review_id": "_Hz1noOQ6GOeZ5DdHjko-A", "text": "This place is amazing.  \n\nAlgebra is the type of café that you often see in movies, but rarely in real life.  Owned and operated by an artist from Tripoli, the den's name is inspired by a combination of personal background and history (algebra has Muslim roots and is a universally recognized discipline).   I'm usually a germ freak, but I didn't even care that the place seemed less than spic-and-span.  The owner initially planned to focus on coffee, but we're all the richer for his decision to turn to tea, instead.  The Friday Night Market tea is my personal favorite.  Ask where he got the idea, and you'll understand its long and cumbersome title.  \n\nJust stop reading the reviews and get to Algebra.", "date": "2008-07-04", "cool": 1, "user_id": "AjYAaN1BYSRKwooe2i7QeA", "business_id": "9_0FtoabuC42T7AWDk5_sA", "stars": 4}, {"useful": 3, "funny": 0, "review_id": "5-2EyGDZA0y0vv9rb0YeOQ", "text": "I booked a microdermabrasion appointment which was done by a girl called Stephanie. I've had micros in the past and have to say that this one was honestly the best I've had. Stephanie, who seems to have been doing these for a while, did an awesome job taking her time by doing a thorough job. She even doubled back with a bonus round to get to my concern areas (which she spent time at the beginning asking me about).\n\nI was thoroughly satisfied with the service. I've had acne scars and sun spots for quite a while now which made my skin look so dull and tired looking. My skin looked noticeably better after the micro. The blemishes look more faded and my skin felt soft. The small black heads I had around my nose were noticeably diminished, and I had an instantly noticeable glow to my face that made my colleagues at work ask of I had done something different :) I had also had the luxurious Hibiscus facial which felt as if it had cleaned out every inch of my pores!\n\nThe store ambience is very chic and sophisticated and the private rooms are very clean and relaxing. The chair beds are comfortable. This place is relatively new and had some amazing promotions going on when I was there. With my micro they also gave me a skin care program to follow. I bought the organic Kabucha cleanser and skin toner and the Daylight Brightening Cream with SPF 50 (incredibly light on your skin). I'm totally loving these products and have seen results after only a few days. Finally I have a beauty regime that works!  \n\nI've already booked my next appointment and I would like to get my makeup done for an upcoming wedding. I also plan on getting the services as gifts for family and friends (especially great teacher gifts!). Sue is a very attentive owner and I will continue to entrust my beauty needs to this wonderful team!", "date": "2015-01-16", "cool": 2, "user_id": "y3AK06X2A1bj2VVtgzCdsg", "business_id": "WAy40TR86OYpU5nAcqCtEg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "JTtzapGlEeUrNHFLosg65g", "text": "Wow, crazy good pizza! I loved the pizza place that was here before but this place is wwwaayy better. Great service, great pizza, great salads and all in your control to make your own perfect pizza or salad.", "date": "2014-01-06", "cool": 0, "user_id": "zdRy3QGs6voWQ_z9UYLgpA", "business_id": "ghpFh6XpH1TYZhjAGdx-xw", "stars": 5}, {"useful": 9, "funny": 0, "review_id": "0W4evrnmTfxwOgv15rw5Mg", "text": "I wish I could give 0 stars.\n\nI placed an order for Overnight Print's \"Fat Business Cards\", which I've purchased before without issue. This time, however, the cards that were delivered were completely defective. I honestly can't believe the company would actually deliver such a low-quality product. I assumed my order must have somehow slipped through quality control, but after corresponding with a sales rep, it became apparent that the company simply didn't care. \n\nI provided photos of the cards I had received, showing that they were not at all close to the design I had submitted, or the proof I had approved. The cards were printed so unevenly, with borders completely crooked. The mistakes aren't even consistent - some cards are only slightly off or marginally crooked, while others are completely off. \n\n\nUnfortunately, I was told this horrible mis-printing was due to \"customer error\", and provided with a list of a dozen or so possible reasons the cards turned out this way. I'm a designer, and am not unfamiliar with file prep, printing and cutting margins, etc. My files were fine, and prepared using the template provided by OP itself. How could this possibly be \"customer error?\" Especially when the mistakes were all over the place. Furthermore, the proof I had approved before confirming the print job looked perfect - nothing like the delivered product. \n\nMy repeated, polite requests for a refund for eventually denied and OP failed to take any responsibility whatsoever for their unacceptable product and service. Needless to say, I won't be purchasing from them again.\n\nOvernight Prints - please do the professional and ethical thing, and issue me a refund.", "date": "2016-08-17", "cool": 0, "user_id": "arZho8RYAc83q7GFOe8NKw", "business_id": "3sI_seI268r85-uyOmEyEw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "SsPSo_Q1_tQeYnmev7ui-Q", "text": "First time here. The menu is pretty basic for a chinese resturant. I got peppered steak with pot stickers. Prices were good. Staff was not overly friendly but not rude or anything that really expresses great customer service. I would recommend. Especially if you like local businesses rather than panda. Soo good too. Fresh.", "date": "2015-10-29", "cool": 0, "user_id": "eUmNPp59nHbkk7qcCktGZw", "business_id": "9ibMbke1qYbmhJ2Qf3tWfA", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "GRUR7Hw4kbeDftsSuzahpA", "text": "I really want to like this place. I have always wanted to try Big Tuna ever since I first saw it. Today we finally got a chance to do so. Things were... not exactly how I wanted it to be, but it was not horrible. Please do better Big Tuna!!!\n\nLocation: The place was well hidden, if you are not from the area you are most likely to miss it. The inside was dark and poorly lit, not something a restaurant wants to be, better lightning attracts customers. Minimum decor, although nice but doesn't stand out or leave an impression. \n\nMenu: Quite simple with 4 signature dishes (or rather, bowls), and the option to customize your own. The menu isn't not over complicated and easy to navigate. \n\nFood: I tried the Tuna signature bowl (Hakata if my memory serves me right). Taste was alright but the tuna was not fresh, the after taste was a little fishy. I'm guessing because the display fridge or bar was not cold enough. My gf tried the salmon one which was okay. Rice is a bit dry disappointing. \n\nService: It was okay, nothing fancy, our guy was nice to us and attentive. thumps up!\n\nPlease pay attention to your fish and rice, they are your main characters.", "date": "2017-05-14", "cool": 0, "user_id": "BinbR0pqD7uBw9lqp5AdEg", "business_id": "Z3UBeP5EoKIXIDmEdA3JmQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "suvJ8EB-qBv5b33mvZihYQ", "text": "Spendy but delicious food! I highly recommend the Caesar salad and spicy a la vodka! Amazing!!", "date": "2017-06-04", "cool": 0, "user_id": "j-2WxQKIB-zuU3SA3z1oeQ", "business_id": "vZLAmpN-hTI3GCT9hlHVUA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "GwM_racUzs4VUfxilO3DVA", "text": "My favorite place to eat on my days off!! Highly recommend this place!! Customer service is great, fast service and the owners are really nice!! My favorite dish is number 1!!", "date": "2015-05-27", "cool": 0, "user_id": "LoSIzB4UcKypiYvdxmSJ_g", "business_id": "ufmokEGxGqEWIdvIVsNg_Q", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "9vNGICLz_NoOpMoXp1tJjg", "text": "After a devastating head-on collision I contacted Lerner & Rowe. From start to finish I received more than expected from a very professional staff. Sara my case manager, was superb! Always on top of details and quick to respond to all my needs. Our attorney Richard Hutchison fought hard to get me the maximum amount and never made a decision without ME. I see reviews complaining about the 1/3 cut, they all charge that except a few and you definitely get what you pay for. Don't hesitate, make ONE call...Lerner & Rowe.", "date": "2017-05-27", "cool": 0, "user_id": "zAxcrawpS4-H4M-EqTGg-A", "business_id": "V7-juhZ981P50PtIE-GSYg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "qvFEOktqV09J2M-BlFF08A", "text": "We went to Harlem on July 6th for Summerlicious Lunch.   This place has character, its comfortable, with a very cozy feel.  Great atmosphere, Great food. The service was great. The server was very engaging and genuinely nice and attentive. We had the Catfish sandwich and the vegetarian curry with coconut rice and for desert the Plaintain in brown sugar caramel sauce. (very delectable a definite must have). I would recommend this venue. It is a delightful experience", "date": "2014-07-10", "cool": 0, "user_id": "54YNjtJljvJujwR7ZfY2sg", "business_id": "Bo3dqwrjRbGFDf3S59HzDQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "cFpKfI4_W1G5uJXAEO6MwA", "text": "I am so happy there is a place like Phil & Sebastian at the Chinook mall now. What a great place to escape. Once you're inside it doesn't feel like you're at the mall at all. The coffee is lovely. I tried the grilled cheese and wasn't too impressed. It was good but not as good as it seemed like it should have been judging by the quality of everything else inside.", "date": "2010-12-06", "cool": 1, "user_id": "Uo-pgxV4JsiEwdSEVs4l2A", "business_id": "qAHjfQqGJFClh4wHpbzHSA", "stars": 4}, {"useful": 0, "funny": 1, "review_id": "tJwBdcJ0PISr4Xp6PNt4aA", "text": "My sister and I came to this target looking to price match an Apple Watch which target was giving out $100 gift cards after purchase. We went to check out and the lady checking us out told us \"my manager JUST told me when you price match, you forfeit the gift card\" we asked for a manager who then told us \"it is in the target policy\" I looked online and it didn't say anything about forfeiting gift cards or anything after price matching. Ilene and Maribel went in the back of guest services and tried to make something up about it being a part of their policy. It basically took us almost an hour and a half to get this purchase over with. This store did not know what they were talking about, couldn't cite anything from their store policy about forfeiting gift cards. I couldn't believe how many different associates and managers we talked to that would not honor what their policy states!! And for that we won't be coming back to this target", "date": "2015-12-14", "cool": 0, "user_id": "8DNeLxvAoBkLSEaFQTsNAQ", "business_id": "m39uJxr0wpVNCAChEoUp-Q", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "vcU703qwU8mH52U-aBHS6w", "text": "If I could give this Quiktrip 0 stars I would. This was hands down the worst experience I've ever had in a convenience store. There was nothing convenient about it. Quiktrip is supposed to be fast with phenomenal customer service. We paid for 4 bags of ice, and the entire freezer that holds ice was empty. We went back up to the register to ask for the key to get ice from the freezer outside, and the guy at the register stood there with a blank stare, so I had to explain there was no ice in the freezer. He was completely incompetent so I went to ask the guy that was busy making coffee for the poor lady that complained that there was no coffee in any of the coffee pots. He said he would go and make us 4 bags of ice. While we waited for this, I ordered a breakfast item at the QT kitchens, and it took forever for her to make, the dude that ordered after me got his way before me. The guy at the register didn't bother to stamp that I had paid for the breakfast, so why did I even pay! The food was disgusting by the time I got it and was able to actually eat it. I ended up giving it to my boyfriend who eats anything, and he wouldn't even eat it. According to him it tasted like craft singles and over cooked eggs stuck together in a cold tortilla. On top of that, a few bites into it, there was a big white animal hair in it. Needless to say there is now an uneaten burrito sitting next to me on our long trip up to our camping site. At least they couldn't screw up my Neuro water because it's pre packaged. The worst part of the whole experience was that none off the employees seemed to care or respond when I was loudly voicing my complaints.", "date": "2016-07-16", "cool": 0, "user_id": "Cem4mFVkmvwreatLuTB9hA", "business_id": "qVZxvjwmp-0Fn_7Mt6uNcQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "9jVv-YjcbE2vXColHwy6ig", "text": "Had a party of 30 on 6/27 and they were able to accommodate us as a normal reservation. Drinks and food were great! I had a bahama mama drink and was so tasty. Ordered the calypso pasta with shrimp and it was the best tasting shrimp pasta I've ever had even my 3 year old chowed it down. Thank you for your great hospitality and service.", "date": "2014-07-04", "cool": 0, "user_id": "bWqtEJdQij41y72F4K562g", "business_id": "DYuOxkW4DtlJsTHdxdXSlg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "MOo417FJWtNTHZG8jERF0Q", "text": "I just got home from the BEST lunch at workshop. A friend suggested it for a lunch catch up and wow, am I ever impressed! It was quite busy when we arrived but with a really fun, upbeat ambiance from the downtown lunch crowd. We were seated quickly and our very attentive server Brendan was right there to fill us in on the features for the day. Deciding what to have was the hardest part!!! Creative dishes, fun fusions and lots of local products featured on both the food and drink menus. My burger  was the bomb. As soon as it arrived the scent of smoked cheese wafted up and damn did it deliver! The soup of the day, potato goddess goodness with a dash of heaven was so on point I'm going to be dreaming of it until I convince someone to share that recipe with me. Oh and the bacon on the burger? CRISPY! Hel-lo! Nothing grinds my gears worse than bacon as flabby and tough as old aunt Mable's backside, but this bacon! Oh! Perfection..see ya later Mable, that sh*t is for Denny's. This was hands down one of the tastiest, most enjoyable lunches I've had with undoubtedly the best service I've had in a long time in Calgary. Thanks for making my birthday a great time! I can't wait to bring my husband back and try even more of your wicked delicious food!", "date": "2016-12-02", "cool": 0, "user_id": "0pno5p3tAT2c7jrQs1N_pg", "business_id": "EWj6tgNVl9x8Z7u9nnqdwQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "Wyovy-W-7kYpxfZoOWR4WQ", "text": "I eat here often for lunch. The sandwiches are great and they have lots to choose from. They also have a wide variety of chips as well. Overall, the food and service are good, so despite the frosty bag lady, I'll keep coming back.", "date": "2011-01-25", "cool": 0, "user_id": "SfcPuxXzAwYLxfDvSmlYHw", "business_id": "uGCct-R33OXz53igyKjejQ", "stars": 4}, {"useful": 1, "funny": 1, "review_id": "mo2R_gzE-FvflaXa6A2GNg", "text": "So I just returned from Bordeaux, France and Venice,  Italy.  I've been living here in Fountain Hills and eating at Senior Taco for over 10 years.  It's finally time to write this review.  Senior Taco is my go to comfort Mexican place when I get home from my travels.  I can honestly say this is better than much of the food I had this past week in Europe.  And we ate at some very expensive and nice restaurants.  Okay I didn't have Mexican food there but in terms of quality and the flavors that are in this food.... Senior Taco For The Win!!!  From the enchiladas to the burritos and tacos everything is bursting with flavor.  The salsas are to die for (especially the roasted chili oil.)  The portions are huge and I almost always finish what I order.  Do you know why...?  Go to senior taco, order anything and you will understand.  This place simply ROCKS!!  OH,  and the Margaritas are pretty good too.  Mucho Bueno!!  I don't hand out 5stars easily.", "date": "2015-09-26", "cool": 1, "user_id": "dcWAMo7Pdx-jmA1poFiQzw", "business_id": "i2YFMkIMqstA9GxUkcigYw", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "np6yWtUMBhL3q1AacRt6AA", "text": "First off.  Let me start by saying that I have a lot of bubble tea at various places. \n\nToday. We were at vaughan mills and just had their bubble tea. \n\nThe first one we ordered was a milk tea and was very bland.  \n\nThey were very nice when we brought up our concerns and replaced it with a green tea tapioca. \n\nUnfortunately. That was also oversweetened and bland.  The tapioca was a bit undercooked.  \n\nI am  giving them 3 stars because they offered a hassle free exchange and seemed friendly.  I would want them to do well and I am sure they do since they are in a high traffic mall.   \n\nBut honestly. Unless this is an off day. Their tea is not very good quality at all. For a $6 drink. I do expect more than I would from a Tim horton a coffee. \n\nYou can try it yourself and decide.  \n\nIf the owners do read these reviews. I encourage them to try their own drinks as well as those of their competitors. \n\nI would be happy to revise this review if something changes but at this time. I have no immediate plans to return.", "date": "2014-08-10", "cool": 0, "user_id": "bUWhSzhCYqX4F4spLZlENA", "business_id": "bfN43ndShI7rdgXtWuv7EA", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "Dg2btV1cr-xmY_zSpU2NqQ", "text": "I used a groupon and got a great deal on exam. They just moved to their new office. Everyone was great. I didn't have to wait the Dr. was very thorough. The staff was helpful and friendly. I am glad I did not read the other reviews before I went because I had a great experience. I wasn't surprised about having to buy a years worth of contacts to get the 50.00 off.  To me that was a given. I will recommend them to everyone.", "date": "2014-10-15", "cool": 0, "user_id": "hWS8bkCrtHOJZTZaLnS5kQ", "business_id": "nIkFUpsAYRMftiFi4lL5jQ", "stars": 5}, {"useful": 1, "funny": 1, "review_id": "ij7d0WE5sQkqLJinVvSddw", "text": "The slow-cooked lamb is killer.", "date": "2012-12-18", "cool": 1, "user_id": "Wcnb8pypRNaO8zO4B7d-Gg", "business_id": "eGTAC8EzcHiYnnZ52tijiQ", "stars": 5}, {"useful": 3, "funny": 0, "review_id": "DUObGCC9Ey9zqfcceyRU2g", "text": "Bunny spice smoothie delicious! Almond milk, carrot juice, ginger, cinnamon, raw honey. Yum. This was my first of a million visits I'm sure.", "date": "2014-04-03", "cool": 0, "user_id": "i6DM6TgxDxQSSDU_4sQ7ZQ", "business_id": "4CdqGdbYBjRCyvUDx7ppYQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "v0GVI3N79FjWNwJknkVJ_A", "text": "Aw damn, this place was amazing. If you aren't upgrading your chips to Belgian Fries, you are a chump! Live it up! The sophomoric IPA with the Green Chile Pulled Pork sandwich was like eating a dream. Love this place!", "date": "2014-12-17", "cool": 0, "user_id": "7SvHtyh0GQISQBykLA37vg", "business_id": "sJNcipFYElitBrtiJx0ezQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "ayRzMxdUBoiFUyr3ALhvrA", "text": "Excellent, j'ai hâte d'y retourner. La bouffe d'excellente qualité, du très bon goût et le prix est correct. Le local est trés bien aménagé et super propre. Á recommander. Je vous recommande la Carne asada.", "date": "2014-05-10", "cool": 0, "user_id": "_QHErHnCNm7UF35U3dN1eg", "business_id": "CtubIIhmRzFB6-egzxin9A", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "FMcgDgef4dlAvmxdqS7Mwg", "text": "My favorite place in Charlotte to stop in for dessert. The cupcakes are amazing and well priced. They usually have a seasonal flavor so there are always new options. The gelato is really good as well and I love that you can get a mini cup, perfect size. Bar cocoa introduced me to macaroons, so many flavors to try!", "date": "2015-11-08", "cool": 0, "user_id": "J2yA2I8Ax3dmmH-EJ9euyg", "business_id": "uNdSh3tpvbkxWj-xLoEzvQ", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "C_nfEmsdTIL7YP4oayVZjg", "text": "Very disappointing. \nWe had our meal delivered to our hotel room. While delivery was fairly speedy from Hurrier, when we opened our meal we were sadly disappointed. We paid over $100 for 3 entrees and 3 deserts. The pasta was bland and lacking any sauce and the portions were small. There was no cutlery or napkins In the bag. The pink velvet cake was the smallest piece of cake I've ever received in a restaurant and it was basically carrot cake with pink icing. The caramel cheese cake was stale on the edges. Would never order from Insomnia again!", "date": "2015-06-24", "cool": 0, "user_id": "eZnhh5XITd7R9GbV0amCtA", "business_id": "e41TP5cXZqSrz50xCBJqZw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "nhQvL_vrP7Ub7Cj0-kPs3A", "text": "Great products , excellent customer service & fast turn around. I will definitely be using Show & Tell in the future for my business. Thanks.", "date": "2015-03-23", "cool": 0, "user_id": "9SjHjPj1EuGHReCfpI_Avg", "business_id": "E2eZhVfICDQtA5zpgEFJ0g", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "0qDYrnqG2hEHMyKxXlv8YQ", "text": "It was a very nice looking place , the staff were fantastic , the food was good , however I did think for the price the food was not great. We had jalapeños on our pizza and they were pickled and the vinegar was over powering the rest of the pizza flavours. I wouldn't recommend there is better pizza cheaper.", "date": "2015-06-16", "cool": 0, "user_id": "1xVnrt9npuOi96lXPPj6eA", "business_id": "F1PMcEIg-FHZvwhiUoFEgw", "stars": 3}, {"useful": 1, "funny": 0, "review_id": "dCMzPadtt1lt2Wi9MuBbFg", "text": "So I have returned to NMB several times since my review.  Things are getting better and I'm realizing that it's better to drink mediocre craft beer than drink mass produced beer found in most bars in Phoenix. \n\nWas there over the weekend with other people that had been to NMB previously as well.  The pretzel bread is quickly turning into a favorite for all of us.  \n\nI've been to brew pubs all over the country and one thing that NMB needs to do is have 3-4 of their best beers on tap at all time.  Then rotate another 3 or so seasonal beers.  Couple of people in my group were hoping to grab a beer that wasn't on tap. \n\nAlso guessing that good help is hard to find.  On one trip to NMB I went right after work, which at most places is when it starts to get busy.  The bartender did check on all of us before taking off for 5 minutes for a smoke.  In those 5 minutes a few other people showed up to the bar and had to wait until the bartender came back.  If it's close to 6 PM your bar should be staffed.  Noticed that your employees like to use their cell phones while working.  Had to wait for another employee while they finished up a phone call.  \n\nBut will keep going back, it's a nice little spot in a part of town that could use a good bar.", "date": "2013-05-14", "cool": 0, "user_id": "efkItVrcK5TG0aaePJTT7w", "business_id": "QzrtN3EjGp-kSCzg8uj1oA", "stars": 3}, {"useful": 0, "funny": 1, "review_id": "dAMHRVDysbNTXLEzUSpv3g", "text": "The closest you'll come to actual Boston Pizza on the West Coast. I would have given it more stars however the quality is variable. Sometimes you get a perfect Pizza sometimes you get not so great pizza.", "date": "2016-11-28", "cool": 0, "user_id": "CbdasTsuaHjg84OZy80ngA", "business_id": "2bK1ng2mnRdtTh_BDNGmIg", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "-3Tri9I1fj8HBs1JUh4igw", "text": "Stayed her for just one night and will not be staying again.\n\nShowed up and pulled into valet only to have the valet guy tells us that valet was full and we had to self park. Really? I have never heard of this at any hotel ever. Well self parking was a parking structure for the miracle mile shops. Lugging our bags through the parking structure and then through the miracle mile shops is not how i prefer to start my vacation. \n\nWe get to the room and its not bad. A few cabinets were broken but it had a fridge which is a plus. Go to make a drink while we are getting ready and try to find the ice machine on our floor. Problem was there is no ice machine on our floor. Matter of fact there wasn't an ice machine on any floor except the 5th. I would have never known this unless some guy saw me wandering around holding the bucket. He had already spent 20 mins trying to find it and was nice enough to let me know. \n\nThe bathroom door was a sliding door. Well it was broken or off the track so there was always a 2 inch gap when you tried to close it. Not great when you are trying to use the restroom. The bathroom itself was way too small.\n\nOverall its a cheap place to stay and you usually get what you pay for. Would have liked to have read this prior to going.", "date": "2013-01-19", "cool": 0, "user_id": "o6CAQuriFX8mE860ewVlRQ", "business_id": "vnvQ0lD9MDje2DFde9PKQA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "wklO62oX8YjdQZGnfMrASA", "text": "It's morning and the leftover still taste amazing. We ordered the standard butter, taste great and not like your normal butter chicken. We also ordered the chicken korma which had a nice fresh tasty sauce. Even the naans were fluffy and flavorful. Would love to go back again.", "date": "2011-04-17", "cool": 0, "user_id": "NJO14trBrfXWBzch9cjD1Q", "business_id": "cFzrkYqtFvae7vaZSYMdWg", "stars": 5}, {"useful": 3, "funny": 2, "review_id": "EDZIUK6sKzioLEAp2Tewtw", "text": "Great Chinese food, only place I go to in Pickering.", "date": "2009-12-20", "cool": 2, "user_id": "NJO14trBrfXWBzch9cjD1Q", "business_id": "xfeQtCCNsGhay7Z8poHTpg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "OA0qaDotk5Zb_7x4y92u7A", "text": "This place was rated number 1 for wings...and it is very true! Lots of delicious flavors. The other food is great here as well, I usually get wings but the burgers and sandwiches are also great. The service is usually pretty good, it really depends on who is working. They have a few tables outside for outdoor seating, but nothing spectacular.", "date": "2016-07-14", "cool": 0, "user_id": "MCgv010Kx4-Pe3nq7yfCbw", "business_id": "dPWHFb_sDduzcJdOZSqR5Q", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "1r5FjIWi_CIR2QwjVOgdrQ", "text": "Excellent food, great service, good drinks, clean and inviting atmosphere. \n\nSoft pretzel w/cheese and mustard was very good. Above average for bar food appetizer. Crab cake was light, fresh and good portioned.\n\nMy husband had the fish & chips and the fish was one huge fillet, lightly battered, fresh and flakey. But the house made tarter sauce was the belle of this ball. It was tangy but sweet, and hit all the right notes with the fresh fried fish.\n\nI had the chicken caprese sandwich and side house salad. Portions were good and while the salad was nothing to write home about, the seasoned chicken, fresh mozzarella, and ripe tomato on the sandwich made up for it. Yum yum yum!\n\nOur server received a nice big tip for constant (but not overly) attentive service and regularly refilled mimosas.\n\nWhen visiting downtown Phoenix make this a stop on your agenda.", "date": "2016-10-06", "cool": 1, "user_id": "aSkMRwyzJea2cB8t3jSZ3g", "business_id": "NgDyxaeItFSInv7J5paGLQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "eZJ4F18V0qGEXEzJS1youw", "text": "If you are looking for amazing personalized service with attention to detail with fair prices this is your place! We have been getting our clothes dry cleaned here for a while and the manager, Chuck, is the nicest. I recently worked with their alterations lady, Kathy, and she is beyond exceptional. She came to my home and tailored 19 items for me. Each one is spectacular and looks like a whole new garment. Where can you find anything like this these days where someone wonderful and trustworthy will come to your home, alter your clothes, and then have them ready for pick up for you just a few days later. If you need anything done, Tide Dry Cleaners is the place to go!", "date": "2016-07-13", "cool": 0, "user_id": "PlDagO3uO73Wl4WZYUljUw", "business_id": "hOUyFgDBeUKCbckhV6vl2Q", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "rEbfIkCX0OKH4aiCUY64aA", "text": "I think the only outstanding thing on the menu is the picante pizza. The service here is slow and it takes very long to get your drink, let alone your food and this is during slow hours. This place is just overhyped and overpriced.", "date": "2017-07-23", "cool": 0, "user_id": "DWWGVrfA5Zsbv4fd8bKKLQ", "business_id": "2sx52lDoiEtef7xgPCaoBw", "stars": 3}, {"useful": 2, "funny": 1, "review_id": "_HXSMxUMKrTafbp2bRBu1A", "text": "I can't think of any place I'd recommend more in Old Town.  I've only had the falafel, but it's wonderful enough to recommend the entire restaurant.  The staff is friendly, and service is pretty quick.  I prefer a carry out or alfresco dining, as sometimes they overdo the cleaning chemicals in the inside seating area.   The area is a vast wasteland of tourist trap shops and crap food, so lets just say this place is an oasis of sorts.", "date": "2010-03-21", "cool": 1, "user_id": "p6ciuugLXnwkZGq6jWlibA", "business_id": "Xgk-d2x59qhPxOsuCKeShw", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "5wndmgqq0cPvP326HN51jw", "text": "This place is great ! Goat roti is the way to go !! I'd say sometime the dish plate rice is a bit mushy and obviously microwaved but doesn't matter add more pumpkin hot sauce and you are on !\n\nHe should seriously market his pumpkin hot sauce, it's insanely good spicy and tasty !", "date": "2016-09-01", "cool": 0, "user_id": "dsPRK5K35aOYdnbdxc-8SA", "business_id": "GeOmt2gXyJhKwz-cjOC5mg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "mYJ0UJMTSB6tk76ZFiFwSA", "text": "really great lil hole in the wall Mexican food. the chilaquiles are awesome. careful tho if you don't like super spicy, cause they can make them hot! flautas are also delish. oh, and the micheladas are a must! awesome service, very friendly staff", "date": "2017-09-03", "cool": 0, "user_id": "yrcFQHdIcrPGV3DjSVPNqQ", "business_id": "DaVTuhzi6EgWStb2eAjNjA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "peIpb9UkQWnGhGC8Z7mPHQ", "text": "Came here on a Sunday after working out at 24-hour.  Must have been early enough (around 1030AM), as we were seated right away.\n\nCoffee was good, food was good.  We got a small stack of the grain pancakes, which was actually a pretty big stack.  They were good, but nothing to write home about.  Also got an omlete with cheese, bacon, and avocado.  Minimal avocado, tons of bacon and cheese.  After working out, would have preferred the reverse.  It was tasty though and came with a heaping side of cottage cheese and tomoatos.  Food tasted as expected.\n\nService was ok.  Not too spot on for a Sunday, which one would think would be the prime breakfast day.  Cost was around $20 for above mentioned food and 2 coffees.  Wish I would've ordered that cinnamon roll in a mug- looks divine!\n\nThe crowd must come around 11AM, as there were 4 or 5 parties waiting for a table.", "date": "2011-03-02", "cool": 1, "user_id": "LR9E4bHOHnYnjLnUGYOV8A", "business_id": "DbEszO3wk1xVmN3pCPob2g", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "G8EihdVzIUERE4wojV4u0Q", "text": "I couldn't get my year-old Surface 3 to get out of its endless blue screen/re-start loop. But, Jeremy was able to reload the OS and get it up and running again. 24-hours from drop off to pick up repaired computer. Reasonable price.", "date": "2017-09-25", "cool": 0, "user_id": "YSyU5qhnHFblFOVxs3FCMg", "business_id": "3oz6T_UXSNczRa0uCeRpng", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "ugvccE_ZVScfdnQNvEKRlQ", "text": "I come to Arizona a few times a year and within each visit we need to come to Wildflower Bread Company. I am always pleased with the customer service, during my last visit I met Edwina. She recommended breakfast items and kept pleasant conversation going.  I didn't feel rushed especially at 7 in the morning, she was very upbeat and knowledgeable on the menu offerings. My wife and I were very pleased with the Bacon and Egg Sandwich and the Banana Walnut Pancakes, we will return. Great job on staffing Wildflower!", "date": "2015-01-11", "cool": 0, "user_id": "Y-LKp589yWYIsc6VITwubA", "business_id": "Q0EZmATxDphzRMszNV2LVg", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "JI0lY-vw__PNASUJ7rx39w", "text": "Blossom has been the best to work with. Their office is so efficient and their staff are caring and knowledgeable. Dr. Apel took the time to answer all my questions, walked through the procedure with me and was straight forward.  I had a hernia repair on top of the sleeve and have had excellent care.  I would highly recommend blossom to anyone considering weight loss surgery.", "date": "2017-05-01", "cool": 0, "user_id": "APv69cE4WFcULbG6Y6D8qw", "business_id": "g7i_j8wXsD0XKsNA60eu_Q", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "AVWJNKQ4Sd3BhITPlxLDeA", "text": "This is my 2nd time staying here. The 1st time was during the week & we got a huge upgrade to a penthouse suite for only paying $45. It was only my son & I so we had more than enough room.\n\nThis trip was a main event weekend & the prices were outrageous. There were 4 of us in a tiny room with a view of the strip. My 1st complaint is that we paid an extra $20 for an upgrade & by the looks of the room it did not appear to be an upgrade. Maybe we paid for the view of the strip so that was ok.\n\nHere's where it was not ok. We were on the 27th floor & we could hear the sound of the nighclubs below until 5:00 am. We even had earplugs & we could still hear it.\n\nIf I stay there again I would ask for the pool view as it appears to be quieter.", "date": "2015-05-09", "cool": 0, "user_id": "LoTj1vS41ifdRPlXcS-URg", "business_id": "u_vPjx925UPEG9DFOAAvFQ", "stars": 3}, {"useful": 2, "funny": 0, "review_id": "o0HtsnaHCDAe6Djg8guRXw", "text": "Let me start this by saying that I am mexican. And my taste buds are not even close to being gringofied. \n\nI love this place! I probably wouldn't of gone except it's so incredibly close to home. I don't frequent mexican joints because I am always disappointed. But not at Asada! \n\nI have been there a few times, and have tried quite a bit of the menu. Everything has been great. My favorites are the amazing home cooked style pozole (best hangover cure EVER!) and the cochinita pibil. \n\nThe salsa bar is the best in town (after my own, of course)! The only thing that's missing is pepinos & rábanos & cebollitas.... \n\nCan't wait to go back!\n\nOh, I almost forgot to mention, the staff is the best staff I have ever encountered in TO! Friendly, great attitude, and always looking to make your experience even better! Great job, guys! You make the neighbors and the mexicans proud!", "date": "2013-07-07", "cool": 1, "user_id": "WvklcMctTKgRPonBDYKXPQ", "business_id": "sPPh1LJllyr5jUpKFTxxag", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "XWlLLEphe2gi7V4Tco5Dgw", "text": "We were lucky enough to win a pet door from Hale Pet Doors after entering a raffle at the Las Vegas Pet Expo.  Eddie came out to install our door and he did a great job.  The door is awesome, Eddie was friendly and did a quick, clean job.\n\nI would absolutely recommend Purrfect Pet Doors to all my friends.", "date": "2014-04-05", "cool": 0, "user_id": "wUdZSR8XMGfeNYI0vWZliQ", "business_id": "ak0_aSHZEPdRkpAAtyzrAw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Yf28UZwTustFiDC7c-Ef8g", "text": "Rather than detail each item served lets just say they had a bad day as the service was slow and not very friendly or accurate with our orders and what was served was very poor at best. I might try again as I know they can do better from others I have been to. Everyone has a bad day once in a while. Sorry!", "date": "2011-12-19", "cool": 1, "user_id": "F_QTQSgUS2Tzb3SVE-qadA", "business_id": "f6mQYyU_ga0DVRuRZhkmfQ", "stars": 2}, {"useful": 5, "funny": 0, "review_id": "AcsdVPJGauzfiwdacshRNw", "text": "TNG is by far the most reputable agency in town. They make a point to over communicate everything to you, which makes me feel respected as their talent. Additionally, they pay you ON TIME. Which is hard to come by in this town. If, for whatever reason, your check is delayed, they keep you informed and updated instead of ignoring you. The jobs are quality and respectable. They push for better rates. They are very receptive to any issues that may arise on a job, and make sure to take care of you. And they are fast at getting back to you with any questions. A great and well rounded team.", "date": "2015-06-23", "cool": 1, "user_id": "1jom48nM65FNEWO-fZ0boQ", "business_id": "OgKEgvZ8b8bcBzTRhvLPHQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "0f2tNvMo0HF9PbUZkw_2dQ", "text": "Amazing service! Two new air conditioners on my roof already blowing cold air. \n\nI needed to replace (2) old air conditioners for the home I just bought. The old a/c's were in terrible shape. They were using a lot of electricity and could not keep the house cool. I wanted to get new Seer 14 energy efficient air conditioners.\n\nI scheduled Air Supply to replace the A/C's. The guys started unhooking my old A/C's at 9am, had the crane lift the new A'C's into place at 11am and the job was complete at 12:30pm.\n\nThanks for such great service! I 100% recommend Air Supply.", "date": "2017-07-26", "cool": 0, "user_id": "BK6zJdHVvHxPC22THQqIFw", "business_id": "ViwjR6a_0Ytbk7MUnK19ag", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "H4h6Y7W61Apx0tcauY8NOQ", "text": "A group of us are in AZ for business and we tried to come here for dinner after work. They wouldn't let a coworker with a valid out of state license (who was 26 and a non-drinker) in citing an Arizona law that anyone with an Under 21 ID can't come in. It's a nonsense law but the law is the law, until we saw a family with multiple small children be let in behind us. We inquired with the manager who said yes, children are in fact allowed in. Apparently you cannot be a legal adult with valid identification who is not planning on drinking and get into the restaurant, but you can be a small underage child and waltz right in with the welcome mat rolled out. \n\nThe food was pretty good when we went the previous week (yes, our coworker who wasn't let in had no problem walking inside last week), but the beer was nothing special though I wouldn't be surprised if it was the best around the area. \n\nIf it weren't for the nonsensical and inconsistent policy that doesn't make a luck of logical sense that resulted in us scrambling to communicate with the rest of out party to change plans last minute it would have received a three and a half star rating.", "date": "2015-04-15", "cool": 0, "user_id": "SwHt6FwVKpbIvlw-yHaGtg", "business_id": "JzOp695tclcNCNMuBl7oxA", "stars": 2}, {"useful": 5, "funny": 0, "review_id": "9FKd6JStvuIH6WSYRDUNsw", "text": "Do not go here. Pay a bit more and avoid this place. I should have relied on what I read about this place. I could go on and on, just take my word for it. I contacted the Scottsdale store they were helpful. Stay away from the Tempe store!!", "date": "2013-09-26", "cool": 0, "user_id": "SMiKMqAz3O-3zAXqcBoJXg", "business_id": "3a9k2JOlNyOE3GKwwZwfng", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "M3vwiAF1Mamw1o2ZnIuFiw", "text": "I purchased my 2016 Nissan Versa Note Sv about two months ago after my car died. My dad, who likes to deal with things automotive, did some scouting of dealerships. Being that it was my first official car purchase that I would have to finance I was pretty set on a few things. I wanted a 2013+ hatchback that was more economical than flashy and around 10,000 and wasn't silver (I know the second part is little ridiculous, but really didn't want a silver car). The other dealerships were quoting me above 10,000 for 2013 hatchbacks with 70,000+ miles on them. Things were looking bleak but after my dad went here he said they had exactly what I was looking for! He said I would most likely like the Nissan or the Chevys they had on the lot both were non-silver 2016 hatchbacks that were right around 35,000 miles at 9,000. My jaw dropped because both cars were in great shape and they had so many options! When I arrived we were greeted right away! All the salesmen were professional, knowledable and treated me with the utmost respect. My dad and I had a plan for me to finance through my bank but we didn't realize they didn't accept cash or credit card so we fumbled around like a couple of amateurs but ultimately decided to have Hertz finance it. We ended up staying late because there was an accident that happened on the lot but the salesmen despite them probably wanting to go home showed no signs of rushing or trying to cut corners. They gave us great service from start to finish! I ended up purchasing my Nissan there with the extended insurance. I loved their no haggle prices (even tho dad is a haggler, sorry guys) because it made things quick and easy for me. The following month I recommended this place to my friend who was in a car accident and needed a car! She too purchased her vehicle here (Sonata) within a two day time span! She had the same great experience here! I was so stressed and a big ball of emotions when my car died and the thought of having a new car loan and having to go deal with buying a car made everything worst! But after coming here I can't say enough about how positive the overall process was!  I'm VERY, VERY happy with my car!", "date": "2017-12-06", "cool": 0, "user_id": "FDMgnBdsCNtkfVK1qlWL-Q", "business_id": "OaixH8w5O_-CdTAPgfNuvg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "IKVhBZxBfxnspMP3vltt1A", "text": "I come in here quiet often and it's amazing! The first time I came in here Daniel M was our server and he has been ever since. We make sure to ask for him each time we come here. He's absolutely amazing. However, tonight when we came in, and we asked to be seated in his section and the host replied \"sorry, he has no open tables in his section.\" So we're like like okay, we'll just wait until something comes available. And she looks at us and says \"okay, goodbye. Have a good night.\" With a snooty attitude. She didn't want to take our name down and let us wait, she just turned us away. And what's worse was there was a MANAGER standing next to her and he doesn't say anything. This place is very poorly staffed (hosts) and poorly managed. Every experience I've had with a manager here isn't very good.", "date": "2016-07-30", "cool": 0, "user_id": "mET9D3Kk0k2sWxslVGKPBw", "business_id": "UTXNr62dGSK-tet8OeXUcQ", "stars": 1}, {"useful": 1, "funny": 4, "review_id": "UhRIUvdakY7lpPRwjinzGA", "text": "I really liked this place until I came back the next day for repair and they took 5 customers ahead of me and made me wait. I waited 30-45 minutes before i just walked out. not only was it an inconveniemce for me to have to return for repair but i I paid $60 for my original service and I didn't notice the nail tech messed up my big and 3rd toe until I got home. I politely walked out and said \"I'll come back\" but decided the character of the owners spoke for itself. A customer is a customer and my time is as valuable as anyone else's. I will not be returning!!! This place has nice staff but they need a course in professionalism. There are millions of nails places in the area there is one in south end and also easy blvd that I like plus there are 2 polished nail bars both less than 10 minutes from here.... I don't have to be treated like a 2nd class citizen.", "date": "2013-07-21", "cool": 1, "user_id": "8fpIYnamGlh_gzcFQ5VVCQ", "business_id": "2N6geaTHR3g7RW-V23FNOQ", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "1FFNyt3QiVK7leZU5GDh2g", "text": "Perhaps the finest dining experience in the South West. Simple, refined, highest quality and taste, the Greek salad, octopus, seafood and lamb chops. Huge selection of wines. Did I mention fresh seafood is flown in daily?!. The ambiance is spectacular, matched by the service. Management is clearly focused on providing a superior guest experience. Bravo!", "date": "2016-10-29", "cool": 2, "user_id": "U5KGe58iJhZZLmCfdk_jVQ", "business_id": "YRyYbOSwvHkZsZOLv98oQg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "2ogjP7vHIfWz6DCzN96_uA", "text": "Great korean BBQ. I've been here twice and the service is always fast. Servers are all nice, modern feel vibe-place. Food is awesome too. They have a good ventilator so you wont have that bbq sticky smell on your clothes.", "date": "2017-07-20", "cool": 0, "user_id": "IwBtyddRUMIGPM7PqeUBWg", "business_id": "TW58a4UkMcksdfQ7znUqsA", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "8BVN27TcBBb31JuMFjZI1A", "text": "Found her on groupon. I wish I read the yelp reviews before booking. I asked for a short haircut with lots of layers but she didnt do it well. I had to go to another salon to fix my hair. If you want a simple cut maybe you'll like her. It was a waste of money.", "date": "2017-07-20", "cool": 0, "user_id": "IwBtyddRUMIGPM7PqeUBWg", "business_id": "9SkCjP0DtYCxO-DiYLuCFA", "stars": 1}, {"useful": 2, "funny": 0, "review_id": "2OUudndk2ZRVj06bYcrjmw", "text": "This place is just plain expensive.  Their ammo is too expensive; I will just go to aimsurplus.com and get a better deal WITH shipping!  Also their silver was way over-priced.  90% junk silver for 28x face value when its true value is less than 25x face value.  Cool store to window shop in, I just wouldn't blow my money there...", "date": "2012-07-20", "cool": 0, "user_id": "SB6WZI5iCB4zjXjDED01kA", "business_id": "1V7IrugU7E7jSg-E8COE0A", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "re_OqdmxmvncXKHzPF5rKg", "text": "This place is refreshing. \nI'm not into chains, mass-produced, pre-packaged food, which unfortunately Phoenix seems to be full of. \nI'm so happy to have discovered this spot (through Instagram nonetheless). \nThe menu was overwhelming in a good way, so the cashier helped me out with my order and was patient answering questions. (Although she didn't know what savory meant?)\nSometimes when the point of sale is a cashier it can seem like you're on your own once you get your food. But they grabbed hot sauce for me and cleared the table, all while checkin in and striking up conversation. So great. \n\nLove this spot, and will definitely recommend to other flight attendants on layovers!", "date": "2014-11-20", "cool": 0, "user_id": "4exKa-h8kDD9LrdXo_AeeA", "business_id": "N5B7OBTyNGgwU_Y2fwNcyw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "du-xmtIatvobxxX-KJTIYg", "text": "My dog has been a patient of Dr Buzard for the last 3 years.  She always takes her time with us in the office and even does research on her own time for different treatments for my dog.  She has been amazing!  I would definitely recommend her to anyone looking for a caring, compassionate doctor!", "date": "2017-11-09", "cool": 0, "user_id": "kPRSzV8mvq_2UGyk_hvoHg", "business_id": "fKptSxrXArHLnH_lfxE_lQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "7hgoX5TNPN68dXVeM-sDuQ", "text": "Promt and  courteous. Excellent service. Explained everything well. Extra work was required and also explained the issues.  Would highly recommend.", "date": "2016-12-24", "cool": 0, "user_id": "M4sx-01O7t3En3XUuEx9pA", "business_id": "1_fKz8LMENf_ytqRKET1Cw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Qvylv57TLsE3eWRH1pfSfA", "text": "Me and my boyfriend go here pretty much every weekend on Sunday for breakfast because it's right across the street. This place is old school. It's like it got stuck in the 70s and never updated anything. The service is always great. CHEAP prices. The food comes out really fast and is always good. The only change I would make is to update the building somewhat and clean a little more and thoroughly. Overall though love this place- just don't expect anything fancy or modern.", "date": "2016-03-12", "cool": 0, "user_id": "aIzGPXyh-2P0vc21qM8TAA", "business_id": "PHUcMHrbDKAmKxsqT2cewg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "aSOnxWGhoc9EYFQUulBBMg", "text": "Had the seared Mahi sandwich and it was amazing. Great beers and ambiance. Had to come back two days in a row.", "date": "2015-08-28", "cool": 0, "user_id": "vx14gRBGir3tixdZ0YMkxQ", "business_id": "RtnTbhWYw4QjKhoTBV37OA", "stars": 5}]