[{"text": "One of the best breakfast places I've been to! The menu had so many options, above & beyond your typical breakfast choices. Portions were HUGE and everything was delicious & so fresh! Will definitely be back & highly recommend!", "cool": 0, "date": "2017-06-28", "funny": 0, "review_id": "P7kiSTiwzqm0_LbA71EOPg", "business_id": "-bd4BQcl1ekgo7avaFngIw", "stars": 5, "user_id": "5ngpW5tf3ep680eG1HxHzA", "useful": 0}, {"text": "Laser maze is a blast for the kids, check Groupon for deals so you don't break the bank.\n\nLove the sitting area outside, great for waiting parents when the weather is cool and breezy.\n\nBummer that you can't even bring water for a birthday party, it's $0.99 per additional 8oz bottle, but it beats the $1.25 pouch of Carpi Sun.  My kids love ice cream but we couldn't bring an ice cream cake either.  Loosen up, allow us to bring water (this is AZ) and our own cakes for the parties.", "cool": 0, "date": "2016-05-01", "funny": 0, "review_id": "IRw-bVzY_9ASqmeDLzXPig", "business_id": "brVIRXT4AubkUbe6P-NAAA", "stars": 3, "user_id": "0pf5VuzE4_1pwj5NJHG5TQ", "useful": 3}, {"text": "Horrible. The smart ones have closed their account. Tellers don't know how to read a day drop envelope that clearly reads MORTGAGE PAYMENT in front and back with the full loan number on it. Money was sitting in the account and in the meantime my mortgage was late. This has happened 4 times. 4 TIMES. \n\nManager doesn't take accountability for the lack of attention to detail of his staff or their errors.  Tried to blame me because they didnt believe I put anything on the envelope. Account numbers and account holder names sitting all over Christopher the teller's desk. People wonder why your accounts are compromised? Manager saw it and did nothing. \n\nBe smart take you money out and run.", "cool": 0, "date": "2016-05-28", "funny": 0, "review_id": "SLA1YP9doUc8h-6Kd34QmA", "business_id": "yz3KtngrF2PQrif8JW7gdw", "stars": 1, "user_id": "0pf5VuzE4_1pwj5NJHG5TQ", "useful": 1}, {"text": "It great fast food and get large portions. It seem to be fresh and the server are friendly. I gone there many time and it alway good. I like their burritos usually it so big can only eat half and save the rest. I am recommending it to all my friends. You can choose what you want with any of the items on the menu.", "cool": 0, "date": "2016-02-29", "funny": 0, "review_id": "htV6dNmUqaXwCIRt7vfO5A", "business_id": "7KkgMcbVaetryW1wwpzvvA", "stars": 4, "user_id": "dQzQ4bN0Rnb8M-0LqTl3-g", "useful": 0}, {"text": "Great place to watch a game.  On Sundays they have a make-your-own Bloody Mary bar which is outstanding.  They are also cheap-- $4 (I think) and also have a Mimosa special.  \n\nI have not eaten a meal here.  I have had the pimento cheese dip (which was an awful consistency-- think not-all-the-way melted Velveeta), I have seen the wings, and had a various assortment of fried bar food.  It was all fine.  My friends thought the burger was delicious-- both were suffering from the liquor flu so I am not trusting their judgment 100%.\n\nThe service here has never been good.  \n\nThe location works.  The back patio is fun (has its own bar) and the Bloody Mary bar is fun.  This is a place to go and drink, not go to eat.  And don't be surprised if you have to get your own drink from the bar because your server is no where to be found.\n\nMaybe I am just disgruntled.  I miss the Press box being here...", "cool": 0, "date": "2013-01-15", "funny": 0, "review_id": "jCCOxXAfgyX1Vdx_R6UBhQ", "business_id": "Daasejc2-RV-MxEKpPjXtA", "stars": 3, "user_id": "OQT9DjfBrzrwOEdVJjuYIA", "useful": 0}, {"text": "This is absolutely the best garage door company in the west valley. They are on-time for their appointments, and a pleasure to work with. The thing that I really appreciate, is their honesty. They won't try to sell additional products or services that you don't need. I highly recommend this family owned business.", "cool": 0, "date": "2017-12-08", "funny": 0, "review_id": "ZWsrKG9aNxXA2L513sO9AQ", "business_id": "WjxZkodBHR-eKvfft1fnWA", "stars": 5, "user_id": "5ZkOBQ9pM4S8LwG47JQRCw", "useful": 0}, {"text": "Great little brew house in Boulder NV. Great food. Interesting combos for burgers and salads. Micro beer sampler was great. Six moderate sized samples of diverse beers. Definitely a fun place to visit before or after visiting Hoover dam.", "cool": 0, "date": "2016-04-09", "funny": 0, "review_id": "HF8u90Li0j7U08u2ckctoQ", "business_id": "pJGfdoRYWqBU1aVfxWvThA", "stars": 4, "user_id": "nUL3gIvPiP1Jf-qCAMZusg", "useful": 0}, {"text": "I liked my thin noodles and beef short ribs. The broth wasn't oily which was good. The tofu snack was ok, but not a must-get. \n\nI thought the shaved noodle was slightly too al dente for me but overall it was fine.\n\nThere's a Presotea inside but I didn't get anything this time.\n\nOrdering from and iPad was easy and convenient for those who don't speak Mandarin. The menu is available in English and Chinese.", "cool": 0, "date": "2015-12-21", "funny": 0, "review_id": "uGaXxtYMvHS4hVqkSmpB_w", "business_id": "r2qLNZaYTZKjvVXfXB1BLQ", "stars": 3, "user_id": "UGW-9bbBEB3eP1o6mWD_WA", "useful": 1}, {"text": "We had a reservation on a Friday night at 6:30 and the place was practically empty. We asked for a room which had space for our legs below. Service was fine. \n\nThe food was fine. Nothing above and beyond what you would expect. The sashimi pieces were a good size. The sushi rolls didn't have too much rice. My tuna/avocado tartare appetizer was bland so it tasted like a tuna roll without the rice. \n\nI probably wouldn't come back.", "cool": 0, "date": "2014-02-01", "funny": 0, "review_id": "glvmn8Dz4h6MjYNz3YCwSg", "business_id": "cDoo0Pf1d_P79Rq3ZNk-Mw", "stars": 2, "user_id": "UGW-9bbBEB3eP1o6mWD_WA", "useful": 1}, {"text": "Terrible service .... Terrible over cooked wings. \n\nLiterally was like eating dried out oil jerky ... Not sure how they are still in business. \n\n\nTip* save your time and money go somewhere else... Anywhere else will be better.", "cool": 0, "date": "2016-01-13", "funny": 0, "review_id": "kCieN9PVbrZe40eNYDZM9Q", "business_id": "k7D1eFxN-_Ry491C-RiMpw", "stars": 1, "user_id": "kBNFdviedCPFWyR-wVaAzw", "useful": 1}, {"text": "this is hands down one of the best Indian restaurants I have been to, not to mention vegetarian. food is great, people are great. I will be back.", "cool": 1, "date": "2014-06-14", "funny": 1, "review_id": "wrOqFe_OcoNSgCDvNL9SpA", "business_id": "-qdbWrCU8Ktg80dk458BAw", "stars": 5, "user_id": "xZ62OTOf-L88ucRYkFpEBA", "useful": 1}, {"text": "This place was awesome! I found out I had plantar fasciitis, which stinks since I have a 16 mile run to train for in November. Linda told me to come in and she'll take care of me. I was properly measured, asked a bunch of great questions and totally catered to. It was great. I got an awesome pair of new Nike running shoes that not only look really cool, but fit my feet perfectly. I also got an awesome set of running socks, inserts and a roller. They explained to me that I have tight calves, which can affect my feet the way it did. So, I got the roller to help break up the knots. I feel great and loved the experience. I'm not sure I'll ever just go to a Sports Authority again for sneakers. This was great!", "cool": 0, "date": "2014-08-24", "funny": 0, "review_id": "XIE3NO3nGceAXfw1yOBMpw", "business_id": "vEE91PRNYG3Boq3B69Bycw", "stars": 5, "user_id": "q3AiAe-AcpDrNsdZf8nCvQ", "useful": 1}, {"text": "I'd give this place 3 1/2 stars if I could. Because to me, this place isn't blow your socks off delicious! Instead it's just good enough. \n\nLook, when I'm craving pho I'm glad I have a place close by to order from, however it's just not as good as I'm used to back home. I think my problem is it doesn't taste as authentic as I'm used to. This place to me seems like it's trying to be asian fusion (like Pei Wei or PF Changs) when I just want pho nothing fancy just pho.\n\nThough I did think the spring rolls were awesome!!!\n\nBut nonetheless it does fulfil my cravings without me having to drive 45 minutes, so I'm happy about that!", "cool": 0, "date": "2012-01-21", "funny": 0, "review_id": "JT8uWAavADrlWzXQ6mQUQA", "business_id": "I4EmpNOW7zCcx7fUnQ9ixg", "stars": 4, "user_id": "WgbbxTRIy7MwDKn7nL5WKQ", "useful": 0}, {"text": "First time here and the ice cream was excellent and very cold due to that it's made by liquid nitrogen. I would give it 5 stars only if they had more seating. #MakeItSweet", "cool": 0, "date": "2017-07-29", "funny": 0, "review_id": "v-U55-IhVWuh28SHtSm_dQ", "business_id": "DyCv2ubxeygyOUWJ4lnewg", "stars": 4, "user_id": "8l8PZFsNyhi24BCRQ0xbSA", "useful": 0}, {"text": "I read a lot of reviews about this buffet so on our last day I made sure to drop in as we were staying at the Bellagio.\n\nOh. My. God. This place was awesome! Not only did it have the widest choice of options I have ever seen at a buffet, the quality and presentation was like a top restaurant!\n\nHighly recommend going here if you're after a good feed. Plenty of healthy choices as well but I must admit I gave in to quite a few of those tasty pastries... :)", "cool": 0, "date": "2013-01-20", "funny": 0, "review_id": "XN1OyFgh0Nf1BRsyFacoeA", "business_id": "ujHiaprwCQ5ewziu0Vi9rw", "stars": 5, "user_id": "wcKvC0jov-kAHg-GIvWJqg", "useful": 1}, {"text": "This location was my first foray into the Pizzaiolo chain since moving to Toronto.\n\nWe went to this location at 3am on a Saturday night and asked for half a fredo (with potatoes, rosemary and oregano)  and half a vittoria (tomatos, zucchini, red peppers). They didn't even blink, no problem, done. When we got it, it was packed with toppings, hot and delicious. Everything seemed cooked to perfection. \n\nAfterwards service was a bit off, I tried to buy a drink, and stood at the counter, drink in hand while the server talked on the phone... for about five minutes. Then I put the drink back in the fridge and sat down to finish my pizza. \n\nOn the plus side, the variety of pizza they offer is nice, they have vegan and vegetarian pizza available by the slice (amongst others), and they are open super late.", "cool": 3, "date": "2010-12-07", "funny": 1, "review_id": "QBtZUwzwWdR7iESmgwJZaA", "business_id": "7eSbvHOOpRmEwywDOclevQ", "stars": 4, "user_id": "YgavGxfAdjhkkbwlAY_9ZQ", "useful": 4}, {"text": "Absolute worst nail salon experience of my life, I will never go back. I urge everyone to choose a different place to get their nails done for the following reasons; firstly she gouged my cuticle super deep as soon as I got there, it was bleeding profusely, dripping down my arm and onto the counter (which she didn't clean up the whole time) and her response to this was to give me a curt \"oops\" then squeeze rubbing alcohol directly onto the cut. Next I told her I wanted the shape to be between almond and stiletto (so pretty pointy but on the shorter side) as I'm watching her file my nails I have no idea what she's doing; she finishes and they're all oval. After phrasing it about six different ways she finally got that I wanted the tips sharper which prompted her to roll her eyes and say \"that's not almond\" uh yes it is. As she was refiling them she messes one of them up and has to take the whole nail off and start again from scratch! The whole time she kept forgetting about the open wound on my hand and would buff and file right over it (which hurt like a bitch) which caused it to rip open again bleed more, I barely even got an apology. Next was the colour fiasco, upon arrival I had chosen a lilac colour with a light pink for the accent nails, she paints the ring fingers first then when it's time to move on the lilac she discovers that it's dried up so she gets up grabs a totally different purple off of the shelf and just starts painting, I grabbed my hand back and asked if I could choose a different colour which prompted an explanation about how the lilac was old, which I already understood I just wanted to choose something totally different. So she throws the chip wheel at me and says \"hurry up\" now I was already at the point of trying not to scream or walk out before and that almost tipped me over the edge (she even pointed out how I was sweating, well yeah I'm trying really hard to not have a freak out) so I pick out my other colour, a grey, so she goes to retrieve it, she comes back starts to paint my nail and it's an orange colour?!? I ask about it and she replies \"oh that colour was discontinued this one is the same number though\" can somebody please explain to me how that makes sense. Yet again I ask to pick a different colour which got a similar response as the first time, finally I pick out a different grey and she finishes painting them. Once that was done she refiles my nails after the polish was already applied(?!) I almost asked to speak to the manager after it was all done but I just wanted to get the hell out of there so I settled up (it cost about $20 more than the usual place I go) this whole time I was perfectly polite and externally calm I even tipped her a little bit because as a server I know what it's like to rely on tips. I only went because this place had such good Yelp reviews, so I feel as if it's my duty to save anyone else considering this place it's worth 0 stars and as a veteran of acrylic nails I know when things aren't right. As a bonus not even two weeks later I had a nail break off, ridiculous.", "cool": 0, "date": "2016-03-16", "funny": 0, "review_id": "mK9Z7wdt87Xv2Ov-xVDeHg", "business_id": "cBoFYIJQztZNaNjMS4xmNA", "stars": 1, "user_id": "ykP8KSxQJzg5akl05KXcVw", "useful": 6}, {"text": "Very clean and I love the snack/food options. Makes it an easy stop for road trips. I just so happened to buy something a month past expiration so that was a little disappointing, but I guess it's my own fault for not checking. Other than that I have no complaints.", "cool": 0, "date": "2016-08-09", "funny": 0, "review_id": "gE38Q69oDJbp5EzrpP32mw", "business_id": "sY6hLHFn7oMpod8s0To6DQ", "stars": 4, "user_id": "YHqaaRRptjV33H_npjKO1A", "useful": 0}, {"text": "Got a new rack and panniers as well as some nice tires here and was happy with everything...will definietely try service dept out this year.", "cool": 0, "date": "2010-03-15", "funny": 0, "review_id": "bC5EHqiKl8zkWt_rssH4Hg", "business_id": "AmrUWxq17Ct5VhG0Czx-FA", "stars": 4, "user_id": "TuZIsGyI021XZdHpfsj_7Q", "useful": 2}, {"text": "Learned about the establishment by chance.  I went to the Craig location and was blown away by the quality of the poke.  I was so stoked when I learned that they have a South location. The customer service is superb and you can sample all the different poke. Personally I like the spicy ahi poke, salmon with special sauce. This is definite must try", "cool": 0, "date": "2016-10-18", "funny": 0, "review_id": "uHiUFtpz80uMWxu8bGWZNg", "business_id": "xwIJGDiwUz5aorokYKfxIQ", "stars": 5, "user_id": "7XucHwQSdN_5-8LBpIvCUQ", "useful": 0}, {"text": "My boyfriend & I went to Jozo yesterday after the gym and thought to check this place out since we've been seeing a lot of hype. The place is nice and quiet. Menu has a good variety of options from boba to coffee to smoothies. \n\nWe ordered two drinks which was the Classic Taiwanese Milk Tea and the Signature Thai Tea. Milk tea was alright, it wasn't as sweet nor milky as most boba places. Thai tea was just like your regular Thai tea that you get at restaurants. And the boba was unusually smaller than your regular boba which was surprising coming from a boba place.\n\nWhat was really disappointing was the amount of ice that was in the drink! My boyfriend and I took two sips of the milk tea to try the flavor and noticed that the cup was pretty much ice! The 12oz cup (not even the bottle) was filled with 2/3 ice & 1/3 tea. I know it's being nit picky but I feel like I got gypped paying $4.50. Mind you, they were out of their cool bottles which comes standard with their drinks and still payed for the same price for a plain regular plastic cup - no name or anything. \n\nOverall, I think Jozo is jumping in with the trend of hipster branding but is lacking quality on the flavor. Wish I had a better experience!", "cool": 0, "date": "2017-06-15", "funny": 0, "review_id": "a5ol67pRj7r0ChwImRtmhA", "business_id": "i8G0Zh_yUb8zj7CG_Op63w", "stars": 2, "user_id": "eHgBIO0ZHX_gXZV-rPJLMA", "useful": 6}, {"text": "We've had Pho at different places all over the city.  When I want Pho, this is where I want to go. I don't know their secret but I love the spring rolls and rare beef pho made here. Nothing else seems to compare for me.  We will drive across the city to go here for inexpensive, fantastic Pho!", "cool": 0, "date": "2013-10-14", "funny": 0, "review_id": "QJfA_0kBNbtxIRsfp6jINQ", "business_id": "jg37O7ANF7hqggS6bxUpcQ", "stars": 4, "user_id": "_O1ALDAM8lMoLxISeTdrfA", "useful": 1}, {"text": "Went to this place on Monday night football. Walking in looked like a nice place to cheer and get your grub on !! I was there for the happy Hour so I ask the waitress about sitting on the comfy chairs up front. Her reply was it's not a 1st come , 1st served and we would have to charge your party of 5 a 150$ I was like just to sit or is that how much food and drink we needed to order . Her reply was \" just to sit. \" we started laughing , not high rollers at all. We gently walked ourselves over to the bar stools . Hahahaha.                                                    Over all experience was cool, not a bad seat In the house . Good choices for beers if that's your thing. The Yard was a good look, we ordered up all the appetizers and felt the jack Daniels wings were a hit too. Will be looking for another sports bar upon returning to Vegas . Oh yea our bill came to 155$ and all I could do is laugh because the comfy sofa couches didn't even fill up.", "cool": 0, "date": "2015-09-16", "funny": 0, "review_id": "nVrXJh4WtOHqpCUX-dF0bA", "business_id": "U-zsJM-VN89i3PbaIbKmJw", "stars": 3, "user_id": "SKteB5rgDlkkUa1Zxe1N0Q", "useful": 0}, {"text": "I read the reviews but I'm  stuck because of my insurance!  The wait  was bad the dr was nice I've been waiting for paper work so I can go home  for over an hr! That's why the 3 and your  correct they don't check on you!", "cool": 0, "date": "2015-10-09", "funny": 0, "review_id": "cL0Y01L5sU120lTY3gN-Jw", "business_id": "CJZm1-WJFxNI_HE6P-n8Aw", "stars": 3, "user_id": "uU_ol_n14rgh8kuuZ--WSQ", "useful": 0}, {"text": "Food was very authentic and excellent! Best carne asada that I've ever had. If you live here or just visiting I highly suggest this place.", "cool": 0, "date": "2017-01-15", "funny": 0, "review_id": "AUVlbDD4k8GoxbPycEBs_Q", "business_id": "I22wQGTkLFGn6jTOhwoecQ", "stars": 5, "user_id": "8Cvdf7-zeGPkcv8afQ58wA", "useful": 1}, {"text": "Came to this location for some pre-surgery tests. Staff was super friendly and absolutely great. I would highly recommend this location.", "cool": 0, "date": "2016-03-16", "funny": 0, "review_id": "0BwOQFAqvsIK1qqdcrQwEg", "business_id": "Zo0DWTyHTSyKRVIWIYVf-w", "stars": 5, "user_id": "AJVIsIzznYPDfuKm7tBg1Q", "useful": 0}, {"text": "Would of gave it 5* but the brow wax wasn't the best. But they did a fabulous job on my hands and feet me and my friends will return.", "cool": 0, "date": "2013-05-15", "funny": 0, "review_id": "yrWvnIjBfZOBHf34OtBHVw", "business_id": "9_JYDL4Ni1tQhnWl01tFNw", "stars": 4, "user_id": "uUNPZx0M36UNSJ6FlcR9hQ", "useful": 0}, {"text": "Wow! This place was great! They fixed a puncture in my tire in less than a half hour for only $10! I'll never go anywhere else! Thanks!", "cool": 0, "date": "2014-12-04", "funny": 0, "review_id": "SLPY1tzhidvBCEvatkLpzA", "business_id": "NCu9a32XQzzWqj10JwKQ-g", "stars": 5, "user_id": "VRIa3BDaTeIjezcNApM3DA", "useful": 0}, {"text": "Sushi is tasty but overpriced compared to other local places. \"Half price\" is now cash only, 40% off and only from 10-12 on Friday and Saturday nights. Very disappointing and we would visit more often if the discounted sushi option was available like it used to be.", "cool": 0, "date": "2016-08-07", "funny": 0, "review_id": "Otkl_FgwH0LolTKdOca8lQ", "business_id": "_vu7qhaHRo0k8gnkojZD_g", "stars": 3, "user_id": "s2jkR1osopETwWV3-syQ0Q", "useful": 0}, {"text": "I've been to this restaurant 2 times. The food was good but they're salad bar needs attention.  The have good items in the salad bar but it's never stocked.  I want there for lunch yesterday and the salad bar was missing many items and it didn't get restocked the entire time I was there.", "cool": 0, "date": "2017-04-08", "funny": 0, "review_id": "1mTS_mmKJocNLxCQ4J7O6w", "business_id": "5iSlHNIy3RLbCP5AayB31g", "stars": 3, "user_id": "LOWgS4mUu7Y2uPWKZnP5Pw", "useful": 0}, {"text": "HANDS DOWN the best burger joint!\n\nPros:\n+great service\n+amazing food\n+oxtail fries\n+kiki burger\n\nCons:\n-there isn't one in San Diego!", "cool": 0, "date": "2013-08-28", "funny": 0, "review_id": "WwsLyhbRkAVoOj7eQWNQXg", "business_id": "7sPNbCx7vGAaH7SbNPZ6oA", "stars": 5, "user_id": "M8KZG9AxSaaJCyRZrHVXzg", "useful": 1}, {"text": "Excellent coffee and lattes...They serve FONTE Coffee!\nHot cinnamon bun is delicious\nStaff is welcoming and friendly.", "cool": 0, "date": "2011-10-19", "funny": 0, "review_id": "JJgLt9xvyuM0In3vwNTB-g", "business_id": "Do4n_yK_K6DmR9_Es5qwlA", "stars": 4, "user_id": "sHSZnywTcjMEnxKyD1JMTQ", "useful": 0}, {"text": "Everything I've had here has been delicious. Came twice on my own and on my third round brought a number of colleagues -- all of them loved it.", "cool": 0, "date": "2017-09-28", "funny": 0, "review_id": "ASOngeNYDkjXzvUjswTMNQ", "business_id": "1vqFEbZ4xUsHAbiHmPzuhw", "stars": 5, "user_id": "GPfteXVEeyOB6Jyd552Iew", "useful": 1}, {"text": "First, I'll say this place does have a few good points:\n- Aesthetically it's beautiful- very posh, well decorated and a pretty relaxing atmosphere. \n- It was easy to locate and had plenty of parking. \n- It was easy to schedule and the staff were all friendly enough. \n\nHowever, the thing that brought me to write this review is the quality of the massage I received. While the therapist I saw today was super nice, I honestly feel like I just got oiled rubbed on my skin for an hour. While I can only hope that if I had requested a Deep Tissue massage over the Swedish that it would have been more worth it, honestly- the pressure was non-existent. \n\nWhat was even more upsetting to me was that the whole reason I went in for a massage was because I was having some neck issues and made sure to make it known to the therapist before the session began that was what I wanted to focus on...and she basically just did a typical body massage. I've had many massages and that's what she did- no focus on the area /reason I went in there in the first place. And the fact that I paid $70 (not including tip) for this makes me uber regrettful. Sure, I could've complained and tried to direct her movement and pressure but you don't pay that much money to go in there and do that. \n\nI feel like this place has a lot going for it but I think it would be greatly beneficial for the therapists to do more of a \"consultation\" with the client to see what it is they want exactly and then make sure they stick to that.", "cool": 0, "date": "2016-01-27", "funny": 0, "review_id": "7lGsC4lUOPtwnRak2NbWUQ", "business_id": "XuvmzFC-_mmSymB-aYurpg", "stars": 2, "user_id": "pTGVqTpsPffvwII5EsGvaw", "useful": 5}, {"text": "Mmm good food. I had the eggs benidict for breakfast. The egg was to over done, but it was good. Great service", "cool": 0, "date": "2015-06-13", "funny": 0, "review_id": "cvjA8v5roxnMD224h2Hx1g", "business_id": "J8GuDrqeLH1xMpSpeEixYA", "stars": 4, "user_id": "9OkrwOlsvtxVnaLj-hZGhQ", "useful": 1}, {"text": "Delores has saved hundreds of dogs. That is what she does. She takes every step possible to ensure these rescues go to good responsible homes. Period.\nAs a fellow rescuer I understand how hard it is save and care for these animals. She has dedicated her life to them which makes her INCREDIBLE. keep it up Delores the dogs need a heart like yours.", "cool": 0, "date": "2016-05-16", "funny": 0, "review_id": "v8SpROGbK8_IVzCaF7N6XQ", "business_id": "NT9oIw3TTDLXo_x6nKUkBA", "stars": 5, "user_id": "Je5jRuaSdeO5Vw9dNfupZA", "useful": 1}, {"text": "I have heard a lot of good things that about Wynn Buffet being one of the best in Las Vegas since they open.  However, I haven't gotten a chance to try it until this time at 2011.  \n\nI struggle over 30 min on what rating I should grade the Buffet at Wynn Hotel,  I don't know I should put 3 or 4 starts, for sure not 5 stars perfect rating.  Then, I settle with 3-star.  I'd like clarify, it is a 3-star within all the 5-stars hotels competition around in Las Vegas.   If you take about \"general\" rating, it may be 4-star, mainly due to atmosphere and service.    3-star is FOOD only, if good food and variety is what you are looking for.  Not to mention, I have to pay $46 per person to go in.  \n\nWhy 3-stars?  I think it failed in 5 main dishes.  1.)  The prime rib and honey-baked ham is too dry.   It almost has no juice in the meat.   2.) Seafood selection is poor, and the sea bass was over cooked.  It was too dry too.   Oyster was so small, and the spinach on top was only at room temperature.  other seafood selection is kind of limited.  I only see King-crab, sea bass, smoked salmon, and oyster.  3.) Asian and Japanese food is SUPER limited too, and doesn't taste very good.   4.) Italian food, so-so.    5.) the juice are not 100% flesh, they are from concentrated formula mixed with a flesh juice.  \n\nGood thing the \"Black pepper backed ham\"  save the day, it was cooked carefully, and the meat was carefully selected.  It has a well balance of meat and a little fat to make it juice and smooth.     King crab is not bad.  They pre-cut them in half, making it a lot easier for us to eat.  Good job.  \n\nOne thing may worth mention about the choice of drinks.   You have a choice of buffet or buffet with Champagne.   What we didn't know, and our waiter didn't inform us, is that there are actually 3 different type of alcoholic blended drinks are offered with the standard buffet.  So, you have choices not only to soda, juice and coffee (Tea), you have at least 3 other choices (more expensive)... I forgot the name.  I will try to get them next time.\n\nI feel very fortunate that I have tried a lot other 5-stars type of buffet around the world.  before, like Hyatt, Shangri-la, Four Season, Hillton,  Mandalay Bay at LV, Bellagio at LV, Mirage (back in the early 90s) ... etc    So, after having many of experience I had, I think a 3-star for food taste and choice is fair..    \n\nI tried a 2 times in the week.  one for Breakfast / bunch.  One for dinner.  \n\nOn the side note, comparing to Wicked Spoon which I tried a few months ago.  I think Wicked Spoon offers more choices on the desert and and salad section..\n\nGood luck on your choice and enjoy your meals.  :-)", "cool": 0, "date": "2011-11-27", "funny": 0, "review_id": "4KlQTIPn4gLkaCWwk2ZURA", "business_id": "2weQS-RnoOBhb1KsHKyoSQ", "stars": 3, "user_id": "nza_57QyRMqfVl3zjmTp_g", "useful": 0}, {"text": "Not the place to go for a nice dinner. Cocktails were pretty good ( st Germain recommended, the pineapple one not so much). The food was not the best. One vegetable dish we ordered was delicious, the fries were underwhelming, and the meat was overpriced and not that good. I'd recommend this place for drinks but not food. Also bf and I were having stomach problems the next day, dunno if related ...", "cool": 0, "date": "2017-04-16", "funny": 0, "review_id": "cQC9IVrxZ2UwgBtR7NOopA", "business_id": "m2hz26KM3kLN_AS5CcEjPg", "stars": 2, "user_id": "FJ0FIrj5rUdOnR2TRP6rUw", "useful": 0}, {"text": "Hey all, my 5 star is solely based on the food. I've visited at various times during the day and it seems run well enough, and though it seems to have a fairly large group of regulars it really doesn't bother me, but I know that that could turn some patrons off. HOWEVER, as a Chicagoian who values quality food I can honestly say that Jolies has a menu that's unrivaled in the valley. I've easily tried half a dozen dishes and everything was MUCH better than I expected. The service is always good, and it's easy to flag down a server when things get busy and they seem on top of it. So thanks, Jolie's, for being a place that's been reliably good.", "cool": 0, "date": "2017-07-23", "funny": 0, "review_id": "Qzaa4EJ1cBP6WXPhWPV9pA", "business_id": "8zN3nV0zbtE377_XhlvabA", "stars": 5, "user_id": "ZAWEuVjtgC65ITpDoCrI0w", "useful": 1}, {"text": "Went in for the first time today for the awesome price on the smog check.  The workers were pleasant but condescending.  After about a 10 minute wait, the technician informed me that it failed due to the gas cap seal starting to crack with age, but everything else was fine.  He then handed me the invoice with all of the other \"recommended services\" to the tune of $1105.00. The guy at the counter then told me that once I bought a new gas cap and came back he would charge me the $10 again and redo the whole thing.  After buying a new gas cap, I took my business to another inspection center.  The gentleman there was incredulous they would charge me twice when it was only the gas cap.  In short, go elsewhere to people who care about their customers and not just the money.", "cool": 0, "date": "2016-11-29", "funny": 1, "review_id": "0mT9JGktyRWbzkUVfoG-KQ", "business_id": "QyK4roe68JzIxsSwVWKcdA", "stars": 1, "user_id": "5PJMSp0-6pex-iR-nRLdoA", "useful": 2}, {"text": "Delicious pizza! The huge size reminds me of New York style pieces where the only way to eat it is folded in half. The thin crust was yummy and they fill the slices with toppings. Not bad for the price, definitely have had more expensive pizza. Nice new place in Medina. Staff was friendly too.", "cool": 0, "date": "2015-12-01", "funny": 0, "review_id": "RW2XOS_8cnFqF3tN0bNWGA", "business_id": "YQ0h5NTYgrBgOXf2VRYKVg", "stars": 4, "user_id": "72VoUg93k9anjC7pq3I6iA", "useful": 0}, {"text": "Had an appointment at SimonMed today. I walked in and of course the waiting room was packed with about 15 people waiting. I filled out my paperwork and gave it to the person at the desk with my insurance card. 20 minutes later they still hadn't called my name to return my card even though they'd taken about 4 other people who came in after me. I checked with the desk and the lady said someone was processing me. So I waited another 20 minutes and went back to the desk. I asked if they thought they might get to me soon since I had somewhere I needed to be in 20 minutes. The lady said they were running at a 40 minute wait time (instead of their usual 25 which is already ridiculous) and there were also 3 people ahead of me. I'd already been there 40 minutes so I was done. I told her I would just reschedule and come back if she could just return my insurance card. But guess what they couldn't find? After she spent 5 minutes looking for my card and asking other employees if they'd seen it, I told her to forget it and left. Total waste of time and a frustrating experience.", "cool": 0, "date": "2015-08-28", "funny": 0, "review_id": "7zrF2bxpsI9n70YTSItOqw", "business_id": "SVhM3Pxjw-PUPr1sBghqlw", "stars": 1, "user_id": "2tOHlIE3sTntIX5DiE3l4w", "useful": 1}, {"text": "A Westmount classic. \nGrilled cheese, milkshakes, Greek salads. \nStill a great place for a comfortable meal in Westmount.", "cool": 1, "date": "2015-04-07", "funny": 0, "review_id": "Mp8670JNWl4Wncin92Nrfw", "business_id": "YuGlPpQ98K2GQl4fUTC_AQ", "stars": 5, "user_id": "E92eg6IqUh5Vz5FiciLBZA", "useful": 0}, {"text": "Absolutely love this place! The red sangria, vogue burger, actually everything I've had has been amazing!  Little bummed they changed the menu and got rid of my favorite dish but hopefully I'll find another go to!", "cool": 0, "date": "2017-02-12", "funny": 0, "review_id": "GpCOpDNX2lpFkI-dpm7izQ", "business_id": "ovtlrcsVRlgZZQUlHs_ovw", "stars": 5, "user_id": "sEc07tLRRGJeTknahO5Qsg", "useful": 1}, {"text": "I visited for the first time tonight after having driven by the restaurant many times on my way home. Truly a unique and delicious dining experience. If you want really good Chinese food, then come to Singing Pandas. I'm not much of a fan of Chinese food, and I thought the food here was worth repeat visits, and I'll now be bringing friends and family along to try it too. The staff is excellent with their customer service as well.\n\nWhy the friends and family comment? What really set this experience apart was the live entertainment; the \"singing\" is not just a clever name. There is great, live musical entertainment included with your dining experience from 6-8pm. \n\nIn a friendly room with a full bar and tables to accommodate all party sizes, the dining lounge was one of a kind. I can't think of anywhere in AZ that you can get a great meal and see great local musical impersonations and performances, along with songs performed by the tremendously talented owner herself, all for a very reasonable price of dinner. Singing Pandas blows the pants off something you'd pay for at a casino or local theater when you factor in the quality plus the cost. \n\nTry Singing Pandas today, they even have a good sized and well kept parking lot so the whole experience is easy-going fun.", "cool": 0, "date": "2016-06-01", "funny": 0, "review_id": "sTW4OABJB5ZxuqmeWVPrnA", "business_id": "bWucOPNoIjd8ECdiDyVq9Q", "stars": 5, "user_id": "FfqX7xdQY80nbkdNoeh_6Q", "useful": 1}, {"text": "The drinks were great, and the service was acceptable - but the nachos were poor for a 'Gastro Pub'", "cool": 0, "date": "2016-12-04", "funny": 0, "review_id": "D_CuN3l0P_wX84QuRY-4Dg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4, "user_id": "-gtyNPUaHRCkTxgMfSVM7g", "useful": 0}, {"text": "Paying to much money for a gym that's always packed. Tried bringing my daughter and they stated she needed an ID who brings their ID to the gym? I'm paying you money to be here and to be able to bring a guest. Find a better gym that's nots packed all day long. Equipment is never open, leaving this gym and going somewhere else that's cheaper and less packed. Look other places before coming here.", "cool": 0, "date": "2017-07-31", "funny": 0, "review_id": "e5r_nLOhy-k2IzYm2KEw7w", "business_id": "mmeKyvhdKHsW-gh0JvLbGA", "stars": 1, "user_id": "jyKNypKgkA9JsutB3obJYQ", "useful": 1}, {"text": "going to a BBQ?? this is the places to pick up your stuff..", "cool": 0, "date": "2011-08-23", "funny": 0, "review_id": "_1mEuMVgjJTKzwZ_XVIghQ", "business_id": "6i85_hLuAdymNIy01LLl0g", "stars": 4, "user_id": "wNltctNC59TVPXMeDHsM1Q", "useful": 0}, {"text": "We had a great team event (getting to know other team members) here but not much can be said abt the food. I had the ahi tuna with cold soba noodles, the soba wasn't bad but the tuna had some funky taste to it. The sauce did not go well and it was just undesirable. I left half of it behind. First time that I did not fish ahi tuna! We had a big group for dinner, abt 20 but the entire restaurant was empty but it took ages before we received the food. They were certainly not understaffed since there were at least 20 servers running around but no idea why. \n\nI'm sorry but two star is being generous; 1 for the great group camaderie and networking event we had and 2 for the somewhat nice interior decor.", "cool": 0, "date": "2007-10-06", "funny": 0, "review_id": "Z8nZTrhBBTg6YF37rUkPNw", "business_id": "-nKIDHXa5H23rq8d6KGT_Q", "stars": 2, "user_id": "Ud6j2HN40qEhycq2PuwcBA", "useful": 0}, {"text": "I was greeted by a very friendly and helpful staff. She was wide eyed and chirpy! \nI came in here looking for Clinique Super Lip Balm treatment cream however, they were sold out. She was kind enough to let me know that just around the corner is the Clinique store itself and I can probably find what I'm looking for out there. Thank goodness so I don't have to hike over to the Fashion Show Mall. Every step you save walking in Vegas is a big deal!", "cool": 0, "date": "2007-10-10", "funny": 0, "review_id": "g0EslpD5q8aMK5Gjxesi6Q", "business_id": "28MoceEv54TgNDsmGxokPw", "stars": 4, "user_id": "Ud6j2HN40qEhycq2PuwcBA", "useful": 1}, {"text": "We visited Brassaii during Summerlicious this year and their selections were fabulous. Prior to ordering our meals, we focused our attention on their specialty cocktail list which featured several special mixed drinks and Caesars. I wish we could have tried them all. Instead, I settled for a tasty Gin Caesar topped off with a slice of cucumber and a grape tomato; while my date enjoyed a Balsamic Bramble: a sweet mixture of gin, chambord, and champagne crested with some fresh fragrant berries.\n\nChowing down for dinner after taking the edge off; I ordered a sweet flavoured vichyssoise topped with a chive creme fraiche as my appetizer; sirloin steak frites served perfectly to my liking with a sensational chimichurri sauce that sent a wave of excitement through my taste buds accompanied by perfectly seasoned Yukon fries; and although I normally pass on dessert; I, thankfully, let the temptation of their dark chocolate raspberry delice overtake my sanity to perfectly cap off my dining experience.\n\nMy date enjoyed two crab cakes served with curry aioli and mango salsa as her appetizer which looked very tasty, and I suspect they were SO tasty, and that that was probably the reason I wasn't even afforded a nibble. Her entree was a filet of baked salmon seared to pink perfection, with a pureed mash of wasabi potato and fennel, presented elegantly next to a julienned citrus salad; and, as her sweet tooth is always stimulated, this time she enjoyed an almond butter cake topped with freshly sliced strawberries and a Brassaii specialty their home-made basil ice cream.\n\nAll in all, I definitely would'nt hesitate to recommend Brassaii. It's a true neighbourhood gem that isn't as hard to find; it's located just 100 metres west of Spadina Avenue on the south side of King Street West.", "cool": 1, "date": "2011-08-13", "funny": 0, "review_id": "nM4LQHx_IgDckOQCylOyBg", "business_id": "TrOgTZ0DfmQxvpTehiNibQ", "stars": 4, "user_id": "YHWsLBS8jzZiPjKHMFOaAA", "useful": 0}, {"text": "I highly recommend the trolley pub! Vincent, our pilot, was a wonderful guide. We had such a fun time and it was the absolute perfect thing to do for a night on the town with friends. We did the Uptown tour, but the Noda tour sounds awesome too. It was raining for a lot of the trip yet we still managed to have a ton of fun, drink plenty of beers, and jam out with the speaker Vincent provided.", "cool": 0, "date": "2017-01-23", "funny": 0, "review_id": "KE55tjBRMwR_wxt9qdC77g", "business_id": "YVt-Da2CplTzqLKu8JFD9A", "stars": 5, "user_id": "ADILa64OS8zottDZxpWpQg", "useful": 0}, {"text": "I gave it two stars because they try too hard and the flavors are forced.  By that I mean, I dont think the flavors are genuine.  \n\nThis was my first time to Copper.  Upon entering you are greeted by a very warm and friendly staff.  The decor is a not at all \"modern\" as some have described (I guess those people think modern is anything that's not painted beige).  I do agree seating is tight especially if you get a table in the corner by the windows.  The music is contemporary indian.  \n\nThe food was just ok.  I visited during restaurant week and there was a limited menu.  However, you are fee to order off the regular menu as well.  I ordered the cucumber avocado soup, the chicken, and the mango kulfi for dessert.  The avocado soup was not good.  I found it to be bland and the texture off.  The chicken was dry and needed more sauce to get by.  The mango kulfi was ridiculous and had deep flavor.  \n\nIf you are looking for a serious Indian restaurant - this is not the place for you.  If you are interested in trying something a little different and an enjoyable atmosphere go try Copper.", "cool": 1, "date": "2009-07-15", "funny": 2, "review_id": "SfiBK0xZ8OZFAKXv3rH4Jg", "business_id": "ICUCAzUZFiWkYs7iCtNCQg", "stars": 2, "user_id": "4dUg_rIh2Pk4Qye18TCe_g", "useful": 2}, {"text": "Mediocre food and lack of service ended with the waitress giving herself an 18% tip. While I have no issue with tipping I think:\n\n1. They should try to earn the tip- she didn't. She brought one platter from the kitchen to the table and didn't even bother to refill out drinks as well as took 15 min to come back to collect my CC after she dumped the bill on the table. I asked if I could pay someone else and the staff told me no, I had to sit and wait for her to come back.\n\n2. Because of the above, this was not a tip but a surcharge. The HD Cafe should warn that they charge 18% to have their servers bring you food.\n\nWon't go back.\n\nOn top of that, the bathroom was filthy.", "cool": 0, "date": "2014-06-29", "funny": 0, "review_id": "cVYGrjhZRNuxc0vMs4M1Ww", "business_id": "4v5ZLpmNn13Mze1w_XfWHw", "stars": 2, "user_id": "vmFs4WWLzfWQX7f7DZZPqw", "useful": 0}, {"text": "Fantastic! Great new neighborhood restaurant under wonderful ownership. Carnitas and enchiladas were winners. We are definitely coming back...again this week! Thank you!", "cool": 0, "date": "2015-11-18", "funny": 0, "review_id": "s3jmKZ9VCaGIuZXUQqyqyQ", "business_id": "vGDhK2Lc4Np5iZYZ7FG0QA", "stars": 5, "user_id": "UuhXs5GmOx9BEdLGJUXyEA", "useful": 0}, {"text": "This was probably one of the worst meals I've had in a long time. First of all we were seated in some tucked away corner were we couldn't even see the restaurant and it seemed like we were a little neglected because of it. Our food came out and we ordered calamari, margherita pizza, Italian sausage pizza and some raviolis. The calamari was the only thing that was good and warm. I really liked the pesto sauce that they came with! But the margherita pizza was cold and lacked flavor, other pizza was cold and the raviolis were rubbery. Worst of all with this meal were my drinks. The water that they gave us when we first got there had a funny taste like the glass hadn't been washed or the ice that was in it was really old and had sat in a freezer too long. I thought that when I got my coke that maybe the flavor wouldn't be in that drink but sure enough it was in that drink too. Because of this experience I probably won't go back to this restaurant.", "cool": 0, "date": "2015-01-15", "funny": 1, "review_id": "Mmw4NiGB_os9vdwMtd7ErA", "business_id": "Ehy00JWQixgoXzisVKhvag", "stars": 2, "user_id": "cyR413IWtGe4VVuad4P-ow", "useful": 1}, {"text": "I used to really enjoy eating here until I found out what one of my friends said about this place. He was a former employee of this Jimmy Johns on Power Road and told me about all of the comments that are made behind the counter. Who would've known such a fine establishment could be filled with so much cynicism and racism towards employees. Basically authority will take the nicest employees and then find reasons to take them down verbally with repeated vile comments day in and day out. Nothing like sandwiches made by discriminatory top-level management what taste better than a prejudice filled sandwich I thought sandwiches were made with passion at this place.", "cool": 0, "date": "2014-03-06", "funny": 0, "review_id": "-VTdSa4feIXI1SYddE9Qqw", "business_id": "bLhH9B7KbLJb_rvPzPauFw", "stars": 1, "user_id": "OMMjXZuLVGBGoFI72_lvjQ", "useful": 1}, {"text": "This guys are top notch! Both our cats love them . we will use them again. Thanks for all the help", "cool": 0, "date": "2010-12-30", "funny": 0, "review_id": "V_My6-kd9BTM8_7fnBzLMA", "business_id": "ZzZO_FIzICDLxHs7ooYgbQ", "stars": 5, "user_id": "QJ-FrreREnrFATd0pL4C_g", "useful": 1}, {"text": "So..this place is cute!  Huge dance floor!  The whole place is huge! Geesh~  Fun decor and nice bartenders.  The guys there seem pretty lame though.  Cool place to get dressed up and dance.", "cool": 0, "date": "2009-09-17", "funny": 0, "review_id": "omTBevivHgcChLQMRoJDTA", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "user_id": "epY-pU8xCZCAiZKzr-BOoQ", "useful": 1}, {"text": "I didn't buy my BMW here, but I do use it for service.  They do an excellent job on the service side - quick, reliable.", "cool": 0, "date": "2011-09-20", "funny": 0, "review_id": "12pnSfmnAXfLJxa504qmYA", "business_id": "YAODkC2s68TbF_kB9rFmMQ", "stars": 5, "user_id": "GWGAv8h20-vkQi1U5rKhEw", "useful": 0}, {"text": "By far the BEST pizza I've ever had! Whether you're a local or just visiting, you should make the trip. I've never had a bad meal here! Our favorite is the meat lovers pizza and garlic knots. Plus the cannoli's are AMAZING!!!!", "cool": 0, "date": "2016-01-21", "funny": 0, "review_id": "-EF4zjads5YcvUwKTfYSrw", "business_id": "iL2-xJ4-eMsJk88PsbivbQ", "stars": 5, "user_id": "OO-qJuNMBTVKoIn-LppNOw", "useful": 1}, {"text": "I just had a birthday party for my 7 year old.  I was really excited about this party.  Thought it would be really different.  I was promised lots of different experiments, including the static ball and stuff to really engage the kids.  Instead we got a young girl who completely bored the kids.  She lost their attention within 15 minutes.  Talked over their heads.  It just wasn't engaging enough.  It made science rather boring for them.  There was no static ball, just some experiments with dry ice, air pressure and making slime.  I wanted to make cotton candy but the machine wan't working.  And as far as the \"treat bags\" go all they received was a cheap ballon toy.  Granted this was a \"Living Social\" deal but if that meant I was going to get the cheap version of their product I would have gladly paid the full price.  I'm really irritated about this because you put so much work into these parties and you can't just have a \"do over\".  Think twice before you book.", "cool": 0, "date": "2012-03-31", "funny": 0, "review_id": "0AXqrSvSajK3umycZoDdGg", "business_id": "89_qI6EgDCVvWPs93aFPzQ", "stars": 2, "user_id": "VXxfLsD0oyIX5NH0fx1DDQ", "useful": 0}, {"text": "Wow, I feel like I've just discovered this store when I've been in & out in the past & haven't really been able to find anything. Well certainly not the case this week - I bought 2 work dresses & a pair of high heeled shoes all for just $94 today! I've gotta start shopping here more often, nice stuff & quality for the price. I found a lot if there clothes were mostly available in 0-4 sizes & I'm a 6 or 8 so had to search and they didn't always have my size. Nice stuff though!", "cool": 0, "date": "2014-12-20", "funny": 0, "review_id": "pPjj05xxURZ37ye0pErT1g", "business_id": "fQ4nfWP8RYwdUchpiWhGcg", "stars": 5, "user_id": "KjT3D4gZd5B-_WKgzmWjKg", "useful": 0}, {"text": "I have now been here for a work dinner, and on a date with my wife.  This place is an amazing secret.  Excellent food, great atmosphere, perfect service.  If you go during the spring or fall, you can sit on the patio without it being too hot.  Being so close to the mountain and surrounded by trees, it really is an amazing place.  And with great food to go with it, it can't be beat.", "cool": 1, "date": "2013-01-03", "funny": 1, "review_id": "pN9MVcbQ9w-uhdUFGYGFEw", "business_id": "p_uGLv1QXHBrwya6meztxw", "stars": 5, "user_id": "Fg51rJu_cD1ggx9Z1hoSVw", "useful": 2}, {"text": "Went on Sunday, 2 football games on TV. One being a Arizona cardinals game.\nPlace was half full....why? The food was terrible. Example, jalapeño poppers made with red peppers and the dip was sweet and sour sauce. Not very appetizing! \nGood thing happy hour is seven days a week, but don't go if you are hungry", "cool": 0, "date": "2013-10-31", "funny": 0, "review_id": "fZNL-CzWASFwESpZTT3dRg", "business_id": "jnEeU5rAhKt-ORxk9L1LYw", "stars": 1, "user_id": "kOgoFz__Xw-wQs3MZTQ7Og", "useful": 0}, {"text": "I went here in mid November for my 40th birthday with my 70 year old mother. I thought, what is the wildest thing I can do in Vegas. We were not in the best of spirits when the nice man picked us up at the hotel in a humvee. He turned that around fast! I wish I remembered his name. \n\nWe signed in and they accepted our groupons with ease. We looked around the shop while they got the guns ready for us. I admit, I was a more than a bit nervous. While my family had guns for hunting growing up, I wasn't involved in that and tend to think full auto weapons are crazy. \n\nWhen it was time for us to shoot, my mother went first. She has more firearm experience and goes to a range with my brother on occasion. She was spot on with the Glock and informed me that she had been shooting pistols with my brother for mother's day. \n\nI cannot stress how safe this place seems. No one is shooting on their own and everyone has a range safety officer. The people who work here are military. My mother told me that it was safer here than at the range she goes to in Iowa, even with the large automatic weapons here.\n\nThis is getting to be a long story, but I loved it! The safety officer noticed I was left eye dominant, changed how I was shooting and then I was hitting the bullseye with an Uzi! \n\nI convinced my wife to go with me on our next trip to Vegas later this month!", "cool": 0, "date": "2015-12-04", "funny": 0, "review_id": "sGLcaiNtxnsVYZlVGZmZaQ", "business_id": "qNGexUR4IG8eSfs7USrRtA", "stars": 5, "user_id": "7evWV0kYPHrOEF4nqAK4Ng", "useful": 3}, {"text": "First off, I never review offices/restaurants because I don't feel like I need to. I decided to write this review because the last appointment I had reminded me why I love this office.\n\nOffice? Beautiful. Staff? Friendly. \n\nThe dentists are thorough and the hygienist is probably the nicest hygienist you will ever meet. The Doctors are great. You can always depend on them to be honest with you. Options are always given. Sometimes appointments start a little late but when they do take you in you are out just as quickly. I have only met the lady doctor once before and it was pleasant but Dr.Michael is usually the one I see when I get a check up and he is quick and efficient.\n\nThe hygienist is very honest, patient and thorough. She wants to know how she can make your experience better throughout the appointment. She always welcomes you with a smile and leaves you with the receptionist with a smile. The experience is completely different from dental offices 15-20 years ago. My whole family, including my kids, love her. You can see the difference when you sit with Karen because she cares. My first appointment with the office several years ago started with her. I used to hate dental offices and Karen completely reassured that dental offices are not something to fear. She actually said to my son \"Am I scary?\" which she is not, she knew how to diffuse a \"scary\" moment. She is gentle when cleaning and thorough. \n\nOverall atmosphere is great. The Receptionist is friendly and experience is well worth it.", "cool": 0, "date": "2016-08-29", "funny": 0, "review_id": "OXQfMB8FbUT4QMHXilFq3A", "business_id": "rJAT0A_hP7l91FT00kixwg", "stars": 5, "user_id": "DOMtqbMJMNZeJG2zzL1rzQ", "useful": 1}, {"text": "EverythIng was great - service,food, price, ambiance.  My wife had ahi tuna and I had rainbow trout.  Both were excellent.", "cool": 0, "date": "2013-02-26", "funny": 0, "review_id": "99LyzGkvLi13XBOqrz2ZEA", "business_id": "YjAo1DBb0YuPE_RWmhNyrA", "stars": 5, "user_id": "veEPuTqFlBxq_aM9piG5Zw", "useful": 0}, {"text": "A fun place to just hang out with friends.  Great cheesy fries. They also have a great selection of chicken wing sauces.", "cool": 3, "date": "2014-07-04", "funny": 0, "review_id": "LLOgf0zkJp-bqeUyq3qodw", "business_id": "nHQtk-oJVNvVpvfFslv9Ug", "stars": 4, "user_id": "jrFenaBc9XdQoV-iBOdyeA", "useful": 0}, {"text": "Fantastic, fantastic bar with decent prices and excellent service. Love the environs!", "cool": 0, "date": "2013-03-08", "funny": 0, "review_id": "rWGoZN95AJoLOyL23ZBC-w", "business_id": "76VQeyubOwzkb6LxoWIhXQ", "stars": 5, "user_id": "4W1D-dUW7bC_CJYgslzUqA", "useful": 0}, {"text": "I have been here 2 or 3 times for issues with my tires. I pull right up and they are waiting there with a jack. They see me right away and get me out of there in 30 mins. Very friendly and helpful for a small town shop!", "cool": 0, "date": "2014-08-15", "funny": 0, "review_id": "SCLPaft5YKwH-agqGiU8aQ", "business_id": "rTQQKa57NHFS55I5JvhIUA", "stars": 5, "user_id": "pN88rAQHGQowb0KzQqdxlA", "useful": 3}, {"text": "The only reason I come here is for the bbq food the fresh roll platter,vermicelli noodle bowls etc I don't even know why anyone would order pho here as it's not that good.\n\nProbably my 2nd or 3rd time here because the service is slow I timed it about 25-30mins to bring our food!? Ridiculous as another table came in after us and got their food first,even when I asked for the bill they didn't bring it to us why is that so hard??? Seems like there is only 1 person in the back kitchen I ended up going to the front to pay\n\nYes they only take cash but that's like most Asian restaurants so better have cash on you \n\nFood was good had the platter but the hot water to dip the rice paper was in a plastic bowl they should actually be using the proper container which would also save a lot of space as our table was small", "cool": 0, "date": "2017-12-14", "funny": 0, "review_id": "4TaUOkTljf8KjaxyOO6pOQ", "business_id": "0QjROMVW9ACKjhSEfHqNCQ", "stars": 2, "user_id": "YnKgniSSRLCfEmtVxaOS5Q", "useful": 0}, {"text": "Really nice hotel! The room is spacious and the bed is very comfortable. The housekeeping does a wonderful job - they come in twice a day and leave little chocolates for you before bed. The decor of the room is very colorful and interesting to look at. The security in the hotel is also very comforting - no using the elevators without your room key. The only downfall was that the room has no coffee maker and they only serve complimentary coffee from 7-9am. The shower head in our room also had poor pressure no matter how we adjusted the nozzle. But overall we had a very good experience and I would definitely come back!", "cool": 0, "date": "2016-12-30", "funny": 0, "review_id": "H-hLHGXXtppF-CNFX0ywxw", "business_id": "WOuE6HtLVTRothIN-zy4Pw", "stars": 4, "user_id": "JPgraaVYIhYmZClRIxRBjQ", "useful": 0}, {"text": "I stopped in to see about brakes on my 3+ yr old hybrid Lexus.  Instead of selling me something I didn't need...the service rep quickly ran out and assessed the car and said I was good for another 15,000 miles!  I appreciated the honesty and will even drive across town to come back when I do need them.  Thanks so much!  :)", "cool": 0, "date": "2015-03-31", "funny": 1, "review_id": "9R3QN1NGFgnGSsxRPdygEQ", "business_id": "9fBwxdHyJRS1nLkMJ8cavw", "stars": 5, "user_id": "iKJn3PDGt4gTjs2NewDpyg", "useful": 1}, {"text": "Sometime will go there! Food AOK but service NO. Especially the old man, always no smile and unwilling to serve customer . Today I order s wonton noodle, the good Chinese egg noodle are tender but today are very soft very bad! Also the noodle have a small insert , that scary me.", "cool": 1, "date": "2012-01-07", "funny": 0, "review_id": "pMHDN85jFlRzZcC8H5C2kA", "business_id": "SvMBtzXfE-3H5pxoR7VD3w", "stars": 1, "user_id": "6jjQkX_rQafuL4Ied1XtuA", "useful": 1}, {"text": "Went to this place to make sure it was as good as man vs. Food made it seem! Was not disappointed it was delicious, I orders a Milanesa nothing but perfection!! The only reason why I give it a 4 is because of the crazy loud music they have playing, god I can't even Hear my self thinking I had to scream for them to get my order and for a person who talks loud like me to scream it must have have super  loud that they could not hear me!", "cool": 0, "date": "2014-07-30", "funny": 0, "review_id": "ChIE5tnKx9VHnMiAmCnALA", "business_id": "Ynm7H4c2ll5vZEX3iLdxmw", "stars": 4, "user_id": "Vue9_VsoYdF8h5G4T-_-8g", "useful": 0}, {"text": "Personally I hate shopping (no one could tell by looking at my wardrobe) and this store is the very reason. The girls in the store profile individuals that come into the store, only helping those that look the part. I dress well I have been a Manager and a Buyer for some high end stores. I came from a spin class just showered, hat on joggers on looking for a gift for my sister. She had just graduated and wanted to get her some professional clothing as she starts her life as a adult. I had a couple of pieces in hand no one asked if I wanted to try things on (not that I did), I do not even recall someone saying Hi. I left with nothing that morning. Later that evening myself and my boyfriends went in (dress nicely as we were going for dinner later) and got the complete opposite. Spent $800 on that little girls cause the young lady helping me was so GREAT!", "cool": 0, "date": "2015-12-23", "funny": 0, "review_id": "MwW9G0eh_btpHQV_bd-miQ", "business_id": "K5KbN4lqsJKKptVbqKEWtA", "stars": 3, "user_id": "IhXJ-gQyeMN685Lj7Ey38g", "useful": 0}, {"text": "I've eaten here a fair bit over the last year. Most things have been very good. It's a chain so don't expect anything too authentic. I always enjoy the fajitas. One meal that was a disappointment was the steak. I ordered their signature steak, and paid a good sum for it. It was cooked alright, but it was probably more grizzle than meat. I'd save my money and get something else on the menu. The complimentary chips and salsa are always satisfying.\n\nOne thing I don't get is the \"Texas\" names they seem to make the staff use. I'd rather know my server's real name. I'm sorry, no one is named Thelma-Lou in this day an age.", "cool": 0, "date": "2012-12-17", "funny": 2, "review_id": "G6AUPG946hUIdECZFtPC3Q", "business_id": "tw1ure9rLoboPZ0h-ooyWw", "stars": 3, "user_id": "Vs69Q_nKLfBcviqTUnZAzA", "useful": 0}, {"text": "5 stars for the food itself. \n\nMinus a star because of the inconvenience of their delivery service. Sometimes it can take 90 mins for a delivery time to open up. \n\nWith that being said, this is - in my opinion - the best Thai food in Toronto. Their Tom Yum soup is ridiculously good; such a density of flavours, it just blows your mind. \n\nAlso the best Green Curry. At *medium spicy, it's the perfect marriage of sweet and hot. \n\nThe interior is smaaalll and the decor is very simple, clean, straightforward. Nothing to really remark upon. Getting to its location is an adventure in and of itself.", "cool": 0, "date": "2016-07-18", "funny": 0, "review_id": "FLvn0yR3BCCHQoM2n751Pw", "business_id": "YLc7Djf3GsC8IT84YkZMzw", "stars": 4, "user_id": "aaxZW0vKNK88d2JYZHVNOw", "useful": 0}, {"text": "Hired them to paint the outside of our house in QC.  Great work, cleaned up after themselves daily. Worked hard and busted it out quick.   Great results.", "cool": 1, "date": "2015-03-04", "funny": 0, "review_id": "6WnmL4ZaWrOKZfBfWXsH6g", "business_id": "iNkdV6ggGJFa3lYU3fKuqw", "stars": 5, "user_id": "3YcK7r--xwspBdNEW3b2aQ", "useful": 1}, {"text": "I have been going to A Desert Song for now over 16 years since it was at the 16th street location. The staff are very dedicated to their craft and will help anyone, at any level. I would recommend the intro series for the new students, or the basics class. The staff will get to know you by name, and personally help you. Even in a large class you may feel like you are having a private yoga session, especially with the owner Mary Beth.\nAs others have mentioned, this place is truly a breath of fresh air in Phoenix. When I am tense all I need to do is go to yoga and it all washes away. If I need some deeper intervention, desert song is hands down the best place to get a massage in the valley. The practitioners can root out your stress and rub it all away. After a massage here I feel as if all of my stressors in life have magically disappeared. There's nothing that even comes close. They've ruined me for everything else.", "cool": 0, "date": "2014-04-04", "funny": 0, "review_id": "HkXXFaLfzmHmw7Q1abyN5Q", "business_id": "nCEomY3N-sYkoUhIrlMbzQ", "stars": 5, "user_id": "vm6FWtfCglIH06imL1m2wQ", "useful": 1}, {"text": "We Care Family Wellness Center is the most exceptional doctor's office and staff that I have ever found. Every employee here genuinely cares about you. I highly recommend.", "cool": 1, "date": "2012-02-28", "funny": 1, "review_id": "CHFyoDzYWNTbgWjemB429A", "business_id": "EK_pkOQgVQC3Ctx2_a5jcA", "stars": 5, "user_id": "_6p2iK3hniCrYiaSTaXdxg", "useful": 3}, {"text": "We decided to go to this on our last night since a lot of the other shows we wanted to see were cancelled or sold out.  (It was the Monday after the shooting in Vegas, so Cirque du Soleil cancelled all of their shows for at least Monday). We decided on the Ultimate Variety Show on Monday afternoon and purchased our tickets via Groupon.  After purchasing, we called the reservation line to get our tickets, and were told what our seats would be.  However, upon ticket pick up, we were bumped back a few rows.  The man helping us indicated our tickets were for \"general seating\".  Yes, general seating can be rows F-O.  If I called reservation and was told my seats would be in row F, and when I come to pick up my seats, and was pushed back  to row O, what's the point of calling ahead for reservations?  No, we were not pushed back that far, but it was extremely irritating and felt like it was a cunning way of doing business.  By the way, the entire left hand section of the theater, where our original seats were supposed to be, was practically empty. \n\nThe entire process was a mess.  The 1st showing was at 7pm, and they were let out around 8:10-8:15pm.  They started seating the 8:30pm less than 10 minutes before, and when the show was supposed to start at 8:30pm, they were still trying to seat guests.  The show was late, surprise surprise, since people were still trying to find their seats, but once the lights were out and the show started, the ushers were still walking people to their seats with very bright cell phone flashlights - very distracting. \n\nOverall, only 2, maybe 3 of the acts were worth watching, and the rest were a waste of time. I don't think the show is worth any more than about $30/pp.", "cool": 0, "date": "2017-10-06", "funny": 0, "review_id": "ZJesU62ksuc4-Pjxu0Ll8A", "business_id": "A6qvHu4tVEKzwjZjWSCeRQ", "stars": 1, "user_id": "f4leP16tfSE_WkxhV834KQ", "useful": 0}, {"text": "Carolyn Slack\n\nI was at Platinum Spray Tan on August 8, 2015.  I arrived on time and found the door locked, I continued to wait and wait until finally I see a car pull up and a lady gets out.  I told her I was just about to leave, she rolls her eyes and looks away, choosing not once to apologize that I have waited for her. She tells me to undress and that she will be back in a minute, standing there naked, she continues to go back and forth outside the door to bring items she has forgotten back into the room,very much unprepared for my visit.  Each time the door opens I am exposed to the waiting area where clients sit and wait for their turn. Before we get started she has me take off my diamond necklace and tells me to leave it on the chair,at the conclusion of her spraying my tan, I pay the assistant and get in my car and leave.  About 5 minutes later I realize my diamond necklace was left on the chair, I call and text continually until they respond.  Both the owner and the assistant say they never saw the necklace and it is nowhere to be found. I continue to call and text the next 2 days and ask if the necklace has shown up, they both say no, check your car, it's not here. One of the two woman have taken and kept my necklace - these are not the kind of people you EVER want to do business with.", "cool": 0, "date": "2015-08-12", "funny": 0, "review_id": "II-TYCd0yo_nmm9msQ9Stw", "business_id": "S7An_mscIgpmJi4nVWCxxg", "stars": 1, "user_id": "8XgSddzzxdcTZVNHElp2MQ", "useful": 1}, {"text": "Okay. I'm generally a love-it or hate-it girl. Last time, I was so not impressed. But I've been back a few times and the boys and girls working have been much more friendly, and my drinks have been tastier, and the new owner let me try the new hummus she will be putting on the menu. She was super nice and ill be happy to go back to support her business.....I'm also curious what other changes she will make to the menu. Thank you for saving my coffee stop!", "cool": 0, "date": "2013-06-23", "funny": 0, "review_id": "F9cKYiWfQJkqhVLzARMn0Q", "business_id": "OXcK4sbPpLF27b-_79BXKw", "stars": 4, "user_id": "-x5EfjCVUxGX1NGbDabglw", "useful": 2}, {"text": "I have stayed at this hotel 3 times in the past year and a half. There was a reason for that..it was clean, had nice staff, was inexpensive, had no crowds and most of all...no resort fees. As many have stated on here, I went on here a week ago to book a room, and there it was in bold letters..RESORT FEE. You're really going to charge a resort fee for a hotel that's off of the strip? Oh, and what do we get for the wonderful $25 PER NIGHT? A measly bottle of water, some DVD's, and a long distance call..oh and terrible internet? I am disappointed by this and I hope they soon realize that this decision will turn out to be a terrible mistake in the future.", "cool": 0, "date": "2015-08-27", "funny": 0, "review_id": "WN1N9YfllEJqrR5CcsAcCQ", "business_id": "UadjF8_TEWUbuU-QnzQicA", "stars": 2, "user_id": "H3hOAacpaHwIOdb2GJUU1g", "useful": 1}, {"text": "love love the view from the top of the Stratosphere Hotel and Casino. it made a great birthday lunch, it was delicious! Service was great!", "cool": 0, "date": "2012-03-14", "funny": 0, "review_id": "MxAaMj8qb4m4_n1iFgFHXw", "business_id": "R_ZlcX46pPdjhjmfd043LA", "stars": 4, "user_id": "MfGPntpM3IGtHHFOf4qf-A", "useful": 0}, {"text": "I love CPK! this location always has really friendly waiters and staff, and they're usually very prompt, even if it's busy. it's great pizza, and the Tuscan hummus with pita is a great appetizer. I love the wild mushroom pizza. they're willing to do half/half pizzas, which is hard to find at big pizza chains. the butter cake is absolutely divine!", "cool": 0, "date": "2016-07-18", "funny": 0, "review_id": "d2025RAs-K2EBxzJfaBOBw", "business_id": "AUp7fTAH7PwxecdSO_iAhw", "stars": 5, "user_id": "9u_uBl2RTNRJ2FMCHvPnaQ", "useful": 0}, {"text": "The burger was so tiny and when I told the cook perhaps owner all he said was \"really\" no customer service. They don't care about the customer. My brother and I will never eat here again   This is not a gourmet burger establishment. Terrible", "cool": 0, "date": "2017-02-24", "funny": 0, "review_id": "J20xOHCUaG0Vzy_uamJxuA", "business_id": "xAboCt1b_NoMjzTPOGPM8g", "stars": 1, "user_id": "o-RkULLEDlt2VpzTEBSATg", "useful": 0}, {"text": "Found this place via Yelp and it was also mentioned in the Charlotte city guide\n1. Atmosphere is good - its a bar / BBQ joint - doesn't try to be fancy and thats good - beer, BBQ, sports, etc.\n2. I got the sampler that had the pork, pot roast, ribs and chicken with the mac & cheese and green beans - portion wise its enough for two people but it was the only way I could sample everything\n3. Ribs were good - tender but didn't fall apart - pot roast was interesting as it first time I have ever seen that - chicken was chicken - the pork was disappointing - I have made better pork myself. I expected a lot more from a southern BBQ joint - just didn't have any flavor.\n4. Sides were good, but nothing that was jaw dropping\n5. Service was speedy, pleasant and friendly - that was good all around\n\nOverall, I expected more from this place and left thinking that the ribs were the best thing I ate, but overall I was a little let down.", "cool": 0, "date": "2013-09-20", "funny": 0, "review_id": "nKIC3AddfR0_C7sjd6A9jQ", "business_id": "eAZqT24e0Pk8apWzy3RsAQ", "stars": 2, "user_id": "jM9YePr12W78DZyFq-l-Sg", "useful": 1}, {"text": "Champs Family Automotive has been servicing my vehicle for 5 years. I know that i can always count on trustworthy service at a fair price. I appreciate that I can call in with an emergency and the team at Champs Family will squeeze me in for a repair. Thanks Champs Family for keeping me safe and on the road!", "cool": 0, "date": "2017-12-12", "funny": 0, "review_id": "WM6VnH-9pFYiclbhEk7bHA", "business_id": "lbFgv1FrC0ffg5vkVrB58g", "stars": 5, "user_id": "QSBxfPN9TDatEZ_oEuPeDw", "useful": 0}, {"text": "mediocre, nothing special, server was a kid who knew very little.  Food was bland, uninspired and it wasnt cheap. Probably targeted at the Rubes who come for the winter from the upper midwest.  Wont go back", "cool": 0, "date": "2016-01-23", "funny": 0, "review_id": "MHlwFRfOcZKzwg9ClW7RXQ", "business_id": "smBsHggLvIuABgntBvlYLw", "stars": 2, "user_id": "Jrlh_7kglBbP3_4OaUIe6A", "useful": 3}, {"text": "I am sad to report that this place has really gone downhill over the last few years.  I used to enjoy going there, and the food was completely acceptable.  I'm not sure if it is new ownership, or if they are short on money, but the food lately has been awful.  The egg and shrimp rolls are the only thing which is edible.  I had the curry chicken today.  It consisted of 99% onions and then some chunks of a white, watery, tasteless substance which was supposed to be the chicken.  Absolutely terrible.  I ate a few bites and gave up.  My wife had chicken with Chinese vegetables.  It was basically the same, 99% celery and then this mystery chicken.  My son had sweet and sour chicken, and he didn't finish his meal, which is very telling.  He said the chicken tasted funny and the breading as weird.  All in all, it was a waste of 19 dollars.  We just had some sandwiches to fill us up and the food went in the disposal.  Oh, did I mention that the fortune cookies were stale?", "cool": 1, "date": "2013-09-09", "funny": 0, "review_id": "BlsVvU52sl7faIjap5i3lA", "business_id": "7fiRVsawDX0vCpoMTbbxcQ", "stars": 1, "user_id": "BH-doMjs8S2jB_yZG3SY9g", "useful": 2}, {"text": "I came on a Monday night. All beers were 3.79. I think they had a huge selection. I did not get the chance to try the pizza, so I cannot comment on that. It was a pretty cool spot to hang out in for a while.", "cool": 0, "date": "2014-04-28", "funny": 0, "review_id": "peOamCnf8KyKh7siAlBzlg", "business_id": "HjXI6lKGPVNQ8dYJPtaOCg", "stars": 5, "user_id": "m-G5w4-MZbFXRl1S3vg8DQ", "useful": 0}, {"text": "Based on the reviews on Yelp, we decided to try Eleven this morning for brunch. We weren't greeted with a very warm welcome to start, and we were almost seated on the restaurant side but our table seemed a little close to the kitchen (open kitchen concept), so we opted to sit in the bar. The dated couches and decor in the bar seemed like it was due for a remodel, but we wanted to give the place a shot anyway. Our service was overall pretty lack luster, we had a few questions about the menu that either couldn't be answered or were answered quickly with a somewhat short response.. We opted to get the price fixe that included a cocktail, appetizer and dessert. The pastries they brought out were great, although the biscuits were a touch dry/overcooked. Both my husband and I thought our food was mediocre for what we paying, and my steak with the crispy farm egg (egg was delicious and great!) was very overcooked.. Our bartender (didn't mention name) was busy chatting at the other end of the bar, so we sadly didn't order another bloody mary (which was also very good).\n\nOverall we just didn't feel as comfortable as we would've hoped for dining in a nicer establishment like Eleven.. The food was okay, and the place has potential, it just fell short in a few key areas.", "cool": 1, "date": "2016-09-12", "funny": 1, "review_id": "TMRP-BiAf726odFtCEz63g", "business_id": "d2ZQRjuizstCTnicysmpMQ", "stars": 2, "user_id": "DWWIETD4gnvm4EO3Rma-Gw", "useful": 1}, {"text": "Great service. My wife and I got a dining table and chairs. The lady who helped us was extremely patient and helpful. This place is in the middle of a bunch of other store, but is worth a visit. We are definitely coming back.", "cool": 0, "date": "2016-06-20", "funny": 0, "review_id": "IJTlxepOzSALEvctfM4eow", "business_id": "jGajKCm6-urgLQeNyeL-FA", "stars": 5, "user_id": "SmuqmcoBmy2sYJmQF5yCZw", "useful": 1}, {"text": "I have never in my life left the doctors office crying until I entered legacy urgent care. I went there for severe back pain. My first visit I was given medication, X-ray was done and had to get a MRI done. Three days after my first visit I went back in because the medication wasn't working.. When I was asked what was wrong I would begin to explain and would be interrupted every time. I was not given the chance to finish. The doctor gave me stronger meds and sent me on my way. After I went for my MRI I went back into get my results. The doctor explained to me that in the MRI there was nothing really serious and that I should be alright. When I was asked if I was ready to go back to work I informed the doctor that I was still feeling pain. This is when I felt the Jekyll and Hyde situation happened. He went from happy to pissed and 1.5 seconds. He began to yell at me telling me I didn't want to go back to work and he refused to fill out any FMLA papers that I needed to hand into work. He filled out a form for me to get blood work done and told me that my job was in jeopardy and walked out of the room. Oh I should add he also got in my face while talking with a loud voice. I really didn't want to go back there but I was unsure if another doctor would release me for work if they didn't treat me. I went back to get my blood results and to see if he was willing to release me for work. My blood work came back and it showed that I had inflammation I don't know about you but I pretty much think that indicates I'm in pain. The doctor did a 360 and was once again kind. This time he did fill out my FMLA papers and I left there with the intentions of never going back. I did end up going to another doctor that a friend had recommended and brought my MRI results with me. The new doctor also did x-rays and discovered there was a problem. I am now on my way to getting therapy and proper medication. I rarely write reviews good or bad however this time I felt the need to inform anyone who has intentions on going to this location. I know the others have really good reviews and I'm sure their encounter with the doctor went well. Mine did in the beginning too. If you want to go to a doctor who never gives you A chance to explain what is going on with you then by all means this is a doctor for you I wish you luck.", "cool": 1, "date": "2015-04-15", "funny": 1, "review_id": "pnXwTl6_tr3Li5-8BDZQvw", "business_id": "aNickGLG7x7AR8EwiUXVtw", "stars": 1, "user_id": "bsv2CJx74UuEfc1FDW21Rg", "useful": 3}, {"text": "Brought my mother into the ER and was highly unsatisfied. They gave her a dirty sheet. When I asked The nurse for another one she was rude about it. When the nurse  came in to get my mother antibiotics she start off the conversation by saying penicillin which I might add my mother's allergic to. I mentioned to her that my mother can't have that. She then proceeded to tell me that's why I said she's allergic to penicillin. My aunt and I both did not hear her say it. Not sure if I am making much sense when writing this review because I am angry at the moment. My point is not only was I disgusted by the dirty sheet but also by the nasty attitude of the nurse who had a mean look on her face the whole time. Oh and on a side note they can never find the remotes to the TV it's a real not a big deal but if you're gonna spend hours in the hospital it would be nice to be able to have option to watch it I assume that's what it's there for.", "cool": 0, "date": "2016-07-15", "funny": 1, "review_id": "MIxut9ZLPoTe1_VAqjYJ-w", "business_id": "7Zg7fmBxSkwwSP9kekGVmw", "stars": 1, "user_id": "bsv2CJx74UuEfc1FDW21Rg", "useful": 2}, {"text": "Super fun to go with Friends Great attitude with the people fun and enthusiastic!!\n\n its a fun sport to do!! plus you get to shoot your friends with Lasers for revenge lol\n\n hehe!!  Great layout of the ramps and love the rules that they have in place!! Perfect for\n\n Birthday parties to!!", "cool": 0, "date": "2014-03-27", "funny": 0, "review_id": "NfS-u46vxQOwZ1cn4WOT2w", "business_id": "js-UeVMXqnNYEY3ZTydfng", "stars": 5, "user_id": "mTyBkIXOBX0lfma34oypmg", "useful": 1}, {"text": "Disappointed in our meal. The Chimichanga was not fried, just oil soaked tortilla covered with canned enchilada sauce. The salsa for the chips was fermented. It tingled on the tongue. Far overpriced for not so good quality.", "cool": 0, "date": "2017-07-06", "funny": 0, "review_id": "aoC-k39o52HqF9TNJnsDnA", "business_id": "hgo0jDweUcHMHqNDnQQm9A", "stars": 1, "user_id": "Oak_tXlYKdc-6oy9FjA_dg", "useful": 1}, {"text": "I love coffee shops (without a bunch of artificial flavors or as I would call them \"syrups\") and this is one of my favorites. Everyone is friendly. I sat on the back outdoor patio (they have a small front one) and I love the plants, shade (since it's 85 degrees) and the whole atmosphere. Importantly my black pour over was great along with the chocolate vegan croissant. Good way to start my day", "cool": 0, "date": "2017-08-01", "funny": 0, "review_id": "-fjy9QiT0zOjyZbCAnpDAg", "business_id": "63ieHAevJ5szVnClT8FzGQ", "stars": 5, "user_id": "elKr4sYMOUwMYUt4gFTKEg", "useful": 0}, {"text": "This is one of my favorite places to eat and has been for years. I figure who better to write a review on Texas Roadhouse than someone with years of experience.   I've never ordered anything that I didn't like.  The food is always well seasoned and tastes great.  Although it's not a meal (wish it was) my favorite thing to eat from here are the green beans.  Instead of getting two different sides with my order I get two orders of green beans!  I have no idea what makes them taste so good.  The only conclusion I've drawn is that they're laced with some type of drug because I'm addicted to them!!  \nThe rolls with cinnamon butter are also delicious.  I've gotten full off of them plenty of times.\n\nOn top of the great food the service is also really good.  There are also plenty of tasty treats on the drink menu.  Try the Jamaican Cowboy on for size.  This is a great place to bring your friends and family.  The prices are reasonable and this place should exceed your casual dining expectations.  I know they exceed mine!  \n\nSince this is a popular restaurant if you go between 6:30 and 8:30 you may have to wait a bit for a table.  It can get pretty crowded especially on the weekends.  But that should only tell you one thing, Texas Roadhouse is a great place to eat!", "cool": 1, "date": "2012-05-07", "funny": 0, "review_id": "0PqoHAsReB3IdMGq2dvEWw", "business_id": "DwV9lb-2ErTMER4BQWG0xw", "stars": 4, "user_id": "06L7NJYeQMmkWwcb_yho1g", "useful": 0}, {"text": "Pretty good place, a classier alternative to an applebees or chilis. Quite a diverse menu, surprisingly the more elaborate entrees they offer are actually quite good, and priced well for the portions you get. I'm pretty sure they have 900,000 beers on tap. Pretty loud but if you are in the mood it can be a good time.", "cool": 0, "date": "2008-08-15", "funny": 0, "review_id": "5njDTvIo4eTO5kiWausnkQ", "business_id": "A5Rkh7UymKm0_Rxm9K2PJw", "stars": 4, "user_id": "TuAuPTDZEldXkOt0a-n4Xg", "useful": 0}, {"text": "Had them replace a windshield in my vehicle that Penske Auto Glass screwed up. They took their time, were very professional, and did a great job. They also pointed out additional damage Penske Auto Glass did to my rearview mirror. \n\nYou want to defiantly use Ever-Ready for your Auto Glass they were Awesome", "cool": 0, "date": "2013-02-08", "funny": 0, "review_id": "10qINAoNNZfQqdFdeAOmNA", "business_id": "5HiBIzs8SDUE7rHF5rQqJA", "stars": 5, "user_id": "Zj_jtU6B2d6rHaOE7LYmQA", "useful": 0}, {"text": "Never heard about this \"Secret Pizza\" place but my friends say they are the best and it was on a show. Well let me tell you this, it's the best pizza I've ever had. The white pizza is definitely the one to get. Just writing this review is making me hungry and craving for it even though I just had it like 4 hours ago.", "cool": 0, "date": "2015-08-27", "funny": 0, "review_id": "zIXQT3hLQ5KyBLUkLtn--A", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 5, "user_id": "waUrPSBpHvrnrEtSVCEiYQ", "useful": 0}, {"text": "Had a groupon for Dysport & got an appointment quickly.  The staff is nice & friendly.  The nurse was nice and didn't pressure me to buy any extra dysport or other products.  I had my treatment about 2 weeks ago and I am pleased with results so far.  I thought it was weird that the receptionist asked if I wanted to leave a tip.  I've been to other places for Dysport/botox and have never been asked if I wanted to leave a tip.  I do plan to return though.  I don't know how their price range is so I can't comment on that.", "cool": 0, "date": "2017-01-12", "funny": 0, "review_id": "Tmn3wdhPYMB-Sl0imxWphw", "business_id": "ZHiT9EIlnKMqbpBUmxSh_Q", "stars": 5, "user_id": "RowPCV9s-Pxh3qlhtV_Xsw", "useful": 0}, {"text": "Horrible from the very start went in to purchase a new car. I was supposed to meet the internet sales manager but instead im told he no longer works there and have to meet with someone else. We talk and i let the employee know that my trade in is non functional and that if i need to get it towed i can. She tells me no problem there are people she has that can take car of that. Sounds too good to be true. So we go out to look at the type of car i wanted. Test drive one she pulls up and comes back we are discussing terms when i realize this car is no where near the true car value. So i discover a preowned for a reasonable price. I talk to the sales manager and we are making terms i notice a kar alarm is on there so i ask where the alarm is and they day it hasnt been installed yet. WHY WOULD I PAY FOR SOMETHING THAT IS NOT IN THE CAR. Told them to take it off the invoice i dont need it. So be careful they will try and sneak things in on u.  Dont forget to put down any and everything you desire on the due bill and make sure they fufill it. All i wanted was a full tank of gas they gave me a quarter tank smh. Also beware they wont tell you if u been approved or not until they talk to the bank and will have u come back 4-6 times to talk about stuff u already have. They try to stress they dont get paid commission but im sure they do. Beware this is just another shitty ass dealership.", "cool": 1, "date": "2013-10-23", "funny": 0, "review_id": "p88WYG4bunclgMyqts4O9A", "business_id": "fYCRrN3sIQnioWMzF8miIA", "stars": 1, "user_id": "sgfWoGCzZMGuJ_pnn994kQ", "useful": 10}, {"text": "Good food, great service. Husband and I ordered the chicken with mac and cheese and the gyro gnocchi dish. They were both very good. I thought the mac and cheese could have been creamier and needed a little salt, but husband thought I was crazy. Also thought the lamb in the gnocchi dish was a little dry... husband also thought I was crazy about this. We polished off our gluttony with the deep fried brownie. It was good, but I wish we had gotten then brie ice cream with apple fritters. Wine and beer selection was good. We don't get to eat out often and I'm glad we chose this place!", "cool": 0, "date": "2015-03-15", "funny": 0, "review_id": "t7lF8xz2fL3l4fyaXwv3PQ", "business_id": "0i95sgY7pzYW9k88SOVJ8A", "stars": 4, "user_id": "Rdk7bA5zu-7_2ssBLWk_Sw", "useful": 0}, {"text": "I took the Sea Kayaking 101 class. Super rad. The class size is small, so you get a lot of one on one time if you aren't getting something down or want to be able to do something better. They were great at helping us with our strokes so that we could maneuver the boats better, showed us how to do entry and exits using a variety of methods, and showed us some rescue techniques. There was a lunchtime game about this year's coast guard safety facts. They had great equipment and even brought some pullovers for us since it was a little cold.\n\nTo summarize, I balked at spending $95 on a kayaking class, but I am so glad that I did. I will definitely be back to take more classes and I will suggest them to my friends and family.", "cool": 0, "date": "2014-06-14", "funny": 0, "review_id": "ZN4760B585gKRmpfXUvbHQ", "business_id": "T0YcBnoOLijA5YPR8rjtYw", "stars": 5, "user_id": "Rdk7bA5zu-7_2ssBLWk_Sw", "useful": 0}, {"text": "I am conflicted with this review. I like the laid back atmosphere, a place that anyone can just hangout. There are a couple of big sofas and tons of books. There is a small craft draft beer selection, but there is a pretty good craft bottle selection if you are looking for more selection.\n\nThe negative is the general feeling of being worn out. It wasn't that the place felt dirty, just worn out. I know its hard for a place to keep its character and heritage after being spruced up, but I think they could do a little that would make a big impact.\n\nHaving said that, I do see myself spend more time here. The place reminds me of an old university sweatshirt - a bit threadbare and torn, but the most comfortable thing you can wear.", "cool": 2, "date": "2014-11-25", "funny": 1, "review_id": "PyJX6PFjJZuGpvBWyUCSMw", "business_id": "U6ZPS03Nnm-peYC0q_bV6Q", "stars": 2, "user_id": "8xArUHrVys0dH17X36KyJQ", "useful": 0}, {"text": "Our experience at the Rio Hotel in Las Vegas\n\n(I sent this letter to their customer service - let's see if I'll get any response) \n\nOn Friday (8/22/2014) around noon I called the hotel to inform them that we are arriving late and requested for a baby crib to be ready in our room.\nThe representative was very kind and made the comments promising me that everything will be ready on time.\n\nWe arrived at the hotel around 10:30pm and expected to check in and go to sleep.\nThe check in counter was packed and we had to wait, when finally we were able to check in - we were told that there are no King size beds available and only queen beds rooms are available.\nEven though the reservation confirmation said: \"ROOM PREFERENCES\nWe will make every effort to fulfill your preference requests; however they are not guaranteed, as rooms are assigned at check-in. Additional charges may apply for some requests. For accommodation preferences for the physically challenged, please call us at 1-800-CAESARS.\"\n\nI had no choice but to except that - BUT I don't understand, if I'm booking a specific room I should get what I paid for.\nThen, I asked for the crib (which was obviously not ready in our room) and I was told I need to pay for it.\n***On the phone call that I made earlier no one told me about the rooms not being available nor that I have to pay for the crib!***\n\nI told the guy at the front desk, that if I am not getting the king size beds I should not pay for the crib. Eventually he said that he will not charge me for it.\n\nIn addition, he suggested that we will switch to a king size room the day after (Saturday), and to expect a voice mail from the registration desk.\nNo need to mention that no one called us or contact us in any way and we never got the king size beds.\nThe first night was quiet and calm.\nThe second night, 3am a cloud of cigarette smoke took over our room.\nA group of young people were partying in the next room. Doors were slamming, people were shouting and cursing all over.\nAnd then - my 17 months old baby woke up coughing! The smoke was so dense as if someone was standing next to our beds and smoking in our faces!\nTo remind you, we asked for a NON-SMOKING room, which I assume will be placed on a non-smoking floor, or am I wrong?\nIt is unacceptable to me that my baby will wake up coughing in the middle of the night because the room is full of smoke - after I paid for a non-smoking environment. \nIn addition, my parents were in the next room - experiencing that exact smoke experience. My mother just recovered from cancer, and this is a health hazard for her.\nI would recommend to change the air filters because when comparing this hotel to others (Cosmopolitan, Bellagio, Cesar's Palace, Wynn, New York New York, and many more) - this is the hotel with the worst cigarette smell in the lobby. \nThe only good experiences we had are the pool and the \"House Hash a Go Go\" restaurant.\nWe are extremely disappointed from this experience, and will make sure to share it with our family, friends, and colleagues.\n\n\nHere is their response:\n\n\nThank you for taking the time to write and for making us aware of your experience at Rio Las Vegas. Your comments are appreciated as it enables us to identify what we are doing correctly to satisfy our guests, as well as, discovering where adjustments can be made so we may continue providing the best products and service.\n\nI am truly sorry that you were faced with breakdowns during your visit. I hope you will accept my sincere apology. We are deeply concerned whenever our guests are faced with challenges during their stay with us. It's obvious by your email that we have some opportunity for improvement. There is certainly no excuse for you not to receive the best service we have to offer. Many of our customers consider Rio Las Vegas their home away from home, so I am disappointed that the same service and comfort was not what you experienced. It is never our intent to inconvenience or frustrate you, or any customer. You certainly deserve the very best we have to offer.\n\nThank you again, for sharing your experience and concerns with us. I hope you will take some comfort in knowing that all customer comments are taken seriously. Your business is truly appreciated. We hope you will give us another chance to serve you again in the near future. I am confident that your next experience visiting us will be enjoyable. \n\nYours truly, \n\n\nTara Galauska\nTotal Service Central Specialist\nCaesars Entertainment\n877-716-4500 / 702-369-5160", "cool": 0, "date": "2014-08-27", "funny": 0, "review_id": "JXiT_Dhy7KY_19_XAjQv0g", "business_id": "xtYiHTmunjfCN2sUaQxBjA", "stars": 2, "user_id": "4-yGC7mGp802SBC1wJm0Bw", "useful": 0}, {"text": "This place made me sick.\n\nNo, no, not like that! \n\nI just had the buffet and ate too much.  Now it's my fault for being a glutton, I admit, but the food was just too good.\n\nThe servers were very attentive and were quick to offer drink refills and replenish our supply of their amazing naan.\n\nThe food here is so good I'm almost afraid to go back and risk another food induced coma.", "cool": 2, "date": "2012-04-26", "funny": 8, "review_id": "Dp0pBfD3tqDg9toDoE8yVw", "business_id": "tV5PcOIFlB12dpcbCy78VA", "stars": 5, "user_id": "IkqgXfEDidc9QV3fNiZVpg", "useful": 3}, {"text": "Tried Top 10 drinks, the Oreo milk tea with less sugar is really good! The matcha drinks here don't have rich green tea flavors. The fruit drinks are cool for summer!", "cool": 1, "date": "2016-09-11", "funny": 1, "review_id": "vf-SHmAqYoxP90y2YtXnbg", "business_id": "jmTirQw-n4V_Z4g1-RE9iw", "stars": 4, "user_id": "P21_sqRViYAqeQyDXT--Vg", "useful": 4}, {"text": "Dr. Davis and his staff are amazing!!! They made me feel very comfortable (after not having seen a dentist for ten years, I was very nervous!) and explained every procedure in detail.  Pricing is very affordable too.", "cool": 0, "date": "2017-04-25", "funny": 0, "review_id": "y1065ZXiJPru_cfQ920RGg", "business_id": "Yfs8eD5b767z6xBUCxT5nQ", "stars": 5, "user_id": "9xtiLd2QdcT26wH-mSIc8w", "useful": 1}, {"text": "Terrible & Dishonest. \n\nMaybe it's my dumb luck but I've had problems with Jiffy before when getting an oil change that it cost me a road trip in which my car ran out of oil because they damaged my gasket amongst other things. I was lucky to make it back home and all they did was deny they did anything wrong.\n\nRegardless, I thought I would give a different location a try and decided to stop here when I noticed I needed a new headlight. I checked in and told the Jiffy employee that my head light went out and if they had the proper bulb if they could fix it. He said, ok and I went into the waiting room. After patiently waiting for 45 minutes they call me back to to my car telling me the electrical wire is the problem and not the bulb. They said I needed to check if it was under warranty with my dealer.  Unfortunate to have to wait all that time just for that simple answer. Never the less I remained pleasant with the workers and thanked them for their time.\n\nLuckily I have a family friend who works at the dealer where I got my car. After explaining to him the problem he got back to later with some interesting information. My headlight casing was cracked and busted recently and the reason he could tell was because upon inspection of the light they found an epoxy that had recently been applied to the damage area for a \"quick fix\". Another words the \"great\" employees at Jiffy Lube further damaged my vehicle, made me wait 45 minutes while they hid it  just to lie to my face. \n\nI want you all to think deep down to a time where a dishonest mechanic did you wrong (because let's face it, this happens to everyone at-least once.) and maybe you were not only a victim, but a victim whom to no fault of your own is not in a position for justice; then please I ask you to not patron this establishment out of sheer principle. It's not like there aren't many other business that offer the same services. I apologize for such a negative post but if you look at my history I mainly give 4 & 5 star reviews filled with positivity. I'm not some negative spreading person I just hate seeing good honest people get taken advantage of by dishonest people time and time again.", "cool": 0, "date": "2011-01-28", "funny": 0, "review_id": "TKzTovG74KJqArBl8o8MrA", "business_id": "U2eT17Pf0LQTPGMXN9idxA", "stars": 1, "user_id": "bBwN87JuqRXJDkEbX-TWAA", "useful": 4}, {"text": "I've never been so underwhelmed at a dining experience. I would have much rather spent ten bucks for a smaller something in the food court. Biscuits were like rocks. Couldn't cut through eggs Benedict, but I tried and spilled coffee everywhere before giving up. Minimal fruit options. Fresh donut just tasted like grease and nothing else. Almond pastry was flavorless. Coffee was good, so there's that.", "cool": 0, "date": "2016-05-29", "funny": 0, "review_id": "PsaHHblEdisbE7LvFiGpzg", "business_id": "-U7tvCtaraTQ9b0zBhpBMA", "stars": 1, "user_id": "yZqHfR_pPpfBcBKtYdpUtA", "useful": 1}, {"text": "Good hardware store for a small town. Cant get everything but they have a good selection.", "cool": 0, "date": "2017-04-27", "funny": 0, "review_id": "VvkO8QzxmlYOoPYg4uRnug", "business_id": "Z7jJ0ycV8LgXZ3HEcIhR0A", "stars": 4, "user_id": "PZY9PGcqeWn_epPzl8v8PA", "useful": 0}, {"text": "I enjoy their food and I admit I haven't sampled a lot of their menu. To me the prices seem a little high for what you get, I would give them 4 stars if I felt the food quality was higher to justify some of the prices. The staff is always friendly though and the place is always clean.", "cool": 0, "date": "2016-11-26", "funny": 0, "review_id": "TWabG9_dnIqpLz_oASAn5g", "business_id": "pa-C-Vsk9ntuXBGjTr0tBQ", "stars": 3, "user_id": "9E3Tk82NRMACo2KvgGg8JA", "useful": 0}, {"text": "I used to work at Lemar's pizza when it opened, so not only have I experienced being a customer but an employee. \n\nThis is Bradford's Pizza GEM!\n\nThe owner is very strict with hygiene and the freshest product I've ever seen on pizza. \n\nThere is no skimping on toppings and this pizza truly is a party in your mouth!!!!\n\nDefinitely a 5 star pizza! You have to try it!", "cool": 2, "date": "2013-11-28", "funny": 2, "review_id": "eDKLq54a7EYV0oFbqirdiQ", "business_id": "cB4c3zFoHg8j1pSoENNVYQ", "stars": 5, "user_id": "bk2bBVnMyCyhOfYAUPgwkw", "useful": 7}, {"text": "Great mom and pop joint. Stopped in on the way to the airport for late lunch. Pizza by the slice was great and by copilot really enjoyed his steak and cheese hogie...made me wish I had ordered one.\n\nStop in a support your local non-chain restaurant!", "cool": 0, "date": "2014-07-23", "funny": 0, "review_id": "1BGf0EMzCEvAvm0lMTS5Ug", "business_id": "DIdvV0HZUMZWiYg4OXyGJg", "stars": 5, "user_id": "BZRF1Wtt01kd3XSCjM2MXQ", "useful": 2}, {"text": "The service was excellent but the food left a lot to be desired. \n\nI had the linguine carbonara and it was more like scrambled eggs and noodles. Bland noodles. I really wouldn't go back again.", "cool": 0, "date": "2015-10-26", "funny": 0, "review_id": "5mAiJJPmj8aQYGwU3YibaA", "business_id": "RC8NJlX3X2Eo240PU5zJWA", "stars": 2, "user_id": "vxPJ9ww0-iho5uJfhXsk5A", "useful": 2}, {"text": "Great neighborhood joint for ribs. The ribs are tender and smoky. The hot sauce is actually quite spicy but delicious!", "cool": 0, "date": "2016-02-08", "funny": 0, "review_id": "4rbSylRIji_TkiqLy7MH9Q", "business_id": "9sUIgzBxFuGEAObwEEwlHw", "stars": 5, "user_id": "vxPJ9ww0-iho5uJfhXsk5A", "useful": 0}, {"text": "I recently stayed at Harrah's for 4 nights for EDC Las Vegas. I was a little skeptical at first because of the recently reviews but I was pleasantly surprised overall. \n\nPros:\n- On the strip! Love that we didn't have to use a taxi once and even in that crazy 104 degree heat. It was so close to all the nightlife and shopping, couldn't have been in a better location.\n- Price: It averaged about $135 a night (before taxes and fees) but we booked our rooms over 6 months in advance though. After taxes and fees it was actually $164 a night. so not bad but not great either\n- Staff: The staff was mostly friendly and accommodating when they could be. Our bell hop who took everything from our rooms down to valet was wonderful. He smiled the entire time he loaded 4 ladies worth of luggage onto his cart and even had our car pulled around for us and loaded by the time we finished with checkout. The cleaning staff was also very friendly, they happily brought us extra towels and changed our bedding while we were away. Since my friend and I were there for EDC, we made a bit of a mess every day getting ready in the bathroom and even though we told them they didn't have to worry about it, they still tidy up after us. I left the cleaning staff a large tip for our 4 day stay seeing as how they were probably going to be trying to get glitter out of the carpet for a week... \nIn room checkout: Can you say awesome??? Didn't have to fight with the lines with new guests arriving for early check ins. Loved that we could take our time getting packed up that morning to leave.\n- Casino: It was very nice and well maintained, all the machines seemed to be in working order and I even won $120 bucks! Right on!\n- Food: They have several restaurants in the hotel but we choose Hash a Go Go, their potions were MASSIVE and very well priced. My mother and I shared a waffle breakfast plate and we still couldn't finish it all between the two of us. I highly recommend Hash a Go Go, everything there is made fresh and from scratch and you can taste the difference.\nLocation: Seriously an amazing location, they were located in practically the heart of the strip, every direction had something you could see or do. Harrah's also has a Quad located just outside the hotel, it had many shops here and there and multiple food options to choose from. We never had to eat at the same place twice all four days we were there.\n- Extra: There is a full Starbucks just outside the elevators that take you up to the pool and your room. Very nice I didn't have to walk everywhere to find some decent coffee in the mornings.\n\nCons:\n- The 'internet' charge: I wish Harrahs would just suck it up and jump into the 21st century already. They didn't have wireless internet! Not a huge deal but when they told me I'd still have to pay for the in room wired internet even though I didn't bring ANY device that would be able to connect to it, therefore I wouldn't use it once, I was a little upset. We fought at check in to get that ridiculous resort fee removed but with no luck, seriously ridiculous though making a guest pay for something they weren't going to be using.\n- Small pool: I was glad to see they had a pool although it was a small area. For the amount of guests able to stay in the hotel, the pool was totally under sized. It was nice to see they had a bar and a small shop down in the pool area where you could purchase pool noodles, water guns, sun screen, snacks, ect.  They had lots of towels handy but no one seemed to be changing the towels on the chairs after guests left.  We had to removed the wet towels ourselves and find extra to cover because the chairs were damp. Also, they was VERY limited area to sit of lay out and get some sun. There was only 2 small sections of seating where you didn't have to be a VIP member or reserve a table with bottle service in order to even sit in the space. \nConfused guests: Now, I don't believe this is the direct fault of the staff but on Sunday, we had what seemed as some very confused new guests wondering our halls. They began trying their keys in random rooms and started banging (not knocking, they were hitting the doors with their fists) on different doors looking for who I could only assume was the others they were suppose to stay with. When they came to our door and tried their keys, we called from the other side that they had the wrong room. That's when this older lady started banging on the door and shouting at me in a different langue, boy was she surprised to see me (in full EDC make up, fake lashes, glitter and all) swing that door open and ask how I could help her. She just gawked at me and then quickly continued on her way down the hall until we called the staff to come and help them.\n\nOverall, I think I'd stay here again c:", "cool": 2, "date": "2014-06-25", "funny": 2, "review_id": "V2PbZZDn0tGbq0urtmlesg", "business_id": "NY80DkkCfEl198JmwtO4pA", "stars": 4, "user_id": "R7rLR0sZ9kYWUCva_unSMQ", "useful": 3}, {"text": "Good food.  Freshly made in a very timely manner.  Friendly service.  What more could you ask for?  Stoughton loses many restaurants but this\nOne remains strong due to good food and service.", "cool": 0, "date": "2013-12-31", "funny": 0, "review_id": "IxLI3DCBnkv66aZgs6fmiA", "business_id": "khKH3drFrWAGPhCRUS0hkA", "stars": 4, "user_id": "zwbZnvu_dmG07VDF7Hfm5A", "useful": 0}, {"text": "Just a word of caution, they do not quote wait times accurately. We're waiting for a table now and it's been twice as long as what they quoted, and we still don't have a table.", "cool": 0, "date": "2016-06-05", "funny": 0, "review_id": "wXNa_Vw0ObfPpwQqV7tJoA", "business_id": "85nvKTJSN8byoeGRxzGkug", "stars": 1, "user_id": "I530v30vG5b_FB3uytL9uQ", "useful": 0}, {"text": "We've been bringing our dog Hendrix here for a little over a year now. And have recently added our newly adopted Bischon, Blondie. \nWe had been going across town to a different animal hospital, and first learned about Seven Hills Pet Hospital from a dental cleaning via Groupon. We bought a dental cleaning package for Hendrix, made the appointment and dropped him off. About 20 min later, I got a call from one of the nurses saying that he didn't have much tartar and there wasn't really any need for that in depth of a cleaning. The best bet was to get a refund for the Groupon and possibly repurchase further down the road. I was delightfully surprised by their honestly. I was so impressed by their honesty, we decided to change animal hospitals to this one (lord knows this town could use more honest businesses like this one).\nThe friendliness of the staff and customer service (which another thing this town could use more of) is top notch and they seem to truly care about our animals' well-being.\nI would definitely recommend Seven Hills Pet Hospital to anyone looking for a friendly, customer service based vet that will care for your fur babies like they were their own!", "cool": 0, "date": "2016-01-14", "funny": 0, "review_id": "4c9vzlFS3PwXkqs50unrjg", "business_id": "KtCcNaYWB4uCvzc4qnYerg", "stars": 5, "user_id": "TedS4QG2aj5BCAQ-LOIiCA", "useful": 6}, {"text": "Ya, just ok.  I expected better.  food was limited in choices, but tasted good.  Wouldn't recommend it if you want a \"Vegas\" experience, pretty bland.", "cool": 0, "date": "2012-12-24", "funny": 0, "review_id": "NGDmWcZkBbElfP2HyjJoAQ", "business_id": "liGn7sPOvUuy3kcwbhRkbA", "stars": 3, "user_id": "THCMdbKKQus6ti1jgJCBXA", "useful": 0}, {"text": "We love Dr. Leverant! She is so good with our two year old granddaughter and not in a rush for surgery, which we very much appreciate! And we drive 3-4 hours to get here!", "cool": 0, "date": "2016-07-27", "funny": 0, "review_id": "Q5QRCRHRDElhnTmMhx6Yqw", "business_id": "fCxwwGqTy0pNUGu7spnLgA", "stars": 5, "user_id": "pVR9Ttq77oPxvjIE--rWHw", "useful": 0}, {"text": "Having my first korean dinner after I moved to Mississauga. I ordered the beef and kimchi rice and it tasted good, the portion was big and I liked it. My friend ordered a Tofu Stew Soup, the portion and ingredients in it were abundant!  And if you checked in from Miga, you would get a free ice cream!!! \nEnvironment is quiet and clean, and would definitely  visit again!", "cool": 0, "date": "2017-12-07", "funny": 0, "review_id": "afaH-XVk-25dWXAAeoKp0w", "business_id": "IKRh-Kzh2UExFGif5zoiFw", "stars": 5, "user_id": "ghBiGj6YyVNhQ8TCF9v3Sw", "useful": 0}, {"text": "I was so excited to have a waxing place be opened near me. I have gone twice for a Brazilian and both times the experience was horrible.... Very safe to say I will never go back. To summarize why it was so horrible:\n- it was so painful ... I know Brazilians are not pleasant but this was an insane painful experience (likely due to the wax strips)... I have had 50+ waxes in my life and never experienced such a painful wax before \n- normally my Brazilians last at least 3 weeks and I never get ingrown hairs... The lady must have waxed the wrong way I have so many ingrowns after 2 weeks (this happened both times I was there)\n-the lady who did my wax was sweet however did not wear gloves (kind of gross)\n- the room was so hot - which it made if so uncomfortable ... No one likes to sweat while getting waxed\n- the waxing table is horrible... Very wobbly and not comfortable\n- the lady didn't leave the room when I was getting undressed and dressed.\n\nOverall horrible experience. I will never go again. I highly recommend that you get your waxes from somewhere else. Lots of good spots in Toronto (esp. with a cost of $45)", "cool": 0, "date": "2014-11-24", "funny": 0, "review_id": "HyquIxNjZBq4oZwVZiPF6g", "business_id": "OpENRmFWo4BZXiAMCj9PFA", "stars": 1, "user_id": "gAZmmcCQgrGLN5SKSj-JOg", "useful": 2}, {"text": "Nice tasty English muffin.  Coffee flavour was nice as well. \n\nNice server\n\nLarge ceramic coffee cups if you eat in.", "cool": 0, "date": "2016-04-21", "funny": 0, "review_id": "MKE1oHgaH-XKYwxNDSYwfg", "business_id": "WbddSfX26mRGXpyuy2ClYQ", "stars": 5, "user_id": "69suGHxR3PVxicAgmUlhzA", "useful": 0}, {"text": "This place is really great if you've never eaten at an authentic taqueria.\n\nI should have walked out when the unenthused, high-school aged employee didn't know what pastor was and stated they didn't have any. Unfortunately for me, I referred him to the list of meats on the menu. The meat was pretty bland and not even texturally like you'd find in an authentic taqueria. \n\nThe second sign that I should have just walked out was the price, $6.50 for two tacos. Taqueria tacos are supposed to be simple and cheap, $1.00-$2.50 /taco. \n\nThe third sign was when the employee asked what kind of rice I wanted on my tacos.Taqueria tacos are traditionally served with only meat, onions, cilantro, and salsa. \n\nDespite these warnings, I went through with my purchase, and now I'm writing this review. So to make a long story short, if you want authentic taqueria style tacos, you'll have to look elsewhere. However, if you like subpar customer service with food to match, give this place a shot.", "cool": 0, "date": "2015-08-26", "funny": 1, "review_id": "wAL57BPH7O_KzFt3Fzbkkg", "business_id": "QUdJyyDDieR_kdrCU9dPFA", "stars": 1, "user_id": "6KIq2Nx9Fb5bWjPYL3XZyQ", "useful": 0}, {"text": "There are so many things to consider when looking for an aesthetician and Cheri has exceeded my expectations on every level! She is incredibly knowledgeable and experienced which is, of course, critical. But equally as important is her ability to make you feel comfortable and relaxed. She is charming and engaging as she skillfully handles your treatment to perfection. From eyebrows to brazilian waxing and anti-aging facials Cheri is the ONLY choice   for the ladies in Las Vegas!", "cool": 0, "date": "2015-09-05", "funny": 0, "review_id": "J1ZBydROD8QFOuz69ycCBw", "business_id": "zeo5Hxzs2I_el3MBmZB9lw", "stars": 5, "user_id": "xvbFgplD5aB88jMNmWYvoQ", "useful": 0}, {"text": "Lots of fun, especially if you're ready to play along. Found BOGO coupons on eBay before we left for Vegas and they were taken without issue which saved a bundle!", "cool": 0, "date": "2012-08-07", "funny": 0, "review_id": "oxdbEbVLngaLgehsF0fEMA", "business_id": "cf6rtw3f05DlnJ7muIAEgA", "stars": 5, "user_id": "9PuTaCDQYJbDd-ldhViltg", "useful": 0}, {"text": "I loved this place the first time I went however, he 5 or 6 times I have been since seem to be a total disappointment.  Hanging onto my first experience is what kept me going back but I'm pretty sure now I'm down  line is crazy long, which typically would be a great thing however, I have noticed it seems to be because they are disorganized and very slow.  They seem to always be out of something queso, Chios, steak, and even tortillas!  The most disappointing part is he manager can be a real jerk.  He isn't apologetic or accommodating it seems like he could care less that there is a problem.", "cool": 0, "date": "2017-03-23", "funny": 0, "review_id": "mbOdfKRfaoMWsjCE4v6KhA", "business_id": "v0FdDAXvEYieRWcngbCe1Q", "stars": 2, "user_id": "Njv-4WQtdwI9mcjxV-fD2Q", "useful": 1}, {"text": "I attended a reunion at La Serenata and I found this resto is as Italian as the Olive Garden, only much more expensive. We were offered a set menu with selections that, IMHO, were non-Italian. Can anyone tell me if snow-peas and stewed carrots are truly part of Italian cuisine?  I don't think so. They had the nerve to charge an extra $5.00 for rapini because i didn't like the vegetables on the set menu. A plate of tortellini and penne that came on one plate,that's gross in it's self, with a generic bottled rose sauce.I had that replaced with a green salad but it was pretty much tasteless. Now I may be too critical but when you order a grilled fish, should it come looking microwaved and greasy?   \n\nNever mind this resto being overpriced I could forgive them for that if the food was at least good, which it wasn't.", "cool": 0, "date": "2013-09-08", "funny": 1, "review_id": "bJ8Kg425kxuOumhaiuLE5g", "business_id": "AeebTxeuusoChR-RnVP-Bw", "stars": 1, "user_id": "CPaIUp72YKytDhmSCHQVzA", "useful": 0}, {"text": "I love it here! Real Thai Food, real Thai chef! They made me feel right at home. I will be coming here often.", "cool": 0, "date": "2012-11-11", "funny": 0, "review_id": "jXm0rHp-zSn6KbTIi0gD8g", "business_id": "H4OS3reuHtgzFMacqHXniA", "stars": 5, "user_id": "5GtSTBVKXVvJw473uIVCsA", "useful": 0}, {"text": "So far a terrible first experience with Larry Miller service. The service department is slow and unhelpful.  I arrived for a 9 am appointment for an oil change.  Since this was my first visit I didn't know their process, and no one came out to check me in or ask the reason for my visit as I'd experienced at other dealerships. I could see a guy onside the office looking out the window so I thought someone would be out.  Wrong.  I called LM and was put through to the service department voice mail twice.  I had explained the reason for my call both times. After 10 minutes of waiting and a third call, I was told to come inside.  I told the service guy how frustrating this experience has been and has not made a good first impression and received a blank-look insincere \"I'm sorry. Can I have your key?\"  He didn't even ask my name.  This same \"service\" guy had a disagreement with a customer while i was waiting for my car.  This guy actually laughed at the customer!  So, an hour and 15 minutes later and finally done.  The young woman who returned my key and walked me out was quite pleasant.", "cool": 0, "date": "2015-10-10", "funny": 0, "review_id": "ua8_nG5Lh5LMY2cF8m9xxw", "business_id": "f92IodjNA2XI4WKT4Cq8Rg", "stars": 1, "user_id": "ouW2foE7xP8_G34AJjdcbg", "useful": 3}, {"text": "Water began dripping from A/C unit 9/4/16.\nI called Cool Touch Air Conditioning & explained the problems.\nJeff,the emergency on call specialist arrived that afternoon did a thorough inspection and began repairing the issues. He is knowledgable,competent and explains the repairs as he continues his work. This guy loves his job! All problems resolved and A/C in top form again.\nCool Touch Air Conditioning and Heating has been my only company of choice past 11 years.They are dependable ,honest and efficient. Keep up the great work!", "cool": 3, "date": "2016-09-05", "funny": 0, "review_id": "hw_SPwypO4MgenD4PGwzyQ", "business_id": "r1UbgscOfBMCuPBY9icYMg", "stars": 5, "user_id": "ZQvZOTee9ITCP1UD0MAhIA", "useful": 1}, {"text": "Integrity, honesty, and great communication are a few of the words, just off the top of my head, that I would use to describe Eric and the Super Junk crew.  Recently, after years of neglect, I took a weekend and gutted my entire backyard (you would be amazed at the stuff I found back there) and was able to do so with a smile, knowing that Super Junk would be by on Tuesday to cart all the debris away. They showed up on schedule, finished the job, and my makeshift dump site is cleaner now than when I started the project.  When you choose Super Junk, what you are really choosing is peace of mind....and, in this day and age, it is a rare occurrence that you can say that about a company.", "cool": 0, "date": "2017-10-24", "funny": 0, "review_id": "eUypDeo4tHrBjv1l38VCeA", "business_id": "EVl5rbR90yb9vqyq4o5K3A", "stars": 5, "user_id": "Jo6coeeVfyfb_xl0cWjVnA", "useful": 0}, {"text": "Amy's cleaning crew was exceptional.  The three of them spent over four hours thoroughly cleaning my home that was in the process of being sold. I highly recommend her company's services to anyone who has moved out of their home and preparing the property to transfer to a new owner.  The only item of concern was that I was assessed an additional fee that was not disclosed prior to initiating their cleaning services.", "cool": 0, "date": "2017-07-17", "funny": 0, "review_id": "dhT9yBwTPmIG_lMuD_FiQQ", "business_id": "QPyDpartxkCw82ZUIMOHkg", "stars": 4, "user_id": "J5hg0WwZq1YlQvZ0E1urBQ", "useful": 3}, {"text": "This place was awesome! My phone was cracked and wasn't turning on.  They were able to repair it for a very reasonable price in about half an hour! Both of the men who helped me were very professional and answered any questions I had. Highly recommend this place!", "cool": 0, "date": "2015-11-15", "funny": 0, "review_id": "0kXLCT2wzwzVJ39OkcIXPg", "business_id": "TB3y7Uh5ambi8GeL6iwvEw", "stars": 5, "user_id": "1so9mWwgKjV_clgWtt_Hvw", "useful": 0}, {"text": "If you looking for a hotdog on vegas, this is the spot, definetly the best on vegas, must try if you local !!!!!", "cool": 0, "date": "2016-07-07", "funny": 0, "review_id": "tcFkPJmtN9MfOMeYYWN-3g", "business_id": "065c76tt1dXBNmoGBymUgQ", "stars": 5, "user_id": "4nh9aFaF04T8nAHySwyvJA", "useful": 0}, {"text": "Love the painting!!!!  Knew exactly what I was wanting.  A wonderful team and we just loved them.  Beautiful work and wouldn't ever hesitate to call them again when I have more to add.", "cool": 1, "date": "2013-02-12", "funny": 2, "review_id": "geelQ56ivQbhguQU38qEFA", "business_id": "JY4Cw9w_i-Uv1bskekRjDA", "stars": 5, "user_id": "XkWJf7Pomc1g8XINptmYew", "useful": 1}, {"text": "If you're near Oakland and have some free time for lunch, give this place your business. The lunch menu is extremely fairly priced for what you get - the Pad Thai is no joke here. The thought of it haunts me sometimes, it's that good. And unless you're, like, bulking for a bodybuilding competition, you will probably take some leftovers with you. The noodles and rice are also very good.\n\nQuiet, chill atmosphere and no complaints about the service. I can't stay away from this place for too long.", "cool": 1, "date": "2014-06-23", "funny": 2, "review_id": "KgFeEWmCwiz64v9B7qlkKQ", "business_id": "Fpm3WvqtrAg2ueh_4pz7iA", "stars": 5, "user_id": "u0kHjwk9h7OwW1AVCM-Zdw", "useful": 1}, {"text": "I had a wonderful experience when I purchased my car at Enterprise Car Sales.  The purchase process was a breeze from the selection to the finance process.  Great People working over there at Enterprise to get the job done.  Ask for Jordan - he listens and gives the customer the best insight to buying a vehicle.  Go to Enterprise Car Sales!!!!!   You wont be disappointed.  (:", "cool": 0, "date": "2016-06-01", "funny": 0, "review_id": "r0rShKaxbKVlXxteVoxwmA", "business_id": "9gL3XDqhLwU0PKyXlcDj0w", "stars": 5, "user_id": "yrTLzgAU3Jc2oxn6w5RGww", "useful": 0}, {"text": "Went here looking for a new place to eat for date night. What I found was not was I expected in either atmosphere or service. The place is perfect for a nice dinner out, we sat for over an hour and it felt like 20 minutes, the feel, lighting and service was above what I expected. Our waitress was great; Lucy acted like we were her only customers even though there were plenty of full tables in her area. I never had to ask for a refill on my drink, as soon as I was close to empty she was bringing another to the table, she suggested her favorite dishes in all categories and was polite and attentive throughout the meal but not overbearing. I will definitely come back to this place again.", "cool": 0, "date": "2012-02-28", "funny": 0, "review_id": "T3iBaEThpSLHgetvbXtFrg", "business_id": "tcfL9_Qe-12eX4rdmK_6XA", "stars": 4, "user_id": "YbIomoZvTA7mnhifGDGsSg", "useful": 1}, {"text": "excellent food! visitors from out of town alway ask to go here!", "cool": 0, "date": "2017-05-15", "funny": 0, "review_id": "QQfRjtyoUnV8BLQOZF5LVg", "business_id": "wKA2y-F_fPcBDOkpzDB9eQ", "stars": 5, "user_id": "xt3YPtnCiLHvqdaiIHLaSQ", "useful": 0}, {"text": "One of the best steaks you can get in Vegas.  Excellent looking restaurant.  We received a coupon for a Free bottle of wine with our stay at Circus Circus.  The staff was very friendly and funny.  Had a great time and definitely will eat there again.", "cool": 0, "date": "2015-07-12", "funny": 0, "review_id": "DK5hYpFNPo0PujNWO5J62g", "business_id": "bSY97kgQpJ5BrpgW40V1qg", "stars": 5, "user_id": "TVLzZizN9_xGqeg4MAKlUg", "useful": 0}, {"text": "Where do I start. When we first drive up to the dealership we were met by Nick. He was warm and inviting and answered all out questions. He allowed us to test drive a couple vehicles without the pressure of the back seat driver syndrome. \nOnce we choose our vehicle Nick handled all the financing and was successful in getting us the deal we needed.\nThe dealership also kept their word and replaced two tires that had low tread for newer ones.\n\nThanks Beemer Haus for excellent customer service and a painless and enjoyable experience!", "cool": 0, "date": "2016-05-12", "funny": 0, "review_id": "i3ePrueOB5cQrkeNsM2q7w", "business_id": "w4zb3G31oVVmJUfL86YZiQ", "stars": 5, "user_id": "56jhRk2DGSBsJUvYVLALnw", "useful": 4}, {"text": "Not much I can say that has already been said about this place. Food is simply amazing, I recommend checking out there Instagram or pics here if you need some help picking out what you want to get. Secret menu galore", "cool": 0, "date": "2013-11-17", "funny": 0, "review_id": "1znHE8orHQRx-nvuve9sqg", "business_id": "3BCsAgo_1i4xMuTyLKMLRQ", "stars": 5, "user_id": "5WuLl5U8q0cqlMbchdc9Pg", "useful": 2}, {"text": "Holly was amazing. Best hair cut I've had in a year. Those New Yorkers have nothing on her.", "cool": 0, "date": "2016-04-05", "funny": 0, "review_id": "K-dd9RspxetCPyj0nPecrA", "business_id": "6KaNwyNWHFhZlBEV8s6HSw", "stars": 5, "user_id": "E-D8TfpeYreb31XXUL1NUA", "useful": 0}, {"text": "Awesome beer selection ultra fast service service for a busy friday night.  Had two beers at the bar it was sin city ale?  I think .  Anyway great beer.", "cool": 0, "date": "2014-05-31", "funny": 0, "review_id": "8pbAbAdKAHsFSDQQIaZqqw", "business_id": "UTXNr62dGSK-tet8OeXUcQ", "stars": 5, "user_id": "1e8BEktGPUGcFw1CCpBWqw", "useful": 0}, {"text": "Best Hot Chocolate! I haven't had their coffee yet but hands down, Gimme Java has the best hot chocolate! Will travel for the best!", "cool": 0, "date": "2015-05-30", "funny": 0, "review_id": "6KkBHiGYj29XxYI8haAS5A", "business_id": "8Fy2ed0WS7xrTRCVwrRCKQ", "stars": 3, "user_id": "dcD0zxdpn7KX4poRUSOfwg", "useful": 0}, {"text": "Excellent choice for Indian dishes! There were 4 of us and we started with the pakoras, samosas and chicken lollipops. We then shared the butter chicken, braised beef rib and chicken biryanis. All delicious! The sangria is also a must.", "cool": 0, "date": "2016-01-11", "funny": 0, "review_id": "ri7zU59kMpD7CWeZ3mj9OQ", "business_id": "GwpoCSmwfJYo7fyBq_mDZQ", "stars": 4, "user_id": "TOljEoh2tS6s9A42396ljQ", "useful": 0}, {"text": "Worst airport experience just about ever. Had a flight on Swiss Air coming from Zurich with a connection to Philadelphia USA. First problem was that the Zurich flight was 40 Minutes late. That needn't have been an issue however if it weren't for the horrendous job the airport does of directing passengers who have connections out of the country and who do not need to go through Canadian customs. We got stuck behind hundreds of people funneling into a corridor that carried people both to Canadian customs and connecting flights. We stood in that crowd until some figured out that 90% of the people were waiting to enter Canada and people with US connections could fight their way through to a line with no one in it. UNTIL that came to a screeching halt down stairs where they were filtering people through customs and security to get US connections. The we waited in a line of 50-70 people with one - count it - one security lane open. A good 30 of those people - including us had a half hour or less to make connecting flights. Evidently some of the airlines held flights to let passengers pass security. We got through just in time to have made it to the gate only to find they had taken us off the flight because we were too late getting through. next nightmare was trying to locate our luggage to get it out of the airport in order to get a hotel for the night. Never did although Swiss Air did get it transferred to our next flight.\nAnyway complaint about Montreal is the very bad management of traffic through the airport and the most inefficient, badly managed airport security process I have encountered in any of my travels anywhere.\nAvoid this airport for international flights", "cool": 0, "date": "2017-04-15", "funny": 0, "review_id": "PUe6ls3JelL4Z1O9Hyf-dQ", "business_id": "XO2hZb0xC8jTexSHG4SxFg", "stars": 1, "user_id": "GoEg5E3hSY9P9bV7mPsVEg", "useful": 2}, {"text": "First time trying Ethiopian food, and we really enjoyed it!\n\nThe staff was very helpful and friendly.", "cool": 2, "date": "2016-12-23", "funny": 0, "review_id": "qZs3G_Ik9IXkwlm8bFacVA", "business_id": "nPyYW0YymDzs8fqMnyO1fg", "stars": 5, "user_id": "gOUgL-dYQz4Ln3H8TZCKKA", "useful": 2}, {"text": "My daughter started the before and after school program here at this Chandler YMCA about 3 weeks ago and I must say she is very happy here. She is excited to see all of the caregivers, friends and still be able to do a variety of programs that's being offered at this location. I love that the staff is friendly and personable. They even take the time to help the children with homework and other tasks that's needed. Vicki and Brittany goes out of their way to make sure you are well informed. I would definitely recommend this place.", "cool": 0, "date": "2016-08-30", "funny": 0, "review_id": "t3NWCbwLMGDHgDYxptpZcw", "business_id": "79fuk_9Gq3SLVdmn-fz6KA", "stars": 5, "user_id": "oB5UO-k5L2lFIlI7FCyQVQ", "useful": 0}, {"text": "Worst customer service ever! Do not go here!\n\nMy girlfriend purchased a tanning package through the Sunchain tanning website and they would not honor it. After she spoke to their corporate owner the corporate employee told her that she was in the wrong and that her employees were okay to treat her disrespectfully.\n\nIf you guys want a company to take your money, not honor your purchase and treat you disrespectfully then I highly recommend you go here. If you want to be treated like a normal human being I highly suggest finding the dozens of other tanning salons in the area with much higher yelp reviews.", "cool": 0, "date": "2014-07-18", "funny": 0, "review_id": "DnC5SxdnslWKaJnGB62NyQ", "business_id": "LRgyVNCFUrchSaXKzfse3w", "stars": 1, "user_id": "EUX9606ubHmRhIEPs1J2yA", "useful": 1}, {"text": "I love YourMechanic! They do the repairs right at your home or office! You can buy your own parts and they will install them. Car repair shops all mark up the price of parts to make more money. I've used their service twice and will use no repair shops ever again. Both experiences were fantastic. They are punctual, friendly, professional, clean and knowledgeable Scott did 2 belts on my car today. He was a \"10\" in all respects. I recommend Your Mechanic and Scott to anyone who wants: convenience, low price repairs and the job done right!,", "cool": 0, "date": "2016-10-23", "funny": 0, "review_id": "q_KEHfuYBozeZm722gODIg", "business_id": "sNbDcf9mzEl6whsJzrX72A", "stars": 5, "user_id": "6sC3vuDv4-0L_urHj3PDGQ", "useful": 0}, {"text": "I've gotten all my glasses here for over 10 years. They are great and have amazing customer service.", "cool": 0, "date": "2012-09-29", "funny": 0, "review_id": "MloWKet8VoDNgAyP4WUqzw", "business_id": "q2f__ca_iK4ApUrsnBoifA", "stars": 5, "user_id": "KlTg-eZjL4eWskwqU_kq_w", "useful": 3}, {"text": "This place was immaculately clean! The staff is very professional and nice. We were seen right away and had great service the entire time. They run a special where if you come in on Tuesday or Wednesday and get a deluxe pedi you get a free mani. Great special! Also if you are military, student, or teacher you get 10% off! Love this place and will definitely be back.", "cool": 0, "date": "2014-06-26", "funny": 0, "review_id": "yei2_kaM2XGtFtBpNl5LmQ", "business_id": "kRSTvmQaiWB2Dk5dhxat7g", "stars": 5, "user_id": "Wat_Gk9bsYnCkQy7j1f3wg", "useful": 1}, {"text": "My first time in Vegas and this was a great place to finish up my trip. Great selection, people, and price. Best hidden gem in Vegas.", "cool": 0, "date": "2014-09-23", "funny": 0, "review_id": "R3FA4KTMVNtMcoM0sqxiwA", "business_id": "xnu43HypkYDuawBEHYn0qA", "stars": 5, "user_id": "-357TWg2wwUXFIKcu44O5Q", "useful": 0}, {"text": "Went for dinner on a Sunday night, waited for 30 minutes for a simple dish, eggplant with chicken. The chicken was raw, so I sent it back. Then the eggplant was rubbery and inedible. I just walked out, even though I was starving! Never again!", "cool": 0, "date": "2011-07-10", "funny": 1, "review_id": "jknEVo7qdISGfPMS9vGA6g", "business_id": "KskYqH1Bi7Z_61pH6Om8pg", "stars": 1, "user_id": "H_3iz7kj2AUYL7vsWbqSUQ", "useful": 2}, {"text": "First time at Smash and was taking  a colleague for lunch.  I was greeted and seated immediately, but it took the server 15 minutes to come over and ask me if I wanted a drink.  My guest arrived and after another 10 minutes we flagged down another server to get my guest a drink and place our order.  The food arrived (we both had lobster mac and cheese - lots of lobster) in good time and was very good.  I would go back again if I'm the area, but the service was horrible.  The food makes me give it three stars or it would have got two based on the service.", "cool": 0, "date": "2015-05-29", "funny": 0, "review_id": "vSiCtA2SrTwzntjxbIxvlA", "business_id": "wxL9wgxLeuMMfI6SAXIzJw", "stars": 3, "user_id": "XVWx-4bNKdnOWBw8ncSADA", "useful": 1}, {"text": "I heard they are now closed (Peter Street), is it true?  Sad and not surprising...", "cool": 0, "date": "2010-10-19", "funny": 0, "review_id": "DV_6rPw8-Z6DKdK-ZU4uTw", "business_id": "6M-2314iz3xLMGxUAnHoLA", "stars": 1, "user_id": "vHx9FtdWDTOcSLsj6_6WCw", "useful": 2}, {"text": "Love this place! Always great coffee and the employees are always helpful. I am not a vegan but the food is great!! Oh and if you want something cold, there cold brew is refreshing and strong.", "cool": 0, "date": "2016-02-07", "funny": 0, "review_id": "CYjsqAdeq1NZNR7vK7AMvQ", "business_id": "UMqfeCItzQ2glr4d9apGlA", "stars": 5, "user_id": "6Rc0nOBzDKg74mrknfW_hw", "useful": 0}, {"text": "We got there at 5 PM, no crowd, able to park on Highland. Seating was good except the wall seats are REALLY low and my friend across the table is REALLY tall so I did feel a bit small. Background music was pleasant and not overbearing. Wait staff very helpful. I had the noodles with tamarind sauce and #2 heat - it was just right and the vegetables were just the right crisp cooked for my taste. I also ordered the spring rolls which were deep fried to perfection, keeping the filling fresh tasting and not greasy. Don't forget the cash only and BYOB but I checked out their web site in advance so I was ready.", "cool": 0, "date": "2015-09-02", "funny": 0, "review_id": "jOzwQXIIcmFzI1vx5MnqGw", "business_id": "dLc1d1zwd1Teu2QED5TmlA", "stars": 5, "user_id": "NvLhqcTAW3MSGDg_onajxw", "useful": 0}, {"text": "I went for brunch yesterday. I was hoping to order my usual veggie omelette + strawberry crepe w/ chocolate. However, they stop serving omelettes at 11. I had a hard time finding a replacement... I ended up getting a veggie plate.\n\nFor those of you who have not been here before: Marche is set up like a supermarket with certain food stations i.e. Crepe, Pizza, Omelette, Veggie, Grilled etc. You stop at these stations and order. Then they swipe your card. You pay on the way out.\n\nThis location is actually inside of a business complex, the Brookfield Place. It is surrounded by various stores. The restaurant put some tables, food court style in the building outside of the restaurant. This is by far my favorite Richtree/Marche location.", "cool": 7, "date": "2011-07-07", "funny": 6, "review_id": "_UCo2DgV5Ue46hcAs7JnYA", "business_id": "WeKF3N1MK0eJQmZdxPL9pQ", "stars": 4, "user_id": "guwUIVUlQSk6S0FmiQF9Ug", "useful": 7}, {"text": "This is a fantastic store! You can sample everything and the staff is so knowledgeable  and friendly. Great oils and vinegars! Big fan!!", "cool": 0, "date": "2015-01-11", "funny": 0, "review_id": "W8IpWqSLaBy32x9RdERreA", "business_id": "3dZ51ip9N01yYe274jRW1w", "stars": 5, "user_id": "p7cUe3VUn7WpkNF8IqMlvA", "useful": 0}, {"text": "If you are looking for value and you can sleep with a lot of noise this may work out better for you.  This was a Priceline deal that looked too good to be true. \n\nFriendly and helpful staff. Neighborhood looks sketchy. Clean rooms and comfortable bed.\n\nThe problem was noise. Located on an extremely busy road and near a train tracks AND in a flight zone. Many military jets flying over. Was truly a nightmare for me.", "cool": 0, "date": "2015-07-23", "funny": 0, "review_id": "2JjA20I_HPDXns2qZ_IoZA", "business_id": "6YrO-hJNof4wsx4f0YQ8yg", "stars": 2, "user_id": "7_Pn7OaaeHkZDGwMC-iZaA", "useful": 0}, {"text": "Chicago style hot dig restaurant ran by asians. How authentic.  Rather have driven the extra couple miles to Lukes at 16th st and Camelback.  Portions where small, much more bread then meet.", "cool": 0, "date": "2012-09-05", "funny": 1, "review_id": "8LsX38JcynY5Im3AGQ6prw", "business_id": "W7fgRvyxdjr9v4YXLinZtQ", "stars": 2, "user_id": "CrrG2ebNtvrj_68pltZlYw", "useful": 0}, {"text": "A weekend isn't the same without a trip to the public market. I pick up a box of veggies from chowshare/chowlocally, and then often browse. There is everything from produce, meats, breads, coffee, breakfast, juice/smoothies, to artwork, jewelry, plants, knitted clothing, raw foods, essential oils, honey... the list even goes on! I love buying gifts for my family here :) Lots of friendly folks who are never pushy about selling their stuff.", "cool": 0, "date": "2014-11-01", "funny": 0, "review_id": "VtgkTSM0cJUcG8gljcl3UA", "business_id": "_guNmxJd4Ep6S3pBZdAjGA", "stars": 5, "user_id": "t-3YQxj3EunUx_WBUCkPSA", "useful": 0}, {"text": "Very good baked goods.  The veggie hash was very good.  The BBQ was pretty bland--would not recommend.  Great variety in the menu, which is fun.  The server was nice but also very very slow.", "cool": 0, "date": "2015-07-19", "funny": 0, "review_id": "NGQM9Jk3rjO541KpOivwLg", "business_id": "ZEL8SF4BCqYgHyDyDxEUBA", "stars": 3, "user_id": "BRPgV6kaxYLyqSRYje78aw", "useful": 1}, {"text": "This place is amazing! Great service and delicious food. You can tell this restaurant puts lots of love into every plate of food that they make. I'm a mariscos snob having grown up in Baja CA. This place just gets it. Delish, fresh seafood and great service. You can't beat that!", "cool": 0, "date": "2016-04-09", "funny": 0, "review_id": "cylHDqK8zlMGgB84Volo8Q", "business_id": "YTqtM2WFhcMZGeAGA08Cfg", "stars": 5, "user_id": "vmaZAlazK5iA8ePnL_TkmQ", "useful": 0}, {"text": "Do not bother and here is why.  I have worked in restaurants back in the day in the south and have won a few contests for recipes so i feel relatively qualified to give a review about this.\n\nHere's what was good:  the service was good and wait staff friendly.  Portions were large.\n\nHere's what was wrong:\n\n1.  Chicken breast was over cooked (dry) and way under-seasoned. This being their main product, it should have been really good.  Big disappointment.\n\n2.  Waffle was not at all crispy nor very warm (chicken was plenty hot though).\n\n3.  Fried green tomatoes were tasty but the tomatoes were half ripe (pink).  You do not make fried green tomatoes with semi-ripe tomatoes.  They taste different and the texture of the tomato comes out mushy if not green.  \n\n4.  Tea is a Southern soul food staple, however Phoenix water is crappy and the water there is not filtered.  You can definitely tell this in the tea. \n\n5.  Sort of expensive considering.\n\nWe also had cornbread and it was okay.  Nothing to write home about.\n\nWhat i am saying here is this is an approximation of Southern soul food but it ain't the real deal.  It came off like a trendy chain restaurant getting by on average ingredients.  \n\nJennifer B.", "cool": 0, "date": "2014-06-19", "funny": 0, "review_id": "IiNTLyyzyxjNJh98ZXGfnA", "business_id": "YPavuOh2XsnRbLfl0DH2lQ", "stars": 2, "user_id": "rrI2CYgzV_qtaB6rTgHYOg", "useful": 0}, {"text": "This is an amazing place!!!!  As far as bistro's go this place tops any one that I have been to in Phoenix.  Everything they serve is absolutely amazing.  The cuban pork is my favorite, you can add it to a salad which I think is best, get it by itself or even get it in a sandwich!!  The salad bar has like 40 different things to choose from in your salad which is always a big plus to have.  I would reccomend this place to just about anyone, as long as you are in the mood for a delicious sandwich, pizza or an awesome salad!", "cool": 1, "date": "2010-11-19", "funny": 1, "review_id": "HpJAsKIPqiSKFRIQ6TBFZg", "business_id": "lOYwF4VUJKe2BJ0i7zZeYQ", "stars": 5, "user_id": "NoHjHyKbIYPYGFXUfpmtSQ", "useful": 2}, {"text": "Good .. I actually like this establishment..good people too.. They seem okay anyways.. I'm not going to say anything that can be misunderstood. It's better than many other places in Pittsburgh.. Believe me I have checked", "cool": 0, "date": "2016-01-25", "funny": 0, "review_id": "nuU7DUyrI4MhFqxDhU7d8g", "business_id": "3ncW0rqy9EQt6YZ9IkeXvQ", "stars": 3, "user_id": "pL9oSNSWZXJZq8dyEyhHbw", "useful": 1}, {"text": "A group of buddies and I have been going here every time we visit Vegas - been going for over 12 years. This year was not their best effort.  Started when we were seated - they 'forgot' to even give me a menu.  Really?  Isn't that kind of 'seating 101'? \n\nThe food was 'good' but not 'great' like it has been in the past.  Then they had \"an issue with the oven\" and it took over 25 minutes to get our chocolate souffle.  And when we were done it took another 20 minutes to get our bill (although they did take the cost of these off the bill).  \n\nShould have thought something was up when at 7:30 there were only 4 other tables occupied in whole restaurant.  Really too bad, it used to be a really nice place with great food.  We will give it only one more chance - then it will show the beginning of a pattern.", "cool": 0, "date": "2017-05-08", "funny": 0, "review_id": "bDHqAZq0x7Y3p5qRHMa5Sw", "business_id": "1Df5WnLX3DqN6ymlhqznaQ", "stars": 2, "user_id": "MVDi-pL4jbRqdUTucJPh3A", "useful": 0}, {"text": "This was our first time at Scrambles, and it won't be our last. Great breakfast, good coffee and attentive service! Our server, I think her name is Lynette, was very kind and we enjoyed chatting with her.  We went around 2, and I thought we would be rushed or get sort or the \"leftovers\", but the food was delicious!", "cool": 0, "date": "2016-11-11", "funny": 0, "review_id": "JyJhMz7zr-C0h6e1xjYJhg", "business_id": "SKB_FQT41ATIo3zIy0Uipw", "stars": 5, "user_id": "L3p7Bw8fqoYQgyyCdROYGg", "useful": 0}, {"text": "Kari's my girl! Awesome educated esthetician, she knows her stuff. The products are great, my skin couldn't be happier! Friendly staff, all around amazing experience every time. Go see Complexion by Kari!", "cool": 0, "date": "2015-06-03", "funny": 0, "review_id": "ehwMn3gE7jz4jhH6NsLY9g", "business_id": "F4Q1K6fUVpMP7eGEHJ3RKA", "stars": 5, "user_id": "0chzcy7PU1VLkDIU_MV4LQ", "useful": 0}, {"text": "This place did not disappoint!  The food wings are great. Doesn't look like much from the outside, but don't let that stop you. The lemon pepper and grilled teriyaki wings are awesome.", "cool": 0, "date": "2014-07-26", "funny": 0, "review_id": "l45YzxE0oMB4YQnPF0XCHA", "business_id": "dPWHFb_sDduzcJdOZSqR5Q", "stars": 5, "user_id": "zDQubsHfvv46Dqrmj0BoSQ", "useful": 1}, {"text": "The fox and hound is located in the Birkdale shopping center.  They have a good selection of beers on tap and awesome drink specials.  They also have a full dinning room that services until late into the night if your looking for a little more than \"bar food\".  If your looking for a place to watch the UFC fight then this is the place.  It's gets busy on the weekends but a fun place to hang out with friends.", "cool": 0, "date": "2008-08-14", "funny": 0, "review_id": "0EeR547wiP_3N-gB2ixBqg", "business_id": "pKX8dGwgogydrBupj6HGLg", "stars": 5, "user_id": "dcmalio_QvAuehLhwc0xSg", "useful": 0}, {"text": "Poor service, and seems like they don't care about quality of food. So, funny thing is we were on our way to Texas Road house, which is right next door, we turned in the wrong parking lot and decided to give it a try cause we had never been to a Lone Star Steakhouse before, but frequented the Road house back in the Midwest.It seemed their prices were a bit higher, but for a good steak well worth it . I ordered a 8oz sirloin with a baked potato and salad, around $14. I also got a margarita. The waitress was prompt, but seemed maybe fairly new cause she didn't know much about the menu. She forgot our waters and came back with half a loaf of bread and forgot again. The bread was not very good and butter was unspreadable. The bread was cold so it just kind of tore apart. One slice each and we were at the end of it. Our salads came and before I could ask for more bread she was gone. My salad was way over dressed. And because it was a vinaigrette I kept coughing at the abundance. I had to chug my magarita cause no waters yet. They called it a chopped salad and I see why. Like litterly every piece of cucumber was a shaving of skin. Its like they peeled the cucumber into my salad. I even had a  lettuce end in my bowl! I wish I would have picked two sides instead of the salad now. margaritas were ok, not to strong but lacking something. I like that they brought out the glass and shaker so you get a little more in your glass. So it was more like one and a half margaritas. But for $9. So on to the meal. Both steaks we asked cooked medium. They were well done with only a little tiny pink in the center. Not a single drop of  juice on my plate or in my mouth. Dry and tough. I don't usually like to complain at a restaurant unless I really need to. I thought about it, but they would probably offer to recook it and we had plans after. Also I know it's hard to eye a steak with out weighing it, but my husband got the 6oz and I got the 8oz, but his looked bigger than mine.   My husband added on shrimp to his. It came with 8 shrimp on two screws on a bit of rice. He shared with me and the rice was good and so were the shrimp. They were cold though, but they do cool fast. I was just so disappointed that a steak house doesn't know how  cook a steak and their so called seasoning sucked. I could tell the waitress knew we were unhappy cause she avoided us like the plague. I think she over heard us talking about how tough they were. She only came back once to quickly grab our plates and said let me take these for you. Never asked how anything was and returned with the bill just setting it and leaving. She was not a good server. Because of the service, food quality and lack of basic cooking skills we will stick to Texas Road house if we want steak at a decent price.", "cool": 0, "date": "2016-12-10", "funny": 0, "review_id": "FKcnWeOkcdQruzuDYFB1Ug", "business_id": "U5P2sECeftfwaHos6h-2kQ", "stars": 2, "user_id": "I9IqqJYtRsamLZ8S_yewCA", "useful": 0}, {"text": "Great service and follow through. Had an issue with headlights shorting out, Ray phoned and had the problem remediated within a few hours.  Also had em rotate the tires while at it. I recommend Ray and his team for any work you may require for your vehicle. Great guy and patient and most importantly...honest.", "cool": 0, "date": "2015-09-30", "funny": 0, "review_id": "Pa8H1KBmkVyeL817l64YFw", "business_id": "TSpibPgGew7XD__errnftw", "stars": 5, "user_id": "NNBmHL_v9vT2LYuIJdm1Vw", "useful": 0}, {"text": "So, my husband and I earned a free meal at this restaurant after playing the slot machine and decided to try it out. Initally when we first entered the place, there was no hostess and no one acknowledged that we were there, we waited about 5 minutes. Once we were seated, it took the waiter about 10 minutes to come to our table. We ordered an appetizer and our food at the same time, it took about 20 minutes for the appetizer to come out and our food took an additional 20 minutes to come out. When we first arrived it was close to 3pm and it was not busy. The waiter never refilled our drinks or checked if we needed anything. After asking for the dessert menu, it took 10 minutes for us to receive that and once we asked for the bill, it took an additional 10-15 minutes. People that came in after us received their food and service faster than we did. This may have to do with us having a free meal or some other reason. The food we actually did enjoy but don't think we will be returning to this restaurant.", "cool": 0, "date": "2014-06-17", "funny": 0, "review_id": "kmoBBg3PusIcezStrZDbjw", "business_id": "klddGAcNIpE_aB5sd1hNXw", "stars": 3, "user_id": "t9c2OAxQysQeMPrGWGLv5Q", "useful": 0}, {"text": "My wife and I recently purchased a house in North Carolina. Currently, she has started her job in NC and I'm still out in Phoenix. Our dishwasher in the new house is broken and my wife put in a repair request on 2/4. On 2/10 a representative from Sears came out and looked over the dishwasher and ordered the replacement part. That part is currently sitting at our house. So far, we've paid a $75 service fee to the Sears repair technician they sent out.\n\nThe repair technician set an appointment yesterday for 1-5pm with my wife. My wife took off work to be there during that time frame. At 3pm the tech called my wife saying he was behind schedule and would be there around 5pm. At 5pm he called and said he'd be there at 6pm. At 6pm he didn't show up and my wife called him and he said it would be after 7. The tech then called at 7 and wanted to reschedule the appointment(two hours after the allotted appointment time frame was over) but my wife told him that wasn't possible as she had used up all of her time off waiting on him for the scheduled appointment window. The tech then never called back, never showed up, and rescheduled us for March 2nd without speaking to my wife to see if she could even be available for that time.\n\nThis morning I called the customer service line and spent 1 hour, 38 minutes, and 12 seconds(this site doesn't allow me to post pics but feel free to review the pic on my reviews on Google, ConsumerAffairs.com, and Facebook) and nothing was accomplished. I spoke to three separate representatives, the first who put me on hold only to transfer me back to the automated menu. I then waited until I could speak to a second person who tried to assist but was unable to. She then transferred me to the escalation department who also wasn't able to assist at all. \n\nHere is a summary of those conversations:\n\nI explained the scenario described above and was apologized to for the technician not showing up. They offered to reschedule our repair for a M-F business hours repair time. I explained that my wife no longer had any time off she could use and I'm still in Phoenix so I cannot be available. I was then told they had no options for after business hours or weekend scheduling and they would schedule us for a time frame during M-F during business hours. Again, I explained that wasn't an option as my wife has no more time she can take off.\n\nThey continued to tell me they wouldn't be able to do anything for us other than try to find a different local company that MIGHT(she couldn't confirm anything as she couldn't reach any of the alternative vendors) be able to make those hours work but the entire process would have to start from the beginning, the review, the part order(because no other vendor would use the part sitting at our house as it came from Sears and not their company - this is normal warranty protocol, I understand that), and the scheduling(which may or may not be the same exact scenario where they can only come out M-F during business hours).\n\nAfter spending 1 hour, 38 minutes, and 12 seconds on the phone the escalations department representative(Vicky) hung up on me and proceeded to push through another order for a smaller company to come out(I never agreed to this) and will now charge us another $75 service fee and start the entire process over. We've already been waiting since 2/4 to get this taken care of. The company refuses to take care of the fee or to work with us on availability after their representative never showed up. This company refuses to help in any tangible way other than to tell us that none of it is their fault.\n\nWorst customer service I have ever dealt with. I am disgusted with this company right now as I've worked in customer service my entire adult life and would never let a scenario like this stand. HSA Home Warranty you need to make good on this scenario.\n\nFeel free to contact me directly as I'd love to come to an amicable solution to this but your company seems unwilling to bend in any way considering we met our part of the deal and my wife wasted her time yesterday waiting on your repair tech who never showed up and she can no longer take the time off required for one of your windows. We have paid our fee, we met our end of the bargain by being available, now it's time for your company to make this right.", "cool": 2, "date": "2017-02-23", "funny": 0, "review_id": "BHwIngKm6tmAiYgd6zU_nA", "business_id": "DWE6wntgvTMXX1-w7IIJOg", "stars": 1, "user_id": "mdmaW-ZOBNsr5gLigKZF4A", "useful": 6}, {"text": "We have only had breakfast to comment on. The Bloody Mary bar was great. The pancakes fluffy and the waitress was great.", "cool": 0, "date": "2014-07-08", "funny": 0, "review_id": "rbbM1Hs-ysIeRZp17LsHAw", "business_id": "YOD9dXrnpu8HTRILpF0onw", "stars": 4, "user_id": "uVsC2P51eMtxK5mdMPqvZQ", "useful": 0}, {"text": "Absolutely excellent! Fantastic experience I had with my friends at this place. It was great fun, the games were challenging, and the staff was really nice. Would definitely come back again!", "cool": 0, "date": "2015-08-18", "funny": 0, "review_id": "BQsihc98VQbGIYx_YSD4BA", "business_id": "Zsp-V_d5HE3YjKvCiVw-Ig", "stars": 5, "user_id": "ckK9g0CsbBvPEIhpBy1IvQ", "useful": 2}, {"text": "GREAT place! The service is good, but the food is EXQUISITE! And it's halal, so even better. I had one of the best steak quesadillas I ever ate yesterday here. 5 stars all the way.", "cool": 0, "date": "2011-07-22", "funny": 0, "review_id": "-Pb-7iqi_udO3BgyuCbiNQ", "business_id": "K09jQZzbx8JBrhBohJwEvA", "stars": 5, "user_id": "8gAUY1YcqPLHvT6s371lRg", "useful": 0}, {"text": "I worked with Jessica on the on the phone. She was pleasant and efficient! She got me my paperwork very quickly, and made the process as pain free as possible. I am very happy!!", "cool": 0, "date": "2017-04-03", "funny": 0, "review_id": "J5ulDHjhti_T_A5TB0QG7Q", "business_id": "n6sG_NVGr_I1wObT73W4Lg", "stars": 5, "user_id": "IPGM6CtG9MGuMZVTmJgdEw", "useful": 0}, {"text": "Here's the truth. I now live in NYC. Most of my family still lives in the pittsburgh suburbs.\nAfter SEVERAL expensive, less than satisfactory and even BAD color jobs in swanky NYC? No more.\nI have been coming here to Kaylee for a year and a half now and it is not only exactly what I want, which is keep my natural color but cover grey and sun fading....but it is absolutely affordable!\nEveryone is super friendly.\nThey are prompt.\nShe saves the color formula in their computer so there can never be any question.\nAnd the biggest thing? This color lasts!\nAs in I had to push it to 9 wks once? And though I thought I looked hideous?\nEveryone that tells me the truth assured me even at that point nothing was obvious unless you really inspected my scalp in good lighting.\nAnd I have semi dark hair!!\nCall and make an appointment!", "cool": 1, "date": "2013-05-30", "funny": 0, "review_id": "00W8tH1h7dZ_KG8PdcgeSQ", "business_id": "TJi8Ec6WBsMpIOv9mQcmgw", "stars": 5, "user_id": "8UAT3iHI4h0XfwjHxf6S2A", "useful": 2}, {"text": "I went to Khristine last week for the first time based off of Yelp reviews! I was sincerely impressed with her professionalism, skill and overall business. Also, she is very personable and sweet. One of the few stylists that didn't answer the phone during my time with her!\n\nShe spent 3+ hours on my hair and I left with a great cut and color that I have managed to do at home since. \n\nThis is not a cheap salon so don't expect to come out of there with a salon style for a CheapCuts price. I didn't really ask about pricing prior so I did spend more than usual BUT you do get what you pay for. I will be back!", "cool": 0, "date": "2013-09-20", "funny": 0, "review_id": "sM5hB9KvEhOftMW-F_TSUQ", "business_id": "_qptLUIlMUqd0WaQq1weWQ", "stars": 5, "user_id": "Ax3x2-trTyNVkc3XN49F9w", "useful": 0}, {"text": "Food is good but the service is horrible. Employees eating wings as they are cooking them... I had to wait 15 minutes over my expected time only to find out that my order was just sitting there.. Apparently too busy stuffing their own faces to call out my name..", "cool": 0, "date": "2015-12-14", "funny": 0, "review_id": "Gjbu1-_NIKPIl2_BLcRI_A", "business_id": "arFyWH26WkKjGEnh3FNXww", "stars": 1, "user_id": "TqyFopUFINWEuRM4DfSNYQ", "useful": 0}, {"text": "We frequent hillside spot and generally love it-  I do have to say however, that I have found the food to be pretty inconsistent. There are times when I order something that I've had before and it is completely different then the last time I had it.  I know a lot of people complain about the slow service but that is actually one of the things that I enjoy about this little kitschy place- it is laid back and my friends and I can go sit for hours.  The servers are great and friendly and I love the atmosphere- I would just love to see more consistency in the food.", "cool": 0, "date": "2014-01-03", "funny": 0, "review_id": "9k7i1XFAYmTGKjofCFDaMA", "business_id": "fKm6mfATDJRDDQH0PtZeeQ", "stars": 3, "user_id": "RyHnzR_c4AnCExnqnme2UQ", "useful": 0}, {"text": "Very slow....  ice machine was still down, sold me a drink... i was okay with no ice... then was told ice machine was down... paid for soda but ended up with bottled water... 30 minutes for chicken teryaki... wasnt that busy either... light lunch rush", "cool": 0, "date": "2017-04-03", "funny": 0, "review_id": "HKY2wBO4UkLGekPBNZCH5g", "business_id": "oHUJ32cUOpP1qe36CURKEg", "stars": 1, "user_id": "7LKvCwqN313q6IztMIIpgA", "useful": 0}, {"text": "I ate here a couple of times. I had two different salads with some changes. Very tasty, good quantity, fresh and served with friendliness. The go to place for lunch.", "cool": 0, "date": "2016-07-08", "funny": 0, "review_id": "hmILjWz4aGdmUp-LGGlatw", "business_id": "fpwMWuKAR8joNW1B4N3e5w", "stars": 5, "user_id": "uI3XNX103h4Csi77ICsjmA", "useful": 1}, {"text": "Great coffee, great doughnuts. Just a difficult layout of parking and drive thru, but that doesn't matter to me.", "cool": 0, "date": "2017-04-08", "funny": 0, "review_id": "aPmIwsl23gaT6FTaYXRBEg", "business_id": "NLhUBtoBzqcABJEAXLWT5Q", "stars": 5, "user_id": "wfDboa2ybTGMkpR3Hs-fgg", "useful": 0}, {"text": "this location is kept clean and organized, which makes things easy to find when in a hurry like i happened to be in today. one of the staff members seemed a little irked by the fact that i accidentally let the dressing room door close behind me on my way out, and seemed a bit confused when i asked him if i could leave few items of the clothes that i had decided not to buy with him because he was standing right next to the rack used for items going back out onto the floor. i didn't think much of that interaction because the clerk at the checkout counter was more than respectful. every item with a green tag on it happened to be on sale for a dollar so that was a pleasant surprise. i went inside to buy a pair jeans and i came outside with a bracelet, a jacket, a pair of jeans, a shirt and a poncho. goodwill always has been and always will be my favorite store in the universe!", "cool": 0, "date": "2015-03-06", "funny": 0, "review_id": "a2UHohg_Ugha0qLTXMEuyw", "business_id": "tYAOVeGuGKk78TyzQzVcpg", "stars": 5, "user_id": "J4U2wHonLruHUGoVieNgFA", "useful": 0}, {"text": "Really the food tastes like home cooking..price s also reasonable and love it.hope to see the restaurant to add more menus in the future", "cool": 0, "date": "2017-11-26", "funny": 0, "review_id": "erSx539feRmLS80GxxeVeA", "business_id": "2B4bC4w4PDC8Pj53SfTG2g", "stars": 5, "user_id": "4EqVzE35BxQOudwzrpGAXA", "useful": 1}, {"text": "Went to Euro Cafe last Friday evening for a bite to eat before a 7:30 show at the Hale Theater.  We arrived at 5:30 ordered 2 glasses of wine and 2 beers immediately and our dinner by 5:45PM.  The salads for the two entrees that came with a salad were not served until 6:22 without waiter apology or and update as to what was happening in the kitchen.  The four entrees finally arrived at 6:36, more than an hour after we arrived.  Not satisfactory at all! The place was packed and looked very under-staffed.  On a show night, they should be more prepared to get guests in and out.  We received no apology, no offer of any kind for our poor service.  I ordered a simple Greek Salad that was so covered in feta cheese, that I couldn't eat it, too overwhelming.  Not a return visit in our future.", "cool": 0, "date": "2013-08-12", "funny": 0, "review_id": "SCxJGr62pTdSylC_ZFU29Q", "business_id": "Gh-qmVwvibLnNdqEZXcQHw", "stars": 1, "user_id": "67ebuu5KRvgG_Q_G5JVwsA", "useful": 0}, {"text": "They advertise sale prices. But will not sell the item for the advertised price. They add a \"white glove\" delivery charge. You cannot pick item up in store for advertised price. Then at check out they add Another 10%. FALSE ADVERTISING!", "cool": 0, "date": "2017-05-20", "funny": 0, "review_id": "A83jKy6Jv-FnN1zy84rkkw", "business_id": "SG8gjkIkbT13Jc6TdxHBxQ", "stars": 1, "user_id": "-C-nRpki-advfrXfvGnTHg", "useful": 9}, {"text": "I've been here twice before and I've always enjoyed their food. I came again on a Friday night with a friend and the service was a bit slow, but they were quite packed and busy, which is always a good sign :)\n\nI ordered the golden dragon roll(?) and it took quite a while for it to come out, but aside from waiting, it was well worth the wait because it was amazingly delicious.\n\nI'm a sucker for anything with salmon sashimi. The rolls were slightly warm, but you could tell it was freshly made on the spot. I would definitely go again to try out their other rolls :)\n\nWhen I immediately smile and have a huge grin on my face, you know it's good haha", "cool": 0, "date": "2014-02-15", "funny": 0, "review_id": "noyvNSTIaTPVSsV6J_dKDQ", "business_id": "mh2MPYt7_1lQTAZuOJrjOA", "stars": 4, "user_id": "6e0Eos777mtO3qNa625TyQ", "useful": 0}, {"text": "Parking Nightmare - Never saw the show!\n\nWe paid $200 for my wife and I to see Wicked.  We arrived in the area 45 minutes before and fought trying to get into some parking until 55 minutes into the show.  I got up to the lot and was told that there were no more spots (despite seeing two in the row next to the road).  That was enough for me.  I chalked it up to a waste of $200.  I will be hard pressed to ever go there again!!!  Figure it out folks.", "cool": 1, "date": "2016-01-16", "funny": 0, "review_id": "QcmueWsl25se1fuoMovtKQ", "business_id": "jeNnKFuf2WoehJlJSidKuw", "stars": 1, "user_id": "k_hR5J41N25QHTluoVB-uA", "useful": 6}, {"text": "The Mill Street Brewery disappointed me and my friends. Coming with little kids to a place wasn't a good idea in the beginning, but I was shocked by the level of service we were provided. One of the waitress refused to take our order at the patio and then transfer our food into the dining area. Then management got involved and finally after 20 min of wait the food was ordered. Then it turned out they forgot to send our food to the kitchen, IT TOOK 1 HOUR TO GET FOOD which was absolutely tasteless. The waitstaff and management showed their indifference to clients. They have their business because of tourists and travellers who come there because of beer, so it seems like they do not care to lose one or two. Although beer was good there, we will unlikely to come back!", "cool": 0, "date": "2012-09-18", "funny": 1, "review_id": "5z-mKmfVhdzEcEyHu45J4A", "business_id": "K6XIGkyk7-fuOQtA8i7p6A", "stars": 2, "user_id": "k6RFn53Ww6_lZw7E06lRCQ", "useful": 1}, {"text": "The package states that the 1500 thread count sheets \"feel like Egyptian cotton\" but they are in fact only microfiber (which isn't stated anywhere on the package).  Luckily I bought them on sale ($40 for a queen set) so I don't feel too scammed.  We'll see how they hold up.", "cool": 1, "date": "2013-08-18", "funny": 1, "review_id": "IdMw_BQEWiT989wnN1Gm7Q", "business_id": "geoWxC7dz7CKR_bqsTFiJA", "stars": 2, "user_id": "4qpELMgBdLynz9FwdgbnTw", "useful": 7}, {"text": "Just had breakfast at the Inn this morning - the lemon ricotta pancakes are awesome!  Will be downloading the recipe for sure.  Also had some great conversation out on the patio - what a beautiful place.", "cool": 1, "date": "2012-07-10", "funny": 0, "review_id": "wI_i2DKngAs8eprra_24iA", "business_id": "lQgO_uT6KUAzTLUqTTspcA", "stars": 4, "user_id": "8AjQ3batyDSuAm5nP59pkQ", "useful": 0}, {"text": "Thoroughly enjoyed my experience here ;]]. My friends and I were trying to find a place to eat with good atmosphere, food, and drinks--this place had it all.  My food was good and came out quicker than most of the restaurants I've been to in Montreal so far. It is a bit overpriced [hence no 5 star], but their hot-as-fux male waitstaff more than made up for it. Very nice and responsive and HOT.  Would come back for the eyed candies any effing day.  ^_^v", "cool": 0, "date": "2014-01-02", "funny": 0, "review_id": "i3qoJL__Uu5oQJl1Djs8sw", "business_id": "-iQdfdTpXa3Y-WC5OJGTfw", "stars": 4, "user_id": "boBxc4pHB10DNWD1cxRVVg", "useful": 0}, {"text": "This place is in a bit of an obscure location, but don't let that fool you. It is amazing as soon as you approach the door and the man standing outside opens the door for you. The staff are pleasant and friendly. The massage staff are amazing and thorough. The pedecure staff are friendly, talkative without being too chatty and did fantastic work. \n\nYou have access to the Hotel amenities for 24 full hours. The atmosphere is beautiful and has a very relaxing ambiance.  The locker/shower area has all sorts of products to use, like aerosol deoderant and hair appliances to freshen up at the end of your service.\n\nI had ordered a glass of wine at the start of my pedecure and didnt receive it until after it was done so they made it on-the-house. That always makes me happy. :) \n\nThis place is great. Don't let the bad reviews deter you. Try it for yourself.", "cool": 0, "date": "2016-03-21", "funny": 1, "review_id": "ec2WH9WJcX5xkjVEN1zDFw", "business_id": "oH4iqq4kjJfXpHCgB9G1sw", "stars": 5, "user_id": "VyKK7iTYsNOqlMX0xVrYwA", "useful": 2}, {"text": "I've been here several times before and the experience was pretty good.  It seems to have taken a turn for the worse, however.  We went there tonight and the place smelled awful.  It smelled like old eggs and mayonnaise and the floor was dirty.  The cook had dreadlocks, tattoos all over his neck, and the girl at the cash register couldn't be bothered to take our order.  We walked out pretty quickly & went to Famous Dave's down the street.", "cool": 0, "date": "2017-01-13", "funny": 0, "review_id": "nGpPfyRTYhMk-11WB9Vbrw", "business_id": "AL5YzikrmxwcBzBNLGO7Jw", "stars": 2, "user_id": "5M_-zvxF6ZbDPgm7m2ooig", "useful": 0}, {"text": "Just stayed at the Valley Bar in the beginning of September 2010, thoroughly enjoyed my stay there, very quiet, clean, accommodation, extremely reasonable prices, very pleasant staff and management. I stayed for £11 a night in a double en suite room by myself, and roamed round the town for my food which is extremely practical if you are there to sight see as I was, huge oysters in lemon juice or tabasco sauce on the foreshore from the stalls by the lifeboat station for breakfast set you up for the day and if restaurants aren't your thing you can eat very well by stocking up on essentials at the local Sainsburys etc., or in the local market builiding a few minutes from the foreshore. The famus 'Pepperpot'\nRotunda Museum featuring geological and archaeological exhibits and the art gallery are just down Valley Road (the latter being up by the Crescent on the left. The choice of real ales and ciders is excellent, myself I settled with 'old goat' real cider at 7.4%, £2.85 a pint, well worth it, it certainly had a certain gravity to it which commanded some respect from my brain, I must say that I took drinking that at a very gentle pace, as it was not the sort of stuff to guzzle down, having a rather distinctive effect on the mind. The Valley Bar is extremely well placed to enjoy a good walking tour of the town, you won't need to use the buses or taxis as it only takes a few minutes to walk anywhere, enjoy great walks to Horseshoe Bay and further if you like at low tide, and do some fossilling and find yourself some nice carnelian or red jasper, maybe collect some lovely little mother of pearl shells (but check first that they are ones that are not currently occupied by little hermit crabs, you can always see the pincers lurking in the occupied ones), go the other way along the foreshore and around the Marine Drive and up through Peaseholme Park. The Esplanade is a very superior walk, up by the Clock Tower , see the wonderful architecture and visit the iconic Italian Gardens and the Rose Gardens, buy vintage postcards of the place on St Nicholas Cliff at the collectors shops. Dylan", "cool": 0, "date": "2010-09-16", "funny": 0, "review_id": "FKPi-3n2Tba6XMNIDddEpA", "business_id": "B7SPWN00xDHC3Uo9ASjBDQ", "stars": 5, "user_id": "daoLnCrD-Dr8MQgAhyM-Xw", "useful": 0}, {"text": "Manny is the greatest.  So accommodating and we appreciate his attentiveness.   Lynn and Dick Parker.", "cool": 0, "date": "2017-04-16", "funny": 0, "review_id": "7WpK8RskvF0fNAbonetxYA", "business_id": "h3pMMRwqBjMeMtk0_qQzRQ", "stars": 5, "user_id": "Y6fWB3M4zZby_Y8XtIC8LQ", "useful": 0}, {"text": "We had a large group that attended.  The service was outstanding.  Our server was pleasant and very helpful, often coming to our table to see if anything was needed.  The atmosphere is also very nice.  Being in Philips Place, it has a comfortable feel and is very pleasantly decorated.  I personally got the seasonal vegetable risotto with shrimp.  The risotto was a bit undercooked as the rice had a bite to it, but it was edible.  A few people got the trout almandine and liked it.  One person gave me a bite of her beef to sample and it was like a pot roast - would have been better with a reduced wine or gravy sauce.  One lady got the crab cakes and said they were ok, but she was from Maryland and had some expectations  :-)  One person got the mussels and really liked it.  A couple of people got the pizza and it was so-so.  But hey, you're at a French restaurant afterall, and you order pizza ?  The cheese plates were VERY good quality cheeses and I highly recommend them for a nice starter.  Overall, go for the service and atmosphere.  You will have a lovely time.", "cool": 0, "date": "2016-09-08", "funny": 0, "review_id": "B93sQ7rWZ0YfXLqHGAFbyA", "business_id": "tCSlpwJQ4CZsUEMZeH2SFg", "stars": 3, "user_id": "gERe-EPQPDsEkWu2fKeRYA", "useful": 0}, {"text": "Staff was nice, but $9.00 for a shot of Jameson's. That's some bullshit. The bar tender told me that it was the best bar on st Clair w. I disagree. About 5 minutes after she made that proclamation, the owner came in and made her cry.", "cool": 0, "date": "2016-07-30", "funny": 3, "review_id": "1SkFEWvfZl8toVanmtvPzQ", "business_id": "NPQE0JvwjmFca83ZuAXutQ", "stars": 3, "user_id": "yYIK3G4FhsFBVM-pQ5xdGg", "useful": 0}, {"text": "Was sat down and ignored, especially by the waitress with nasal ring who wouldn't bat an eye at us but would brush our table as she served the table practically touching ours. I was starting to think we had died because we were invisible to the servers in this joint. We finally asked to get served and our order was finally taken. We watched everyone who sat down after us leaving as our food finally came. At this point we were beyond hunger and scarfed down the food. We were so upset about the service I couldn't tell you how the food was but good luck on your service.", "cool": 0, "date": "2017-06-11", "funny": 0, "review_id": "T2Y7oUHMjZLRlG5ZviGe7w", "business_id": "LmjBZpQU7nJTIJZYRVO7Kg", "stars": 1, "user_id": "KItnwiGqIj0cTHnqhvst5w", "useful": 0}, {"text": "If it wasn't for the beer, I wouldn't go here. With the exception of one waitress, the service is well below average. One waiter isn't 21 and is supposed to be able to give you advice and help with your selections. That would be alright if an establishment only serves Bud and Miller, not a place with such high quality beer. The atmosphere is typical strip mall, very bright and loud.", "cool": 0, "date": "2011-12-17", "funny": 0, "review_id": "_66Ql6dLsazefuT4NHcQ7Q", "business_id": "hVLFDDA31wYm3Jjz3w74GA", "stars": 2, "user_id": "cD_55KnDr1dRHXUNXxqXWw", "useful": 1}, {"text": "My husband and daughter wanted to try this place because they were craving Korean food.  Upon entering the door, we saw a group of young people sitting in one table and 4 or 5  small tables that obviously needed to be cleared.  The person managing the place  immediately talked to us apologizing that he cannot serve us because he hasn't cleaned up and he has the group of people to serve.  We were basically kicked out for the first time in our lives.  We were in total disbelief!", "cool": 0, "date": "2016-03-21", "funny": 0, "review_id": "Jfv_pckvA2u5dpsXmJ8dRQ", "business_id": "mGUXzktXl1BlRdsVOy1WjA", "stars": 1, "user_id": "ruhfDNFukUyiO-HmOW6p0Q", "useful": 0}, {"text": "I went here recently ...  they just  moved some operations west from their amazing restaurant in New York (www.ilmulinonewyork.jp) ..  we had a private room for 8... amazing cuisine.. including sicilian lobster, tri colore pasta, rack of lamb with 8 ribs! 28 ounce steak (a good meal to split), veal scallopini, ... incredible presentation on the food. Tremendous wine list. This is a fine dining experience! The service was fantastic except they forgot to actually prepare my meal... so they only get 4 stars, b*tches! (we were all so hammered by that point that  I just split someone else's meal, it was cool) Extra pricey here.. but if you've just hit it big at the Craps table... check this place out!", "cool": 0, "date": "2006-07-20", "funny": 0, "review_id": "xKs3wHanIzhRxV2INhlKSQ", "business_id": "8yiLVWzJyyTEhYE0fVNvlA", "stars": 4, "user_id": "bmHLHijF54gd6VYAmCRgpg", "useful": 0}, {"text": "Love this place. One of the few things I miss about living in Vegas! Seafood spaghetti is to die for!!", "cool": 0, "date": "2014-10-30", "funny": 0, "review_id": "k7u18ZGlaUTYjBCmrUc3Pg", "business_id": "KskYqH1Bi7Z_61pH6Om8pg", "stars": 5, "user_id": "Yk0f9ujaKRyO-geYAwaPgA", "useful": 0}, {"text": "AS with the 4-star rating description provided by Yelp, yes, I'm a fan of Yuki. When I come here, I don't go for its lovely sushi or sashimi, instead, try its chicken udon or chicken/pork katsu don or curry selections. They are especially good for lunch. In my opinion, these ARE the hidden gems of Yuki's offerings. The taste of these dishes can match what is served in a fancy Japanese restaurant and yet their price is nothing if not reasonable. With a nice hot cup of tea, the meal is complete and cost-efficient. In the many years I've been visiting here, these dishes have never failed me. What's more, I appreciate the ambience inside, since it's never too full and raucous, and when it's quiet on a Thursday night, you can ask to be seated by the window to take in what's happening on Bloor West.\n\nChoose Yuki if you want to escape the crowd of diners in the Annex. Explore and enjoy their tasty non sushi dishes.", "cool": 0, "date": "2014-02-24", "funny": 0, "review_id": "aEZV-1yzW2EnslZQjzb_1g", "business_id": "GWRGhxUKHRQ6KorbCWU6KA", "stars": 4, "user_id": "kKP95ac2qxMwaJxw0Z7yVQ", "useful": 1}, {"text": "I had a TERRIBLE EXPERIENCE ON SATURDAY AT LUSH.  When I entered the establishment I was told to sit down and the woman just pointed to an area where to sit but it was not the right area.  My entire appointment was very rushed and it was NOT A RELAXING experience.  My gel manicure looks so dull and the manicure was not the best in the world.  My pedicure is awful.  I paid for the Ultimate experience and got a terrible experience.  The hot towels were not hot and my heels were not even touched.  I'm not used to being on the clock to get a pedicure.  I WILL NOT BE RETURNING TO THIS ESTABLISHMENT!!!!!!!!", "cool": 0, "date": "2017-04-11", "funny": 0, "review_id": "SgSCPsiOzDTZmclH2je4xg", "business_id": "Mzxpd61Qd81ptu12sBQchA", "stars": 1, "user_id": "oTOQreg_Q7Sz1bJ70t96jg", "useful": 0}, {"text": "My girl dragged me here last night while we were visiting Pittsburgh...At first I was a bit skeptical, but after 5 mins of chit chatting we had a great time...even came back after dinner.\n\nOnly downfall...stools made me feel drunk/topsy turvy...and we missed Midget night, hahaha\n\nInexpenisve alcohol and great bartenders make the world a much happier place!", "cool": 0, "date": "2010-09-06", "funny": 0, "review_id": "pwrbyme9sJpyUq_QMWEEKA", "business_id": "t5DQeB3dORfNwx9otGUrSA", "stars": 5, "user_id": "YXTuhhJprYaHQjYBYDg8Pg", "useful": 1}, {"text": "The atmosphere, the staff, and the food are the greatest. The restaurant has a relaxed and - welcoming atmosphere - I felt like we were treated like family. We we offered the tasting menu, but we decided to order a la carte based on some other Yelp reviews. Between the two of us we ordered and shared the brussel sprouts (5/5), strip steak (5/5), bangkhok bowl (5/5), burger (4/5) and a half order of the truffle gnudi (3/5 - I was a little disappointed with this dish). All the dishes (with the exception of the truffle gnudi) were nicely presented and absolutely delicious! My husband had some delicious cocktails with the recommendation of staff.  We were too full for dessert, so can't comment. I highly recommend you go. Make sure to make a reservation as this restaurant gets quite busy. I can't wait to go back in the summer when their patio is open.", "cool": 0, "date": "2016-04-01", "funny": 1, "review_id": "wn183_uy3mGRdmGl9OsAqA", "business_id": "eKznX8VTfcQrjCqXpeobiw", "stars": 5, "user_id": "l4eyR180qZtW_AY3R011nw", "useful": 1}, {"text": "really great lil hole in the wall Mexican food. the chilaquiles are awesome. careful tho if you don't like super spicy, cause they can make them hot! flautas are also delish. oh, and the micheladas are a must! awesome service, very friendly staff", "cool": 0, "date": "2017-09-03", "funny": 0, "review_id": "mYJ0UJMTSB6tk76ZFiFwSA", "business_id": "DaVTuhzi6EgWStb2eAjNjA", "stars": 5, "user_id": "yrcFQHdIcrPGV3DjSVPNqQ", "useful": 0}, {"text": "Great spot and seems to be popular with the locals. Really good coffee bar and brunch menu.", "cool": 0, "date": "2015-08-16", "funny": 0, "review_id": "LsH6dgvhz5UZbRUCMnFoyg", "business_id": "58APdML-PG_OD4El2ePTvw", "stars": 4, "user_id": "jWP1fiGCmzDdihRrm7gItA", "useful": 0}, {"text": "Decent place but exquisitely gaudy as most of Vegas is. The casino and rooms are of a decent size. The room was called a suite but it was just a room with a big living room. The cleaning wasn't impeccable unfortunately. Room price was reasonable for the location-central on the strip. Tonnes of big name chef restaurants including Batali and Boulud which was really nice. We ate at Carnevino. Prices at all restaurants are a little crazy-kinda like you're in the airport. We were at a conference there and the meeting rooms were large and well equipped. Tonnes of stores from Barneys to breguet. If you're looking for class-go elsewhere, but be prepared to pay.", "cool": 1, "date": "2016-12-13", "funny": 0, "review_id": "elCb-q5Rt8Tzxp69ff5nqQ", "business_id": "Wxxvi3LZbHNIDwJ-ZimtnA", "stars": 3, "user_id": "0c7H0fkvezEaxlHag3KfJQ", "useful": 1}, {"text": "I tune in daily until English speaking hours are over as that is my native language, and I know kkvv has very diligent men and women of God join together to share the TRUE GOSPEL OF JESUS CHRIST OUR LORD AND SAVIOR!\n\nThere are a few programs I'm not sure about just yet; iM' CHECKING THEM OUT STILL, I can say the TRUTH IS SURELY GOING OUT OVER THE AIR WAVES ON THIS STATION.  \n\n\"THE NARROW PATH\" with Steve Gregg is a wonderful MAN OF GOD and full of knowledge daily between 2-3 pm Vegas time. His program is a call in format so you never know what questions folks are going to ask but Steve Gregg goes into great detail to ensure the caller understands the answer they seek for their own personal growth so of course that helps us all, Saved and not Saved YET! If you like talk show format you'll love this program! This program is listener sponsored yet no one gets paid on this staff per Mr. Gregg they are all volunteers.  He also offers tons of free downloads, I believe there's over 900 topics at his website AWESOME HUH?\n\nDAYS OF DESTINY\" on Thursdays from 6-7 pm with Pastor Scott Emmert and Evangelist Diana is one of my favs because THEY TEACH AND PREACH THE TRUTH in an easy to LEARN AND REMEMBER unique sort of way.  Pastor Emmert is diligent and fun, Evangelist Diana talks, I don't see notes and well let me say it like this, I believe she either replies to a question the Pastor asks her or she says what The Holy Spirit has layed on her heart for the listeners.  She is ready set and go tell it like it is, she's pretty funny too.  They add some FUN into the mix, you never know what or maybe I should say when; they are going to say something funny, but they will so I try to NEVER MISS THEM because I get THE TRUTH AND LAUGHTER, It's obvious they take their duty serious and they have the fruits of the HOLY SPIRIT, both MEN AND WOMEN OF GOD; as well so  GREAT TEAM FOR JESUS.  I've never heard Pastor Emmert ask for donations, so refreshing as that is, it does take money to be on radio.  I'd sponser if they'd ask or as I'm writing I guess I'd say send it to kkvv and as Fred says; make sure you put Days of Destiny on your check and on the envelope so it goes to their airtime.  They are down to earth, don't believe THE GOSPEL IS FOR SELL so help keep this great team on air because they are afraid to TELL THE WHOLE TRUTH IN GOD'S WRITTEN WORD, HALLELUJUH FOR THAT. HELP IF YOU CAN.\n\nBrends Ward's \"FORGIVEN\" is on air onThursdays from 5-5:30 is so wonderful with this program aiming towards the youth and she has a program about Grandmothers, not sure when that day is but GRANDMA'S RULE AMEN!  RADIO BOOK CLUB is another program that is great with Brenda that features writer's, poets, songwriters, etc. get their testimonies and product out to other's that will benefit.  She does a one on one interview asking ten questions with her guest.  She is a Publisher so check her out too. She's a very nice lady and WOMAN OF GOD!  \n\nAll programs need sponsored with help paying for airtime so we can benefit from their programs on wkkvv. We better keep the GOSPEL OF JESUS CHRIST ON AS LONG AS WE CAN, AS THEY ARE TRYING TO MUZZLE THE PREACHERS AND TEACHERS, EVANGELISTS, TAKING CROSSES DOWN IN THE USA, REALLY? LET'S SUPPORT THESE WHO ARE \"TRULY CALLED\" SO THE UNBLIEVERS CAN GET SOME TRUTH IN THEM AND SOME SOULS CAN BE SAVED. TUNE IN,YOU'LL LOVE IT AT KKVV. AND NO, I DON'T WORK FOR THEM.  JUST A LISTENER OF A COUPLE OF YEARS NOW AND I'M A PICKY LISTENER AT THAT....LET'S STAY UNITED SO WE CAN'T BE DEVIDED IN JESUS CHRIST NAME!", "cool": 0, "date": "2014-03-08", "funny": 0, "review_id": "raIWYi8mwWJTMAeAMYpnzw", "business_id": "nDc-i_R4HPFDDHCJeltwlA", "stars": 5, "user_id": "tQTVZimo4hmD2_vrzPu7hg", "useful": 2}, {"text": "The burgers are AMAZING and the fries are nice and crispy. The only thing that could use some work is some of the attitudes of some of the employees (both servers and hostess'). Tonight is my second experience and 1 star to hostess but 4.5 to the server. Last time I would have rated the server 2 just for attitude but today she was nice and friendly regardless of it being a busy night. The hostess seems like she doesn't want to be there, which just kills the awesome vibe of great burgers.", "cool": 0, "date": "2015-12-20", "funny": 0, "review_id": "F-fO7lKk2EBvVGCgvnto6w", "business_id": "hf8WoI724TuDeAtH80bgPg", "stars": 5, "user_id": "SDPL59HzIJL84Vi2asFGCg", "useful": 0}, {"text": "I'm a regular customer who comes to this location maybe twice or three times a week for happy hour and lunch. Employees there recognize me and they are always polite and friendly. But recently they hired a new employee, and thereafter received one of the worst customer services I've ever experience. She gave me attitude for her forgetting to unmute her Mic, and proceed to rush my order. I specifically requested no condiments on my order and she placed them on the screen. But there they were, unable to eat what I ordered due to allergic reaction's. I'd forgive any of that due to accident or having a bad day.. but at the drive-through window during payment it took them seven minutes to get my card back. It wasn't even the lady who took my order who gave me my food! She got another person and left halfway through the transaction! 3:15pm, 9/17/2017. I will no longer be coming to this location until there service improves.", "cool": 0, "date": "2017-09-17", "funny": 0, "review_id": "32eozygcW7G2tvNlhNXUug", "business_id": "e8aRJbv2EMH5DqMzbDK8wQ", "stars": 2, "user_id": "PtuPotgg2h8YZdTpw6Z6BA", "useful": 0}, {"text": "I was so excited thinking this was gonna be good BBQ. I was so disappointed. Sorry, took this one off my list of great places.", "cool": 0, "date": "2015-07-11", "funny": 0, "review_id": "RyKThjvZjsgbZeTqN6Jeww", "business_id": "_9vGmNrEcLWFOnUzeUdfag", "stars": 1, "user_id": "ZGXGegh_jalSlFIBFqMLQQ", "useful": 1}, {"text": "Great about BB: it is here in Lakewood! best bread. nice cookies. great signage. always smells good!\nNot great about BB:\nnot open in evenings/after work. \nAND,\ncafe area in need of some major rethinking/redesign.\nright now the cafe side is really ugly, dull, and in stark contrast to the cool, industrial looking baking side of the building.\nit almost seems that BB put very little time and effort in making the cafe side of the space fun, comfortable, hip, enjoyable, etc. etc.\nhow about adding a couple of sofas and a coffee table. make it cozy and comfie. how about some nice music to listen to also.\nor you could go industrial and make the cafe side very hip industrial looking like FOUR BARREL cafe/coffee in San Francisco.\nand if you can't afford interesting art for the walls, which are really bare and depressing and look like a dental waiting room - how about hosting local artist shows. they can display for free and the space gets color and changing wall looks every 8 weeks or so.\nor just paint each wall a bright, different color. liven up the place in dreary, overcast, cloudy NE Ohio.\nyou have a great concept/business growing, so now just continue to think outside the limited cleveland mindset, and look at how places like TARTINE in San Francisco have both an onsite bakery and a great dining/cafe area for their customers. they are very very successful because it is not only a great bakery but a fun place to go and hang out a bit and have a pleasant lunch or a bakery treat with a cup of coffee. \nor even STONE OVEN at Cedar/Lee locally, or Cup O' Joe/French Loaf Bakery in Columbus, are more inviting than the current cafe area at BB.\nSoooo, hope you can save some bucks and invest in redesiging and making the cafe at BB a local destination to hang out in. \ni guarantee if you make that side of the space visually unique and interesting people/new customers will come.\n I think you would see your profits soar, while also offering a much needed hip, cool place for us local regular customers to enjoy.", "cool": 0, "date": "2011-02-02", "funny": 0, "review_id": "nu09WFpAnqmh-jS4Tc7QqQ", "business_id": "993MaVXjU2qhmQQYR_mdVg", "stars": 4, "user_id": "GDVgJI2ZkJiFNKffUXP2Rw", "useful": 0}, {"text": "2.5 stars really\n\nPros:\n+Food is decent and you're pretty much guaranteed the same flavor/quality/choice as always.\n+Tiramisu is really delicious\n\nCons:\n-Waitstaff and bartenders are pretty bothered by customers, even during non-busy periods (like mid-afteroon, 3pm, on a weekday)\n-One of the managers has no class, lecturing an employee less than 7 feet from out table (and at levels easily within ear-shot). That should never happen.\n-Just hits the bare minimums for average, but doesn't really feel like it should get 3 stars.\n\nTry somewhere else, unless you're really particular to their food, in which case, being the large chain it is, you won't be disappointed by.", "cool": 0, "date": "2013-10-04", "funny": 0, "review_id": "hk0wc2iP_xV7noyIYh_eTA", "business_id": "V_2YX2rW_l5N3UwwifokCQ", "stars": 2, "user_id": "wjxbu8UBQmr-CGSgOPYGIQ", "useful": 1}, {"text": "Today they put down a dog less than an hour after she was picked up.  The are suppose to hold all strays for three days and instead they killed her in 30 min!!  These people need to be held accoutable for their actions. They had no right. I hope they are investigated.", "cool": 0, "date": "2016-02-03", "funny": 0, "review_id": "Dhv9FIN4MkeKgQEVMO8-kA", "business_id": "WAv1VJ0YXvVRT4zpWkvFhQ", "stars": 1, "user_id": "F0e6gOA8-1k3y203Qys9EQ", "useful": 7}, {"text": "Excellent! Stopped while on the road, fast, hot and delicious! I had a crispy chicken sandwich, it was big enough for 2 people and quite different from the usual ones you get elsewhere, they also have quite a bit of Latin/Spanish selections.", "cool": 0, "date": "2017-03-29", "funny": 0, "review_id": "n-R8Lpt9YkYLLMwYTKqMUg", "business_id": "DzSlAkkiwtZjP09AaOMa-g", "stars": 5, "user_id": "9OCbmDG_VaxHjy_ir8RUEw", "useful": 0}, {"text": "Once again amazing practice! They truly care about the patient and take the time to explain and treat our pediatric dental needs. 5 Stars over and over.", "cool": 0, "date": "2016-05-21", "funny": 0, "review_id": "YUQt5DLIQgNYpwIGXY7b0w", "business_id": "jzjuLsK36Cbw8j0yvCheEw", "stars": 5, "user_id": "nlp_gD4G47G1W3favP3ZwA", "useful": 0}, {"text": "I tried their classic burger. You probably can get the same quality burger at McDonald at half the price.", "cool": 0, "date": "2017-11-12", "funny": 0, "review_id": "4P9144Vi6_TQB06fm5_FxA", "business_id": "Y0NkII8gne1QEJbUCBi2tg", "stars": 1, "user_id": "Cd_anA3vbXnBuO6wuMn9Kw", "useful": 0}, {"text": "Let me start this by saying that I am mexican. And my taste buds are not even close to being gringofied. \n\nI love this place! I probably wouldn't of gone except it's so incredibly close to home. I don't frequent mexican joints because I am always disappointed. But not at Asada! \n\nI have been there a few times, and have tried quite a bit of the menu. Everything has been great. My favorites are the amazing home cooked style pozole (best hangover cure EVER!) and the cochinita pibil. \n\nThe salsa bar is the best in town (after my own, of course)! The only thing that's missing is pepinos & rábanos & cebollitas.... \n\nCan't wait to go back!\n\nOh, I almost forgot to mention, the staff is the best staff I have ever encountered in TO! Friendly, great attitude, and always looking to make your experience even better! Great job, guys! You make the neighbors and the mexicans proud!", "cool": 1, "date": "2013-07-07", "funny": 0, "review_id": "o0HtsnaHCDAe6Djg8guRXw", "business_id": "sPPh1LJllyr5jUpKFTxxag", "stars": 5, "user_id": "WvklcMctTKgRPonBDYKXPQ", "useful": 2}, {"text": "love love love!!! great customer service, beautiful flower arrangements. I have been lucky enough to have them do my wedding, baby shower and baptism. not one single complain!", "cool": 0, "date": "2014-02-09", "funny": 0, "review_id": "j7JaSUrpSqlR4EmBAZvLkg", "business_id": "hLaqMtFSfYWAHLubwaCypw", "stars": 5, "user_id": "eKGlymEaiLtpvGL7LjaarA", "useful": 0}, {"text": "Poor experience for the price. The best part of the salon is its website.\n\nI had a wedding to go to, so me and my sister went to get blow outs, we both asked for the red carpet and it was the most limp blow out I have ever received, I could have done a better job on myself.\n\nTo start the girl doing my hair seemed very nervous and unsure, she was constantly asking me if whatever she was doing was ok, normal things like brushing, hair spray, heat tools etc, which i found odd, the girl didn't speak to me, which I didn't mind because it was early in the morning but still off putting. ( Also, I am just speculating but from what I was hearing some of the staff aren't trained hair dressers because the girl mentioned going to school for business and didn't mention hair school at all)\n\nThe most off-putting part of the service and why I wouldn't go back is, the girl didn't seem to have her own brushes and grabbed another girls bin and they clearly weren't clean because she pulled another customers hair out of it and proceeded to do my hair, so unhygienic. When she finished with me she pulled my hair out of the brush and put it back which I assume wasn't cleaned again)\n\nThis could all be forgotten if the hair turned out well, my hair was so limp, no curl at all on the bottom, no volume, nothing special at all. I wasn't asking for much but a little bounce would have been great, let alone my sisters hair which is naturally curly was missing spots, so there were random pieces of hair that were curly and others that were blown out.\n\nIf this weren't a strictly styling salon I wouldn't have been so disappointed but when you pay $35 to get your hair blown dry you expect it to be done well.", "cool": 0, "date": "2014-01-10", "funny": 0, "review_id": "Rwx0YcdZgirwzu4MvMtaEg", "business_id": "R50L6KtLzc8nexAGjnTnYA", "stars": 2, "user_id": "cragg22FF8Gbrfy0EBb3cQ", "useful": 0}, {"text": "Plain and Simple.....Best Ribs in Vegas! N'ough said!\nPulled pork is juicy.  Peach cobbler is my favorite and don't forget to order a side if Blue Bell Vanilla ice cream.  This place really smoking hot.   We live in Henderson but we don't mind the drive.", "cool": 0, "date": "2014-11-28", "funny": 0, "review_id": "Nbr-K4knTwIbobxXmuNIiw", "business_id": "fL-b760btOaGa85OJ9ut3w", "stars": 5, "user_id": "H6CMymOJdPFCWvCuJ8aXqA", "useful": 1}, {"text": "Food was great, but the service and concept is weird. Wasn't walked to our table to be seated instead we were pointed in a general direction and actually guessed what table to sit at.  Server 1 takes our drink order leaves the table, server 2 come and asks us what we want to drink (less than a minute after the other left), server 3 (again as soon as server 2 left) asks us what we want to drink. I'm still confused. Had to get our coffee replaced 3 times because again no communication that we had decaf (told every server that came though!) Got our food then was given our check right away, felt very rushed out. After all the hype, was super disappointed. Probably wont be returning because the confusion wasnt worth the drive from Gilbert.", "cool": 0, "date": "2017-07-13", "funny": 0, "review_id": "yUnpqVa01B5Hf8iOlaGoLw", "business_id": "L2p0vO3fsS2LC6hhQo3CzA", "stars": 3, "user_id": "BZTLTmSdJbQK0kjVXbeVgA", "useful": 0}, {"text": "They have the best reuben sandwich I've ever tasted. And it was reasonably priced too. Vegas isn't cheap anymore and good thing we found this place. Staff was friendly and the place had a lively atmosphere. When the live band played, they charged me a live entertainment fee of $3 or so...I don't remember the exact amount. Anyway, I'll definitely be back.", "cool": 1, "date": "2014-10-31", "funny": 1, "review_id": "UUOCsmRXojOGtt-qtxPToQ", "business_id": "dWk0mbhj79pK3WBp5oLtpw", "stars": 5, "user_id": "g1wLYrLdyFWtawK69Wi8pw", "useful": 1}, {"text": "Bad roach problem , management sucks , staff is clueless and always gets fired , but it's cheap , u get what u pay for", "cool": 0, "date": "2016-11-07", "funny": 0, "review_id": "P5_0YuMN-1YZ4W1ShpwmHw", "business_id": "MA-CtldVzpBURSNwECCNTw", "stars": 1, "user_id": "dcUQbre4A3f0kAhNmIsHTQ", "useful": 2}, {"text": "Starving after a long day at work, we looked for somewhere to order a pizza that we had never tried. We settled on A'Pizza Badamo and placed our order, a 16\" 10 cut pizza, topped with sausage crumbles, onions, green pepper, and artichokes. We were given a total, and told 40 minutes. The food arrived hot and delicious in just 25 minutes!! A thin and crispy crust, fresh toppings, this may have been the yummiest pizza we have tasted yet! Call them now! You won't regret it!", "cool": 0, "date": "2013-10-13", "funny": 0, "review_id": "alYpz8HaMRDBHsOueUl3Tg", "business_id": "SsBi4mjcfsQJUMkyQlgg1Q", "stars": 5, "user_id": "nuRxdToGWjZCiFW6PmXf8Q", "useful": 0}, {"text": "We live around the corner and eat here at least once a week.  Many locals get take-out.  We love the atmostphere, the owners and that it's BYOB.  The marinara sauce is awesome!  I love the greens and beans and have been ordering the eggplant parm too much!  Our daughter (7) always gets the wedding soup and something with a meatball.  My husband loves the pizza.  I've never had anything here I didn't like.  It's great to have a fantastic restaurant in our neighborhood.  Brookline keeps getting better.", "cool": 0, "date": "2011-03-03", "funny": 0, "review_id": "6fnvZOJUM2cXEL8pC2VjkQ", "business_id": "X-ITPkx_mvK1Tu6Eq_hfZQ", "stars": 5, "user_id": "6lb0eTeWb9qFJGY4g1wMkQ", "useful": 3}, {"text": "I've been to the jimmy Johns in IL. ...this is nothing like it.....Super slow!!  And then they screwed up our sandwiches   ...forgot the bacon!  If you want service from young stupid, slow kids this is your place.", "cool": 0, "date": "2016-05-14", "funny": 1, "review_id": "04Cy1lqz-BJpHG2zlX6HtA", "business_id": "OA5D9SMnku0QAq5hFLytng", "stars": 1, "user_id": "EEX4JCzhjTJXsZTUuZ5AYw", "useful": 0}, {"text": "Outstanding Customer Service!!!! Addison and his team did everything they could to get my car up and running asap! Had a nasty collision and of course the insurance company wanted to do \"good enough\" repairs. Pulled my car from that shop and brought it here. They got the insurance company to pay out what they should have initially and now my car looks brand new! I will definitely be a life long customer and recommend this shop to everyone who needs any type of work done on their vehicles. You will NOT be disappointed with the work these guys too. I also had them quote some other work that was not accident related and I was shocked by how inexpensive the repair was compared to every mechanic I have ever been to. AMAZING company. Good to know there are Honest and Quality shops out there.", "cool": 0, "date": "2016-08-10", "funny": 0, "review_id": "iM8ZHd4YjDXd55BAIHxKKg", "business_id": "h0ufJy63QSFLUsNMKRP5ZA", "stars": 5, "user_id": "ZgfVulbw9E9RM0EUv1TpyA", "useful": 0}, {"text": "BEST ice cream in town!! Delicious Banana Split and Tostilocos! Great experience overall. Very friendly staff! Definitely will drive 10 miles again and again! Hope they have fried ice cream next time!", "cool": 0, "date": "2013-11-11", "funny": 0, "review_id": "Lx2ppxN5cuxrtee4Rq5mVw", "business_id": "TUpyKJFqL_ySZMo54pT-Sw", "stars": 5, "user_id": "e3kssjz3u-G7obyMBNcQLA", "useful": 2}, {"text": "Everything was either dry, salty or flavorless.  Their menu did not have enough variety and the only thing looking fresh was their pineapple.  \nVery disappointing.... worst buffet ever", "cool": 0, "date": "2017-04-02", "funny": 0, "review_id": "7zXj0L1h-87GWcJqml6KJA", "business_id": "LR0qF0FEVsCOhYWUOiH26A", "stars": 1, "user_id": "LYwFpggjNRsjNOYuSR1m1g", "useful": 0}, {"text": "This place is awesome. Food was good and great prices - much better than just bar food. TV's everywhere. Nice ambience. They also have a very respectable beer list. \n\nTwo reasons I didn't give 5 stars.  The staff -un engaging and unfriendly (although there was a super friendly waitress taking care of tables around me that I wish had my table) and ive also been trying to call them for weeks and their number must be listed wrong because it keeps playing a message \"coming soon....lookout Tavern\". \n\nPlease sort out your phone situation", "cool": 0, "date": "2018-01-02", "funny": 0, "review_id": "sNdRYIHBF1UX8KioThD1JA", "business_id": "kJhQq1BFz7lOYLve7xPaJQ", "stars": 4, "user_id": "9HBOp22X3SE8_Ex7U52B8A", "useful": 0}, {"text": "We've eaten here about 20 times, but took a break when pizzas kept getting smaller. All other restaurants around the area were too crowded so we decided to try Novecento again. Big mistake. Not only are pizzas small, but salads are smaller now, too. Place seemed dark and dirty . It used to be so much better. Won't go back. Will go to Metro for better quality food at better prices. Heck...now Fresh n Easy has freshly made pizza that's better quality.", "cool": 0, "date": "2014-12-06", "funny": 0, "review_id": "LscGUNC8wnXFJak5-MOCow", "business_id": "0InA3Ffj8MxyQV9hgsyYcQ", "stars": 1, "user_id": "43RBXxVxCYgoliQycxYhFQ", "useful": 2}, {"text": "I got to the smoke shop at 8:40 pm and was finishing my smoke outside the front door where the hours of operation were posted underneath the open sign (that was lit up OPEN) that clearly showed \"Open till 9:00 pm\". I was walking up to the door when the owner met me at the door and told me, \"the store is closed\" I asked,\"Don't you close at 9 pm as your sign says?\", the clerk said to me, \"Well we're closing early tonight.\" I asked, \"are oyu kidding me, it's not even close to 9 yet?\" The owner/clerk irritability stated,\" I can get you something if you know what it is that you want.\"- S my advice, if you're buying anything made of glass, stay away from this...STEREO TYPICAL pUNjAB SMOKESHOP...The clerk didn't even want to bag my item!!", "cool": 0, "date": "2013-09-10", "funny": 0, "review_id": "uOf7VnH3qv81FRpEtZd5Nw", "business_id": "54y4I_zFjiZ9bFSmMlzl5g", "stars": 1, "user_id": "VwKaLr_g8lg9Z4CH9qAF3g", "useful": 0}, {"text": "Been here twice, and both times I've left completely satisfied. Tony will take his time to ensure your cut is 100% on point. Overall, this place is great! Every person is greeted when they walk in, and personally thanked by Tony when they leave. Also, the fun conversations between all the barbers and clients lets you know that they enjoy their jobs. If you want a superb cut at an amazing price, this is your spot.", "cool": 0, "date": "2015-12-24", "funny": 0, "review_id": "nnM0jxeD7ZpRkBTAHJq40g", "business_id": "w1fJzm0ladnhvT7Jc0MJ6w", "stars": 5, "user_id": "0hd5EiZD9-v-gJ1ic86UtQ", "useful": 0}, {"text": "Japannese crepe style heaven! Just right amount of sweetness with salty taste. A must have", "cool": 0, "date": "2015-02-20", "funny": 0, "review_id": "4EkqDSK7rU8HDJSGAk_wfw", "business_id": "KdKzTRoSKEUIlxfKTbWUaw", "stars": 5, "user_id": "9OXcULZWs9d-XTfwjFa8aQ", "useful": 1}, {"text": "Walked out just as quickly as we walked in. Traveled from Cambridge to specially have dinner here and seeing as we arrived to an empty restaurant It would be ok to sit in the back (as it is our anniversary) but we rudely told we only had the choice between the two worst tables in the house. If we came in at a busy time we would understand but still would never understand how the owner would not want to accommodate the customer. Went down the st and was politely sat in minutes.", "cool": 1, "date": "2014-12-22", "funny": 2, "review_id": "yy0eI7lD2WI_CQZG1lMQYg", "business_id": "SW0NcZwZsbSpsk0ZPgJKmQ", "stars": 1, "user_id": "4D72bSRPIQ43fSVx8PuJfg", "useful": 2}, {"text": "We just love BIG'S Furniture Store!! we have purchased a sofa, love seat, over-sized chair and an ottoman there about 6 years ago. Happy to all pieces are still as beautiful and comfortable as day one. Most recently we replaced our living room sofa & chair with another purchase from BIG'S. Again extremely satisfied with our purchase & can't say enough about customer service! giant shout out out to Dom who changed our delivery time & was concerned enough about our street name being mis-spelled that he reached out to us to confirm! So greatly appreciated, we will be back!", "cool": 1, "date": "2016-09-14", "funny": 0, "review_id": "av20C-eVu8l8MRFKTV7eDA", "business_id": "52dAt8dkOpy1b86kUcsX1Q", "stars": 5, "user_id": "DXacSiH8LTtAqDJvxazY0w", "useful": 0}, {"text": "I recently stumbled upon this business. I needed a pair of brown leather pumps repaired. They were in very bad shape and I was planning on purchasing a new pair. However, the Park Avenue Cleaners & Shoe Repair had another idea.The owner was great. He immediately greeted us as we walked in. He offered suggestions on repairs.  I decided to let him repair my shoes. I was skeptical because of the severe damage. I picked up my shoes and they looked phenomenal. It was like I purchased a brand new pair. I would definitely recommend this business. I plan on taking other heels for repair soon.", "cool": 0, "date": "2017-01-26", "funny": 0, "review_id": "Dl8y0qpglCq6cmwjaW-MFA", "business_id": "aD5zDDEw0Z_iHbShgfEOnA", "stars": 5, "user_id": "FnthGX_l0JPY8TXC84Vhww", "useful": 0}, {"text": "First of all the service really sucks. The servers are more concerned of cleaning the tables rather than ensuring customer satisfaction (making sure your customers have plates and utensils). They tried to serve us plates of cold rice twice. \nI was really disappointed with the food. The hype isnt real. The kare-kare was too sweet and to me it tasted more like Mang Thomas lechon sauce. The lechon really wasn't that good as they all say. It was served cold and the skin wasnt even crunchy. Overall I am giving this restaurant a one-star because they really need to improve on their customer service--my whole family was not happy at all.", "cool": 0, "date": "2013-12-30", "funny": 2, "review_id": "h2-RftLZNdQ2AWEo0jeXtg", "business_id": "lweobd-AOEP1lYNTfhuHhQ", "stars": 1, "user_id": "N_ozRXZhQXKgsrVRSPBUpA", "useful": 1}, {"text": "2.5 star      I used to go more when it was sushi on 7.  No change in decor.  But Menu has change a little.\n\n\nDecent salmon sushimi, Unagi and only place that I know that offer a scalp  sushimi. \n\n\n\nOther spicy salmon hand rolls and Maki rolls were ok.\n\n\n\nWe went at 5:30   so no mistakes with ordering, rushed service or rolls falling apart.", "cool": 0, "date": "2016-08-08", "funny": 0, "review_id": "AC5Q9JeMLlgZuCLREf1AIA", "business_id": "KapTdGyGs7RK0c68Z6hhhg", "stars": 3, "user_id": "rPbIVGuIjmxHDw8ChhTsrw", "useful": 0}, {"text": "Gene worked diligently until he exceeded my expectations on the repair of my dent. He was on time, friendly, and professional. He explained the process and charged a very fair price. I am very pleased with the experience. I highly recommend him!", "cool": 0, "date": "2015-10-16", "funny": 0, "review_id": "bFVf6928XUzxgjNp8KyyUw", "business_id": "p3Bm-m-crbxrM4rl9ooy3g", "stars": 5, "user_id": "TtMW4baXamPkzgsyAWj0vQ", "useful": 1}, {"text": "Food and service was great. I had delicious mushroom crepes and they reminded me my mom's cuisine. It was an amazing experience! Highly recommended restaurant!!!!", "cool": 0, "date": "2015-07-31", "funny": 0, "review_id": "Ot_c6mJXv_D3BXPWtROMZw", "business_id": "PLQl-y06iPOEaqsy_nx-Eg", "stars": 5, "user_id": "VybTon15N1IQahK7BVKT8Q", "useful": 0}, {"text": "The food here is OK, but after our last trip there I will never return.  My husband, daughter, and I were seated at a booth in the bar with menus.  Then we waited and waited.  Several servers passed by us but no one greeted us.  I tried to catch the eye of one of them, but they were too busy chatting behind the bar to notice.  After we waited 20 minutes we left.  Inexcusable.  I can't remember a time I was disregarded like that.", "cool": 0, "date": "2015-06-20", "funny": 0, "review_id": "9LxdP3Q4RvXzqQqqDW9Vcg", "business_id": "aELkI0mfF1EbQo_m44vEKg", "stars": 1, "user_id": "iXLvbUUn_U7blZD-z2NMVg", "useful": 0}, {"text": "Sunset Spas really bailed me out.  Learned a lesson - Don't ever buy a Hot Tub from the Guy at the Swap-Meet.  A year after we bought it he was nowhere to be found.\n\nCalled Rich at Sunset Spas and he looked up our unit by the Serial Number and completed a full repair under warranty at no cost to us.\n\nThe Technician (Pete) did a great job and was very professional.\n\nHighly recommend these guys - they don't get any better.", "cool": 0, "date": "2013-03-22", "funny": 0, "review_id": "9wnm8clBVEgOGZuEUBIkNw", "business_id": "VoZxVjIf2psVRYKaEldXow", "stars": 5, "user_id": "1Fr9wGlZcS5Spa2WSY9faQ", "useful": 5}, {"text": "Favorite sushi joint anywhere. If there is a Nobu in town, I am going. The Ceaser's Palace Nobu is fantastic. Love getting a spot at the sushi bar and taking the recommendations of the chefs that night.", "cool": 0, "date": "2014-07-27", "funny": 0, "review_id": "3JqnSeP6vNdVieprugglvw", "business_id": "pyqnGlIfP9Zw8LLxBjyAiA", "stars": 5, "user_id": "vNKNUyfd2TxzSV7ENg7H_w", "useful": 0}, {"text": "What a great family owned place! Food was delish! Way better and way cheaper than Fatburger.\nLove supporting local businesses. Go check them out !", "cool": 0, "date": "2017-11-06", "funny": 1, "review_id": "KzRCHY4yDGiXdHPKatcTVQ", "business_id": "xWq3LQw8w4OIK-fSiGwNLg", "stars": 5, "user_id": "fRNdhxULxOCEsWXb3esdUA", "useful": 1}, {"text": "This doctors office is great!! I've seen multiple people here and I'm always given excellent care!! They stay close to their appointment times, and this morning I had to do a walk in and was seen within 15 minutes! I recommend this place to everyone in Goodyear.", "cool": 1, "date": "2015-07-06", "funny": 1, "review_id": "6zShpuiuv9erKtdzdVgtBQ", "business_id": "bAhoZCrdvySsqXglWhJcdg", "stars": 5, "user_id": "Zk8Ci229LJkMsTPtD_qcMw", "useful": 2}, {"text": "We love Slicers! I was in a pinch ordering food for 35 people and they  were on it like that!  They really hustled to help us out!  Thank you so much you guys!  I've never seen our staff more happy!  Oh and consistently good food!", "cool": 0, "date": "2016-01-15", "funny": 0, "review_id": "_mtSjaIyyw_Fq7C9u7eJJQ", "business_id": "5OmuCo0kdvWQZXidGuxrsw", "stars": 5, "user_id": "_i9CMTgTX2wyrD_HNUZJ_Q", "useful": 1}, {"text": "Absolutely terrible customer service. Something in my burrito tasted off and asked if I could try something else and explained how there was much more hot sauce than I expected cooked into the burrito. The girl at the front (Leidy) looked at me and told me she \"didn't know what to tell me\" and that I should \"look at the menu more carefully and KNOW what I'm ordering next\" and that I would have to pay for something else.. HORRIBLE CUSTOMER SERVICE!! You should never have attitude with your customers. That was my first and last time ever eating there. Leidy clearly doesn't value the experience that her managers customers receive.", "cool": 0, "date": "2015-08-08", "funny": 0, "review_id": "Guw1m9CvwfFgH5pPruPHzQ", "business_id": "DYnFGGYU3SkrKT_G4djpYQ", "stars": 1, "user_id": "K_LbAf0mSdPGAU2yrVpDbA", "useful": 2}, {"text": "Andy is great, he runs an honest shop I have serviced my car and my wife's car a couple of times here and also changed my wheel bearings as well, all of this with great prices. I recommend going to 29th street auto for service or any car related issues.", "cool": 0, "date": "2015-06-02", "funny": 0, "review_id": "3LjzteMxZpRPULG94XliVw", "business_id": "ABTGvHgWmCMeXCkW0t86GA", "stars": 5, "user_id": "O6BrqA30Q6MZ_mpFVMFr6A", "useful": 2}, {"text": "I usually travel around for work, and to be honest I don't enjoy spending too much money on something that is absolutely NOT worth it, \nbut in this case...it was worth every penny.They got the job done fast n' right, and with a great attitude too...\n\n\ntry this out you guys, it's worth a try.", "cool": 0, "date": "2013-10-01", "funny": 2, "review_id": "pMBmOZG70Ar4S_UDj0wIqw", "business_id": "_6zwJv5LB_OwT9AHvbcR1A", "stars": 5, "user_id": "fxq5tEVsG3b24lFYhr_fAQ", "useful": 15}, {"text": "I am a discount connoisseur and have been to many discount/liquidation store in many states. most just seem like retail garage sales. This place is by far the most organized and professional Place I have ever been too. Clean, Organized, Great Customer Service and prices you won't believe. I don't know how they stay in business with what they are offering their customers. I'll be back there this weekend during the re-launch grand opening. (I hear the prices are going to be even better during this weekend event. The manager, Joe really knows his stuff. They have pricing set up with giant back-lit charts so you know exactly how much of a deal you'll be getting which is something I have never seen before.", "cool": 3, "date": "2016-09-17", "funny": 2, "review_id": "phI-J26hfMjt8m3lSWjFNg", "business_id": "MxZU1ww5v7gBYaCY4HHyzA", "stars": 5, "user_id": "XVUhYfWeqArlpBcV1YkIDg", "useful": 1}, {"text": "All expectations that I had before coming to this place was completely met! First off, we came a little late and Amy, without hesitation, kept the store open just for us. She helped us pick out a few really cute things and was super sweet. On top of that the prices were fantastic and they have events every month!", "cool": 0, "date": "2014-07-14", "funny": 0, "review_id": "sMRyUyMcuTfUiDyKaRENdQ", "business_id": "qv4uglcCltLA_RboWy9wJA", "stars": 5, "user_id": "Ul1jXf-eeU7TOkcuasoomQ", "useful": 0}, {"text": "The services and care they provide is excellent. They care about their patients. I would highly recommend Amari and Rob to anyone. They have many years of expertise and continue to grow in their field to help those in need.", "cool": 0, "date": "2017-08-30", "funny": 0, "review_id": "uEEMu_nbQLjvn0K5Clic0w", "business_id": "NVL5CH3M-JyuBB2thpEfWg", "stars": 5, "user_id": "ggaQ7Ur3EnBt6i93wMtolw", "useful": 1}, {"text": "I love taking my niece and nephews here whenever I have the time.  There are 2 floors here so plenty of space for everyone   There are many places you can sit, read, and relax.  I spent time with the kids on the first floor mainly reading picture books to them.  My older niece brings her own novel to read.   They love it.  It is like a new world to them instead of T.V. , video games, and their tablet.   I really want them to be encouraged to love reading as I feel the new generation of kids will miss out on relaxing with a book or magazine instead of electronics.", "cool": 2, "date": "2016-05-16", "funny": 0, "review_id": "8SedUV9EvfBY65SKwluBhg", "business_id": "zYh_8ieZffLp2qg15AELrQ", "stars": 5, "user_id": "tZo6F-eKN7Zv_4k-oAEQpw", "useful": 1}, {"text": "I like here and I will visit again in the future. To me this place just like old time Las Vegas buffet but without the long line.  We got here at 8:21am , no wait.  Weekday breakfast charges $18.99.  Good food selection.", "cool": 0, "date": "2017-10-24", "funny": 0, "review_id": "f1kjjo9WMvgaqFGVJE12kg", "business_id": "-U7tvCtaraTQ9b0zBhpBMA", "stars": 4, "user_id": "KBFoLX4xP1JXBdWqGTKKbw", "useful": 0}, {"text": "Possibly the only reason I came was because it was $4.99, and it seems to be the only reason I would come back again.\n\nFirst, it's almost exactly what you should expect it to be; cheap, small, tasteless with not many options. I'd have to say the service is fast, but the staff is not very aware of what they have to offer so make sure you are clear on what you are ordering.\n\nI saw previous reviews being able to order certain things like 3 color drinks, but apparently they were out of that on a Tuesday Morning at a little before 11am (not like the place was packed, one or two tables before we got in).\n\nPho was a small bowl, choice between the combination or rare steak. I've seen reviews of this being the best, compared to so-Cal and other places, I gotta say this is some VERY mediocre bowl of pho at best. Broth was a bit on the salty side, and whoever said this is the best bowl of pho must've been recovering from a bad hangover (coz then anything would've tasted great)!\n\nI was going to give one star, but the speed of service, and you really can't beat the special price of $4.99! I'll add a star for you...but make sure your staff is more clear on what's available and what's not!", "cool": 0, "date": "2016-06-21", "funny": 1, "review_id": "19VG8a7-F0hXF3UOLyJLBw", "business_id": "R1IeUbdKFS0aC1QZDT1_Dw", "stars": 2, "user_id": "bQB92eT209nALBAOnwhUHw", "useful": 2}, {"text": "Ich habe schon sehr oft Pizza bei der Quelle in Grünberg bestellt und ich muss sagen dass ich überaus zufrieden mit dem Lieferservice und der Qualität der Pizzen bin. Jedoch sind manche Pizzen etwas weniger liebevoll zubereitet als andere, um es mal nett auszudrücken Ich habe mal eine Pizza mit extra Zwiebeln bestellt und es waren zwei drei Zwiebeln drauf genauso war es mal mit extra Käse. Das ist das einzige was ich zu bemäkeln habe. Service jedoch sehr schnell! Alles in allem zu empfehlen!", "cool": 0, "date": "2008-10-27", "funny": 0, "review_id": "38zmetZd7b4MrjNYeGwq2w", "business_id": "RMDh7sP27mHdmy_urulwAg", "stars": 4, "user_id": "NIiFO8m4feKvX9mIq-vxeA", "useful": 0}, {"text": "The worst cleaners ever. Moronic and rude women. My comforter was due on tuesday. I go in on wednesday and they tell me to drive to their other store to look into it since they weren't answering the phone. No, I won't. Called late wednesday and they say maybe it will be done on friday... Never again.", "cool": 0, "date": "2011-07-27", "funny": 0, "review_id": "CZokBTsAsB52qf5hAg9Sfg", "business_id": "nCtdbFFsFjFe0i8lUZTeSQ", "stars": 1, "user_id": "yt3kGA8qyJDRYihAEY34yw", "useful": 0}, {"text": "Have to say this is now one of my fave brunches! Too bad it's 7 hrs away!\nWe started with bowl of mochaccini. The bowl is just huge, as big as a small rice bowl, with a marshmallow on top! How cool it that! We them ordered Champi and a French toast dish with egg and pulled ham. Both were tasty and huge portion as well! Even the presentation is top notch! I like that they put the fruits in a separate jar on the side. \nIt's hard to find a brunch place that serves hearty food but with a modern twist! I d highly recommend to all! \nOnly complaint is they ran out of donut holes! Look so delish! Order early!", "cool": 0, "date": "2015-10-05", "funny": 0, "review_id": "NBFN2-UbO_XeWt6dmObCog", "business_id": "LSPwq3J4WDHh6q3Cu0uMog", "stars": 5, "user_id": "fAIXquIYY3b9POruIo306w", "useful": 1}, {"text": "Deserves every star . Hands down the best and freshest Greek food EVER . You gotta try it !!! Try the feta fries . Yum", "cool": 0, "date": "2013-08-23", "funny": 0, "review_id": "26u3FMW8IckrDM2gLHchxg", "business_id": "5eV8oUGdBXylwB7HeaDFOA", "stars": 5, "user_id": "aahxmN1tsvlufuU_y4OT1A", "useful": 0}, {"text": "I went to Gotta Yoga for my ever yoga class today, and I'll definitely be back! The beginners class with Emily was really fun, and she talked the class through all of the poses and demonstrated them before we gave it a try, which I thought was very helpful. I was surprised at how easy it was to start to pick up the moves! The studio itself is beautiful and everyone was very welcoming of a first-timer.", "cool": 0, "date": "2013-12-07", "funny": 0, "review_id": "YYzgzjQeSPaltDuSaAq8Ng", "business_id": "_AiyFg3_gFbmV7Gc_F9VnA", "stars": 5, "user_id": "gOtJmI_llmF686G_Td7_Tw", "useful": 0}, {"text": "We purchased 3 days stay at the Riveriera Hotel in Las Vegas. We checked in at the self-check in kiosk, however they checked us in a different party's reservation and charged is for $100 hold and resort fees. We went to the room assigned and the room was not made. The bed was still used and dirty towels were on the floor. We went back down to the hotel registration and they informed us of the incorrect registration error and said that my card was now charged for our resort fees and that we will be credited for the other party's fees once they check out. When looking at the receipt, it showed my name with a different credit card number. I told them that it was incorrect and they was insisting that was the card given when booked with Bookit.com. It was past 12am and everyone was tired so we just got our new keys and went to our room. When finally settling in, I pull the blankets to climb into be and see white sheets with dirt on them. This hotel is dirty and the service is horrendous. If only we didn't oay in full already, we'd switch hotels. Never again!", "cool": 0, "date": "2014-11-08", "funny": 0, "review_id": "nXOze4091vHgsN-2JL4WOg", "business_id": "5Zc41a446gV3K_o7CDs69Q", "stars": 1, "user_id": "_68XIbvO5P7kCjb6ciCjuQ", "useful": 1}, {"text": "Well do not buy the oil change package. Bought it and have 12 left over oil changes to use in 9 months, and that is after doing them every 3000 miles, so called to see if they would extend or cancel them and was told NO that you had the option to buy them and you did and thats was your choice and we just sell them. So we paid 400.00 more then we can use . Save your money. Was going to buy a new car from them to again, but not this time.", "cool": 0, "date": "2015-03-09", "funny": 1, "review_id": "UAuVvJHsSOElSjE9d-fNKw", "business_id": "zhqurYCKYSCZmIEtus1Mzw", "stars": 1, "user_id": "9J1KxMDk9oRkotLSS0q9zw", "useful": 1}, {"text": "This place is absolutely amazing!!! It takes awhile to get your food, but so worth the wait. Check in. and get a .01¢ margarita!!! The staff clearly love there jobs, and s2r super friendly.", "cool": 0, "date": "2012-02-24", "funny": 0, "review_id": "IpGWF1mYtmObfkwB9sJhMw", "business_id": "GpX1PmgplBrG_DLiJVDC-g", "stars": 5, "user_id": "BUF2lN15EcYf0dw8pKDsSQ", "useful": 0}, {"text": "The prickly pear mimosa is a great drink to start off your day, there are also many other flavors where that came from and a good selection of beer. After getting some mid morning drinks in me I then moved on to the tostadas for an appetizer, they were damn good with a great combination of flavors. For the main course I got the Green Chile Pork Belly, great portion size and an excellent pairing of flavors. There are few things I love in this world and brunch is towards the top of the list, if you're anywhere in the Las Vegas area this place is worth the trip to come and check it out. Little chilly right now hit the outside patio area looks like a great place to have a Sunday brunch get together.", "cool": 0, "date": "2017-02-01", "funny": 0, "review_id": "i_4gS39b8DTemruLTxg1TA", "business_id": "uBdYMY6a6A7FyxzTSwOiDg", "stars": 5, "user_id": "NWmvAVQVQ16Hsz-qY5GoJA", "useful": 0}, {"text": "Really good food at a reasonable price. I'm huge on breakfast food and they definitely do a great job of it here. I have not tried their  lunch yet but the specials sound really good. The pancakes are the best I've had around here.. Crispy edges but nice, fluffy and light middles. Also I have to say the breakfast sausage was really good and I'm a little picky about that. Very nice staff and owner! Service was fast and food was fresh. If you have not tried them out you should! I hope other yelpers come and support them so they stay around for a long time. This place is a keeper. Can't wait to come back and try more items!", "cool": 0, "date": "2015-05-14", "funny": 0, "review_id": "TCGgXuzCEanKKxPj8cDsRQ", "business_id": "om7YKYOC-Dulqq4Bl5lRYg", "stars": 5, "user_id": "Aj-vJie7jbpO4fUf2oYjjQ", "useful": 2}, {"text": "This is a new restaurant...so give them a try! The food was good...pad thai was great. The customer service was outstanding!", "cool": 0, "date": "2013-01-13", "funny": 0, "review_id": "JN7pOt8hPvsxl65SjW_0bQ", "business_id": "60qcZ_mzu-IP82GtANZ6lw", "stars": 5, "user_id": "8rAJywtZ0H5CcAhgqN15bw", "useful": 0}, {"text": "My thoughts & prayers go out to all the Republicans that got \"trumped\" @ the polls by the Democratic tsunami yesterday. On to 2018 & say goodbye to this horrible Congressman Franks. He's been in office since 2001 and must be FIRED!", "cool": 0, "date": "2017-11-08", "funny": 0, "review_id": "8aLwBkPkhD20XXiBVjWhUQ", "business_id": "_1T0VS6jIQt7wA8yboq0Mw", "stars": 1, "user_id": "rkjN1rJ1zEz7vv_sU4hdig", "useful": 0}, {"text": "BBQ chicken was tender and juicy. Salad was fresh and many combinations to choose from. Cod fish with potatoes was uniquely delicious. I love this place. It's these kind of small unique places that prepare food with care and love.", "cool": 0, "date": "2013-10-09", "funny": 0, "review_id": "ApdrMlGmcUQviZU56JHbgA", "business_id": "sV2EE3u1SxxaFAuZedZD_w", "stars": 5, "user_id": "blzF5Nml_TganU1ePimKcw", "useful": 0}, {"text": "I highly recommend Dawn Hart for a facial.   I have been going to her for about 3 years.   She is highly professional, uses excellent products and has greatly improved the appearance of my skin.", "cool": 0, "date": "2016-03-31", "funny": 0, "review_id": "0aluUd1GSAVbDnwCAC0Hog", "business_id": "lmarjSTpK1RkyGUJS7a0YA", "stars": 5, "user_id": "K3Rj5iiY0b6EX0hBEgROTQ", "useful": 0}, {"text": "Sandwiches are very good, fries are constantly undercooked and soggy.  Buffalo chicken sandwich is excellent.  Typical meal around $7.", "cool": 0, "date": "2012-05-23", "funny": 0, "review_id": "8q0kbbK0mVs6QWqEoM4CuQ", "business_id": "v8k8aVrVzWoG54U_OkMGOw", "stars": 4, "user_id": "w_PPO6s7M0CM9bn4V_TyBQ", "useful": 0}, {"text": "Easily the best bakery in Oakville. The aroma alone is worth a visit and I guarantee that it's not possible to enter and leave without making a purchase.\n\nThey have an amazing array of fresh baked goods and various kinds of ready made meals. Their potato wedges are particularly good.", "cool": 2, "date": "2009-03-23", "funny": 1, "review_id": "GD8kfA81bIC6h5P_WTs6_Q", "business_id": "b7BOLCyfE8Com3IglsVmdA", "stars": 5, "user_id": "_pyEzgAtUSsogY8aqsZG4Q", "useful": 4}, {"text": "Let me begin by telling you I was recently in the market for a 2014 Nissan Pathfinder. I had done all my research, and knew what trim level, color and options I wanted. I talked to someone named Cruz at your dealership a few months back, and he was really helpful. I wasn't ready at that point and he followed up and I still wasn't ready. When I became ready, I decided to stop by this dealership for the first time around noon on Saturday, March 21st 2014. That's where I had one of the most unpleasant experiences of any dealership visit that I've ever had.\n\nI had never met Cruz, so when I went in, I had no idea who he was.  I went in through a side door, so I did not immediately see the receptionist. I walked around the dealership, aimlessly, for at least 5 minutes. No one said anything to me. I saw someone and decided to ask if there was a Cruz working, and he replied yes and did not seek to point him out. I finally found the receptionist (Daylin), and she seemed not very friendly and into her phone. She did page Cruz, and I began to wait. 10 minutes later, I asked for him again, and that's when Jacques Deadwiley came over and asked if I was being helped. I told him I was waiting on Cruz, and he attempted to call him on his cellphone. He walked outside and came back in and told me he was with another client, and that he himself would help me.\n\nWe went to a desk, and I told him I only had 30 minutes today, and he said cool. I told him what I was looking for, and he brought in a salesman who took over. He was very nice and began taking my info. Again, I told them I had 30 minutes and had to be somewhere. I had Jacques card, so I planned on calling back after he had my info and I could see what kind of deal he was going to offer. After being there about 45 minutes, I walked over to the glass booth and told them I was leaving, but I would call back in a few. That's where the real problem began.\n\nDawud Muhammad, who I had not spoken to and only know his name based on your website, aggressively threw his hands up and said \"I thought you wanted to buy a car!\" in a condescending tone. I replied \"And this is supposed to entice me?\", referring to his tone and approach. I then walked out to my car. Dawud followed, and as I got in my car and attempted to close the door, he was holding onto my door. I can't really remember all that he was saying, because at this point I was insulted and ready to go. The salesman came out and I told him that I felt Dawud was an a**hole and I asked for the salesman's card. He said he didn't have any on him. After another brief exchange with Dawud, I drove off.\n\nI called Jacques back in 10 minutes, and he asked me why I left. I told him, just as I had originally told him, I had to be somewhere. He replied \"I thought you wanted to buy a car? I had the deal worked out and then you walked off\". I advised that I did and that was why I was calling back. I asked what the deal was. He said he had thrown the numbers away since I left and had to start over. At that time I told him that I felt like he was playing games, and to forget it. He angrily hung the phone up.\n\nThis by far is the worst I have ever been treated by a car dealership. Nissan dealerships in this area and I have never had such a horrible experience.  I have worked in sales before, so I can honestly appreciate an aggressive sales approach. This was over the limit though. You can't talk to and treat people in this manner and expect them to patronize your business. I felt insulted and I think they tried to shame and belittle me in an attempt to push me into continuing to stay there and wait forever. This experience sucked on every level.\n\nS/N: I purchased the car I was looking for at East Charlotte Nissan a few hours after this experience.", "cool": 1, "date": "2014-04-02", "funny": 4, "review_id": "8eLNi_AVoHI6IleGbQq29g", "business_id": "gikE-cNxKdzyZvY3kjFgbg", "stars": 1, "user_id": "HrduXLtltyC8BKy5s4jNQQ", "useful": 9}, {"text": "We cancelled our reservation because of the hosts terrible attitude. We had called to confirm and they had lost our reservation. Then we remade, but when we showed up, they would not seat for happy hour drinks and told us they would \"try\" to seat us for our reservation. As I said, We cancelled our reservation because of the hosts terrible attitude,  and it takes A LOT for me to do something like that.", "cool": 0, "date": "2013-07-06", "funny": 0, "review_id": "_UhqHt_x-Ycxq5CCRz5ETA", "business_id": "ddlnpDxGDDxGGoG_dVXwiw", "stars": 1, "user_id": "fbP3s5ds_rVlH-sK93hZpg", "useful": 4}, {"text": "THIS IS PLACE IS AWESOME. The SWEETEST arcade selection. TMNT, Tetris, Galactica, Frogger and so much more. They also have a couple sweet pinball machines...Dolly Parton, and, what excited me like nothing else, because I an HUGE fan, was an Elton John Pinball Wizard pinball machine. Awesomeness. Oh. Aaannnd.....they're FREE!!!!!!!!! WHAT WHAT. Good beer. Couches (or as my friend made a point to mention, a \"real Chesterfield\"), and a friendly vibe. Open late, an overall good time. I had this whole moment, when I was like, \"ohhh Galactica. I'll play this for a couple minutes.\" Beer in hand. I make it to round three. Beer gets set aside. Die a few times. Things get serious. I played hardcore for 30 mins. Chicks runnin' into me and all, and all I could focus on was demolishing those little crappy pixel-filled machines. Point is. Go.", "cool": 0, "date": "2014-03-08", "funny": 1, "review_id": "BLJZcnqfoAnNcLIL5-9_Rw", "business_id": "byVmQiGVTyLrG_74OFJ7eg", "stars": 5, "user_id": "rwPi952Np-QHwHXmcOSQLQ", "useful": 0}, {"text": "Yum food we tried birds nest & clay pot chicken with mushrooms that's number 51 on menu", "cool": 1, "date": "2017-04-02", "funny": 0, "review_id": "45-d9T7vTqbhzAn7BrHfVQ", "business_id": "ES5KDuquIk2h4_VsgoUQMA", "stars": 5, "user_id": "9gX29q0kEr2L35YmCgz4pw", "useful": 1}, {"text": "This is my favorite dive restaurant  in all of Las Vegas.  The food is made fresh and cooked to order.  The business is family owned and ran and the folks are all very friendly.  \n\nMy favorite is the Ruben Sandwich.  It is made with fresh mozzarella cheese, suaerkraut, thousand island dressing, and pastrami piled high on grilled marbled rye bread, served with an order of fresh cooked french fries.  \n\nYou can't beat their Chicken Wing Tuesdays.  Each wing is 50 cents and deep fried to order.  They cook the wings until they are crispy outside and juicy inside and can be tossed with your choice of mild, medium, or hot wing sauce.\n\nThey use Vienna brand hot dogs and buns which are delicious (and don't give me the usual hot dog indigestion!)  \n\nWindy City also makes their own giardiniera with different levels of spiciness and is to die for!  \n\nDon't forget to try their Wunderbars!  Frozen, chocolate dipped cheesecake on a stick! \n\nAll in all the food is fantastic, the price is right, and the people are friendly!  I absolutely love this place.", "cool": 0, "date": "2014-09-12", "funny": 0, "review_id": "e722d-T8zTiDy3eVekHPUA", "business_id": "WmLTIN4qzZ8SjpPxsPH27Q", "stars": 5, "user_id": "QWUCx_phlA-LNq8ykamQgQ", "useful": 1}, {"text": "I have only had 2 Brazilian waxes in my life, and the 2nd one was just done by Deyna. I had a horrible experience during my first wax in Canada, so seeing Deyna was delightful! She made me feel 100% comfortable, and she was very chatty and kind. She uses bed sheets as waxing strips and they work so well! She even showed me the roots of my hairs on the strip and educated me about how waxing works. I would recommend her to anyone! I'll be back to see her when I'm back in Mesa later in the year. Ask her where the \"F spot\" is. ;)", "cool": 2, "date": "2013-01-01", "funny": 1, "review_id": "2YqTQlsVhaGyPqUn9FibIg", "business_id": "kOSNolIegCW4Qd-LquZwrQ", "stars": 5, "user_id": "mtUfZUXqSz7BgkSvceDEeQ", "useful": 5}, {"text": "Shane, Cheryl, and Marc are the best ever! They are so welcoming. First of all they made me feel so comfortable leaving my car there for the weekend, not making me feel like they are going to milk my bank account like any other auto shop does with a young girl. They are such personable people and had good laughs with everyone there. When I went to pick up my car, Marc was nice enough to stay about 30 mins passed closing time because that was the soonest I could have gotten there. He said it was his pleasure to stay and help me. He told me he got me the best deal he could on my car parts which made me leaving a very satisfied customer. WILL BE BACK FOR SURE! Thanks Shane, you run an amazing business here! Much love.", "cool": 0, "date": "2017-07-06", "funny": 0, "review_id": "32_67jsiK_wntiIVYlFlUQ", "business_id": "ao-k5gZVwkeceTqGsknukQ", "stars": 5, "user_id": "IXQ7xJrqnH8lMvBTEIVIpA", "useful": 0}, {"text": "I used this tanning salon to get a spray tan for my senior prom. It was my first time ever so I really had no clue what I was doing. I called and asked what I should do to prepare my skin and talked to the owner (manager?) who was very helpful. The next day I came in and she gave me exactly what I was looking for and had me cracking up! I got an all over airbrush for $40. After my shower I noticed my right forearm was getting muddy-looking and I didn't want to go to prom like that! I called the salon and she told me to come in and text the manager a picture. I got an instant response, saying it was probably a very dry patch in the skin that absorbs more color and she said the technician could fix it easily and provided more instructions on how to maintain specific to my skin. After that it never got splotchy and faded very evenly. Definitely recommend for airbrushing! I have not utilized the beds they offer but might go back and try it just because the staff was so welcoming.", "cool": 0, "date": "2016-04-29", "funny": 0, "review_id": "-u0gH-D-gnCWn-y3Pj7sEA", "business_id": "u2rwHL4RS-Z-QDtietcQPg", "stars": 5, "user_id": "_935SaxZ8w7CN642KwIx_g", "useful": 0}]