[{"date": "2012-01-24", "stars": 5, "review_id": "oSIgGw3EsHkhoygD4LvcVA", "user_id": "YtRt9iiC4mt6kfV4-EScbA", "funny": 0, "text": "Came here with the CTO of the company.. great service, great food, great atmosphere!\n\nThe food was absolutely amazing.. and since it was on the company, I cannot complain on the 1600 dollar bill at the end of the meal. (we had a table of 12)\n\nYuzu is definitely a place to go for a special night out. =)", "business_id": "zA6gnF5aPBGoOm6uIbKt-A", "cool": 0, "useful": 0}, {"date": "2017-03-24", "stars": 5, "review_id": "2I1MSgeUUogjzK9BYiON2Q", "user_id": "tjuuqwS4UBSchpK4mp18Xg", "funny": 0, "text": "I would recommend Jenny & Justin Wu without hesitation. I have worked with many realtors and Jenny and Justin are hands down the best - the best in service, attention to detail, meticulous, and goes above and beyond. I have used them both for a sale and a purchase and found both experiences to be extremely positive. They are easy to work with, always available, and I will reiterate that their attention to detail, which I believe is critical in real estate transactions, is hands down the best - I feel that I can trust them implicitly. They also made me feel like I was their only client. In all, I've had only positive experiences with this team.", "business_id": "BoOceE98Hvg1i8vpZdkXUA", "cool": 0, "useful": 1}, {"date": "2013-05-20", "stars": 4, "review_id": "Xx1lPa_TKB-7FHuuy1hIiw", "user_id": "6PVQb_65XZTgjEIxky48-A", "funny": 0, "text": "Great onion rings and good traditional margaritas (not the American slurpee verison)\nhttp://omnomtaro.blogspot.ca/2013/05/review-thompson-diner.html", "business_id": "769NudnrUxWFtJCGU66A_A", "cool": 0, "useful": 0}, {"date": "2017-01-27", "stars": 5, "review_id": "jrxSN6cETyf2PccJIEuk8w", "user_id": "7fd64q51hyaJQQpVA69TCQ", "funny": 0, "text": "You can't have it all.. service is a slightly lax but I love the food and vibes on a busy night.", "business_id": "220Z1EQZwj9IsUhT9SdLiQ", "cool": 0, "useful": 1}, {"date": "2011-01-31", "stars": 5, "review_id": "PJyPWDPGqsnUk9j2fSc_hw", "user_id": "wEkCGYH3e9Cb0dMU498syQ", "funny": 1, "text": "Like so many others have said, this IHOP is a pleasant surprise in central Phoenix.  It is a chain, but offers superior food for the business type, and efficient, pleasant service.  The interior is newly remodeled and clean.  \n\nThe menu is pancake-ish, but has many diner-ish, Denny's-ish favorites too.  And it's surprisingly edible.  I had a chicken-fried steak, and it was crispy, peppery, meaty, gravy and not too greasy.  A breakfast here was cooked properly and served hot.  Coffee tasted good.  Place is clean.  Service is fast and responsive - the staff really hustles.  \n\nI wish I'd found this earlier, that I wouldn't have wasted time and money on overpriced mediocre breakfast places in the area (Good Egg, First Watch, Coco's).  IHOPs (and Village Inns) are a couple bucks cheaper than the food at other places in the area.", "business_id": "3kVThNUM1mzz1lBtxdSJxw", "cool": 0, "useful": 1}, {"date": "2017-06-30", "stars": 1, "review_id": "ZXc6158iGjA4M0CO5myvXw", "user_id": "6F_EP371F7LISztOpck_vg", "funny": 0, "text": "I've never had issues with hotels, given anyone in the hospitality tries their best to exceed customer expectations. Some of the issues we had with MGM grand on our stay here earlier this month:\n- bed bugs\n- unchanged sheets - found rogue t-shirt tucked at the top of the mattress, indicating that they didn't change the sheets from the last stay\n- terrible customer service from the general manager on duty\n- unanswered assistance from the corporate guest services team\n\nBe VERY wary when you're looking into booking your stay here. While mishaps are forgivable, bad customer service is not.\n\nNote to MGM Grand LV - you should pay better attention to your guests to build loyalty, rather than ignore them and pull some PR stunts (i.e. sponsoring bloggers' bachelorette parties) to try to revamp your image.", "business_id": "El4FC8jcawUVgw_0EIcbaQ", "cool": 0, "useful": 6}, {"date": "2015-01-13", "stars": 5, "review_id": "Tcdomzd_9vWDCCIFMB5pJw", "user_id": "Cn_Tctt6BKR8fU9k94i2yQ", "funny": 0, "text": "Delicious snowcones with fun flavors. There's always a friendly staff with fun concoctions suggested!", "business_id": "J4iCg9pHLFihFC9LETupMg", "cool": 0, "useful": 0}, {"date": "2015-09-22", "stars": 5, "review_id": "ph5kgYqwqnzxBed2WSTB-Q", "user_id": "16Ckf6oyph6N2s8-4lBqlQ", "funny": 0, "text": "I can't speak on tattoo work here. However, my daughter got her nose pierced. She said it was nearly pain free. He did a great job. Later I brought my granddaughter for a Monroe piercing & she loves it. Both were very pleased and they wear their piercings proudly.", "business_id": "hJxLopef3PquvT1trfg-cw", "cool": 1, "useful": 9}, {"date": "2015-01-19", "stars": 5, "review_id": "hyNzwxPbYlneeRFpNZbZSw", "user_id": "2qGWg83C_RwJF0dtTOOT6Q", "funny": 1, "text": "This is a cute little restaurant in the strip district.  I was greeted by the ambassador with the name Don. He was very nice and explained to me all the dishes including his recommendations. I had the new York strip and it was cooked to my request.  The restaurant was small so the max capacity was around 10 ppl the most.  Overall the food was good and the kitchen staffs were very friendly.\n\nThis place is very small so don't be shock if you have to stand by the sauce and condiments table in the middle of the restaurant.  This is so great about these little neighborhood restaurants b/c you feel like you're at home.  I'm not sure about others, but I'm not here for the 5 stars ambience.  It's all about the food taste for me!  I ate at places where I have to sit on the curb, and the police chased after the food vendor for non-established restaurant.  If I have to sit on the sidewalk for Gaucho then SIDEWALK IT IS!", "business_id": "u4sTiCzVeIHZY8OlaL346Q", "cool": 1, "useful": 2}, {"date": "2015-06-16", "stars": 4, "review_id": "nHD8cXL2zTr47N2M1eRtkw", "user_id": "d0kLd-ENvX6P-pS_StWqeQ", "funny": 0, "text": "We came here again with a party of 10 and I was surprised about the improvements! The server we had was amazing! This gentleman really took pride in his job and made sure we were well taken care of. We ordered way more than we could finish and didn't bother cooking it ourselves this time. I think this is the way to go whenever you come here. It saves time and we didn't have to worry about our gas running out, needing more butter, etc.", "business_id": "8Y5p2IQMLX6QjGPzxanexg", "cool": 0, "useful": 0}, {"date": "2016-12-27", "stars": 5, "review_id": "bImEIqY-wvvQTGriRbXxRg", "user_id": "6JO3DsfORY1oz4B2KQM0AA", "funny": 0, "text": "This place is busy busy but all for a reason! Amazing customer service and an even better job on my nails! I love them! Will definitely be returning!", "business_id": "dfTqdlcuEN-vHWKYq29B7g", "cool": 0, "useful": 0}, {"date": "2017-08-24", "stars": 3, "review_id": "tpCU-fPiBNWx29pYLUDxQQ", "user_id": "8Lg_J2JX7KPIbttsm0DQ2g", "funny": 0, "text": "This is my second visit to this taco Bell. The first visit last year was a disaster. I stood in line and no one was there to take my order.. I left after 2 mins. Nobody cares..\n\nSecond visit was today. things have improved.. employees actually working and taking orders.. however they don't sell Loaded Grillers at this location.. and who knows what else... So had to order something else.\n\nFood was made fresh and tasted okay but my stomach protested a tiny tiny bit.. not sure if it was the cheese or something else.\n\nThe bathroom was the dirtiest taco Bell bathroom in the history of taco Bells.. and I have been to many. I'm going to guess this might have something to do with some of their clientele...", "business_id": "XxnnXca0ODSmMpS5QrWlCg", "cool": 1, "useful": 0}, {"date": "2012-11-18", "stars": 5, "review_id": "EERHBEdxvMVbKysUu3gM5A", "user_id": "zPWs04O9t1gy4WR3WLHM6g", "funny": 0, "text": "they use sunburst farms produce and products. everthing is fresh daily &absolutely delicous.  very hospitable and passion for there buiz. one of the unique things was, for  first time visitors you will receive a free mouthwatering chocolate.", "business_id": "OVb3wbv59wTcd0pQrXBZXw", "cool": 1, "useful": 3}, {"date": "2012-08-11", "stars": 1, "review_id": "20DrqD9wa0E_BQL-LYCd8A", "user_id": "QCjLb7L7KfE-nDyAvoDreA", "funny": 0, "text": "Response to an earlier review:\nWaitress: Is a Service Provider, An Employee and is the lasting image of customer satisfaction. It is what owners and investors of a business rely on to have return business. It is a shame that this establishment perhaps made a mistake in choosing this person to front their future. Thanks for posting.", "business_id": "BjPph9SbmEfox2vip326PQ", "cool": 0, "useful": 0}, {"date": "2011-07-28", "stars": 1, "review_id": "n0hHMMYBBXKR4zteRt64vw", "user_id": "yr1njeW0HhkwiZpnxrmlDg", "funny": 0, "text": "I don't review often, but I am still sitting at my table here at Grimaldis and I had to write this review. The pizza i just attempted to chew here at Grimaldis at Park West was less than average. The crust was supposed to be the best part and it was not at all. It was so chewy that me and my partner could barely chew it. The toppings were sparingly and they charge for every topping ($2).  I Have eaten at Grimaldis in Scottsdale and it was much better. I would much rather have had pizza hut than this. I love pizzeria bianco and rays of ny. I hope mgr here sees this and figures it out soon.", "business_id": "93FNDjCBsdbKkUoh3UVS4g", "cool": 0, "useful": 1}, {"date": "2018-06-30", "stars": 5, "review_id": "d5kRCTOtcnKDRxy7-p9_Wg", "user_id": "KRwN9XtWxaOQ5qpJ5khtsQ", "funny": 0, "text": "Still the best place to come! Thank you to Victoria, Stephanie, Kyler, and Bleu! You made our vacation great!", "business_id": "uuGL8diLlHfeUeFuod3F-w", "cool": 0, "useful": 0}, {"date": "2018-02-07", "stars": 5, "review_id": "OPJUMN2SbX_F9yaFKbZMEg", "user_id": "sQ2s0_EdpPNQEdAXushNWw", "funny": 0, "text": "OMG I thought I went back to Paris. Love this place for a great brunch before a hiking day. This place will remind you to take a break from life :) just have have a coffee under the sun!", "business_id": "2SfSzEd3B7WimeZac23zhg", "cool": 0, "useful": 0}, {"date": "2014-05-11", "stars": 5, "review_id": "h4RDZJBJWqccmPQS9Yr9sg", "user_id": "fG5L3deSheWo1IszzluJSg", "funny": 0, "text": "I got a flat tire last week on one of the two good tires I had in our car. As date and or my life would have it it couldn't have come at a worse time for me.  At a time when my wallet is a little empty till my next pay I went to the trusty guys at discount tire. \n\nI have been a loyal customer of discount tire for over twenty years now. In all this time they have ALWAYS gone way more than far and above to take care of me. Fri was no different. I went in to get my flat fixed because they will always fix a flat tire for free! \n\nNow I should prob mention that my two rear tires are in dire shape. I'm talking real bad. I just didn't have enough to get new or used tires at that time. I was going to have to wait till Monday our Tuesday to get new tires. \n\nWell the guy who took care of me (I won't say his name because I wouldn't want him to get in trouble) really saved my skin. He saw how bad my rear tires we're and told me that he just came into two used tires that he would put on my car for me to make sure that I was safe to drive again. This isn't the first time discount tire has saved the day for me. No matter where I'm at in this country I know that where ever there is a discount tire I'm gonna be treated great!  I will forever be a loyal and grateful customer!", "business_id": "mZT41UFgaHVNL2Q6iM19aQ", "cool": 0, "useful": 0}, {"date": "2013-04-22", "stars": 4, "review_id": "Cq8S9Uoskc3m1_TP17B-aw", "user_id": "VXuHnpO4AvZjgfL5KmEEug", "funny": 0, "text": "I use their 5 dollar wash and do the vaccuming myself.  It is very quick and convenient.", "business_id": "fIqJXdqTrokeOyYpMVxhfw", "cool": 0, "useful": 1}, {"date": "2016-01-13", "stars": 5, "review_id": "9ZBEJFUuusuRfliDhG0sjw", "user_id": "QbFTdA-NXmK3PJxgK-DVdg", "funny": 0, "text": "Absolutely this place gets a 5-star rating.  To give you some background, I'm on the hunt for some very select vintage items for my wedding.  I've been scouring Charlotte and the surrounding areas for flea markets, antique shops and the like.  I actually happened across Garrett's Antiques on Instagram from one of the local Charlotte accounts (go social media!).  I instantly added it to my list of places to visit.\n\nFirst impression was that it was not what I expected. I have been visiting places like Sleepy Poet and Oak Mill, which are more of a warehouse feel... but Garrett's is completely the opposite!  You might miss it if you don't know what you're looking for.  It's a small wooden house on Lancaster Hwy with a sign and a bunch of firewood out front.  You walk in thinking that it has to be the size of a shed inside, but it goes back fairly far.  It's not an enormous selection, but what he does have is fabulous.  I wish the store went on for days!  There are a lot of vintage and antique items to sort through and look under.  I actually found a few more items than I was looking for and had to put my blinders on.  If you're looking for jewelry this is an amazing place, there are cases beyond cases of silver and turquoise pieces with other items mixed in.\n\nThe husband and wife running the place were so friendly.  You can tell it's one of those places that people come to hang out and chat.  \n\nIn general I really enjoyed my time here and would absolutely go back to hunt for some more treasures!", "business_id": "J1YapC1qJJ-QbzZOIbavgA", "cool": 1, "useful": 2}, {"date": "2016-04-01", "stars": 5, "review_id": "37XZgkCQlVenV2eSUudi7g", "user_id": "xEbCNG-3GTw-OxFusnVP9g", "funny": 13, "text": "Downtown Las Vegas has been going through a true revitalization in the past decade or so. An influx of investors, support of city Government, and the social trend toward hipster doofus' running over the city had brought a new interest and atmosphere that is generally welcomed and a positive spin on what was a largely forgotten part of the modern Las Vegas not more than 15 years ago. \n\nThe \"Arts District\" is an area in Downtown Las Vegas that occupies the section south of Fremont Street, before the Strip starts at Sahara (The Stratosphere). Events like First Friday and other local artistry galleries occupy many of the older buildings on this side of town and this particular restaurant occupies a large building near the corner of Charleston and 3rd. Once occupied by the shuttered Bar & Bistro, The Downtown Crown is owned by the same proprietors that own the famously popular Crown and Anchor restaurant near the Strip that caters largely to the UNLV college crowd. \n\nThus restaurant is quite different than its frat boy parent property. The building is more ominous. The patio is excessively large and in a phenomenal location for events and parties. The bar is nice and not changed at all since it was Bar & Bistro. They have added more intimate seating and the waitress uniforms are something out of Twin Peaks or Hooters, but with a British Flair. \n\nWe had the pleasure of having a social, friendly, perky, and personable waitress named Madison. She was named after the mermaid from the movie Splash. Yes, she's that awesome. \n\nThe menu offered several tastes of Great Britain, with things like Scotch Egg, Chips, and my personal favorite, Beef Wellington. Unlike most Beef Wellingtons that you will find in old school gourmet rooms, it is not a dish made for two. I have never seen this dish offered for one, and at the extremely reasonable price of like $15 or $16. \n\nI was EXTREMELY pleased with my experience at The Downtown Crown. From the impeccable service and personality of Madison to the delicious British fare, I look foreard to returning again and again. \n\nPlus, they had a Yelp deal. Cheerio my good chap!\n\nGo there and hopefully Madison will be your server. And get the Scotch Egg. Trust me on this one.", "business_id": "IkI9yPjx-MRYh-Jh-LqIiQ", "cool": 17, "useful": 19}, {"date": "2017-04-01", "stars": 1, "review_id": "fHGQVgGbAjpVw1GcLcWfFQ", "user_id": "nhPGTThuFWQ7LhKoqBg8Ag", "funny": 0, "text": "Do absolutely not stay here. \n\nListen to me. Do. Not. \n\nStop yourself right now. I know it's cheap, but it is not worth it. \n\nWe were supposed to stay at the Ramada Tempe near ASU for a week while in town for a dragon boat paddling camp at nearby Tempe Town Lake. We only ended up staying at this hotel for 2 nights. Read on to find out why. \n\nThe hotel is located in a dodgy part of town. Every day we were there I was hit on by different undesirable characters. As two females we did not feel safe at this hotel. \n\nThe rooms were beyond outdated and dingy. They were downright disgusting. You could see marks on the walls from where people had killed bugs. There was foil over the vents to prevent roaches, but there were holes in that foil. Even the upgraded rooms were disgusting. Everything smelled like disappointment and broken dreams. Only one light in the room actually worked. \n\nThe suites with kitchenettes have no utensils, pots/pans, dishes, etc. Just 2 hot plates, a fridge and a sink.  \n\nOn our second morning I woke up to find myself covered in bedbug bites. 32 of them to be exact. We got a full refund and got the hell out of there. \n\nWhen I went to the front desk to tell them about the bedbugs they did not look surprised at all, and refunded me without even asking to check the room for bugs. It seemed like a familiar tune to the staff. \n\nThe staff were friendly, but not helpful really. We asked for luggage stands in our first day and we're told they would be brought to the room. That never happened. \n\nDo. Not. Stay. Here. Ever. At. All. Just. Don't. Ok.", "business_id": "1l-6sFjSKgQ7zIlvlX8uiw", "cool": 0, "useful": 2}, {"date": "2014-10-05", "stars": 5, "review_id": "NwBDMV21BVcn0mY1qzZtxA", "user_id": "7C0RG6Uqu0l9IIgDFCAtYg", "funny": 0, "text": "GREAT SERVICE! GREAT FOOD! The manager Eduardo went above and beyond out of his way to make sure we had a memorable dining experience. He felt a little bad bc there was confusion when we got sat and it took a little bit too long for our server to get to us. Thank you Eduardo for everything I have a new found love for this place.", "business_id": "kRgAf6j2y1eR0wOFdzFAuw", "cool": 0, "useful": 0}, {"date": "2015-09-23", "stars": 5, "review_id": "n8kCEusuTuFDShTZ19wKog", "user_id": "TL2VxNMd456VFFTti5NWow", "funny": 0, "text": "Nice friendly staff. My phone starting malfunctioning while on vacation in Vegas, was having lunch at a restaurant near by when i Walked in and they gave me a later appointment that day. I went and took care of a couple things I needed to do then came back, they ran their diagnostic test then ended up giving me a brand new phone on the spot. Great experience. Thanks apple :)", "business_id": "R_syplGIQrqZc9DaAsmVfA", "cool": 2, "useful": 1}, {"date": "2017-07-16", "stars": 3, "review_id": "DGeMXJjrtTE-VqAA5-gfbA", "user_id": "ZEA8vnoxMa016XzoDMyEDQ", "funny": 0, "text": "... so, I like the idea of indoor play areas.. I don't necessarily like the idea of $10, plus couches that you can't sit on because they're stained and because a lazy parent is literally half asleep on them.. overall, not a bad place. My 16 month old really enjoyed all the blocks and toys and I enjoyed that I got to sample some free coffee. However, there is nowhere for parents to sit if they're supposed to be paying attention to their kids. They have the one dirty couch, and there are two other chairs that face the area. Behind that are picnic tables that you can't sit at AND watch your child. The absolute worst part about this place is that everyone has to wear socks.. not terrible, right? Oh, except in order to use the bathroom, you have to walk in with your socks on and ewwww gross.. I had to walk back to the front, grab my shoes and walk to the back and put my damn shoes on because I'll be damned if I'm using a restroom that looks like this.. that's pee y'all, from the kid who attempted to use the restroom by themselves before me.. you know, because a parent couldn't actually be tending to their own child. \nTwo young kids at the front chatting away.. not giving a crap that people are walking in and out of this bathroom spreading pee all over the place. Toys that are put in children's mouths are supposed to be placed in a basket to be disinfected.. which makes me wonder if anything NOT put in that basket is disinfected..? I can only hope because some people are straight up dirty mother f**kers..", "business_id": "Na-3fUpjlaYy5cdtcWeOzQ", "cool": 0, "useful": 1}, {"date": "2015-08-20", "stars": 2, "review_id": "wSrSUMqLVeYdWTXrS6Iy9Q", "user_id": "gG_-jUOhDMH-o7TX87QUog", "funny": 0, "text": "I feel bad killing this place in my review but a brewery that has bad beer is not a good thing. In comparison to American style ipas, ambers, porters and stouts, it was lackluster to say the least. I didn't try any Belgian style needs as that isn't my thing. It's really only tourists and the food didn't look that great. Be wary.", "business_id": "LU53AhAlVgUiCsVfZy872w", "cool": 0, "useful": 0}, {"date": "2013-03-25", "stars": 4, "review_id": "GlWZbVkncZV9a9PdN0hq4Q", "user_id": "iceCZxFly5114Wl35LVEpQ", "funny": 0, "text": "I love the food, love the staff, love the overall atmosphere. \n\nAll I ask is for more of a hustle in getting seated. Kind of slow with cleaning off tables. \n\nI definitely recommend this place. So good!!!", "business_id": "HVyxN-G8NOfUHo2cEnilVw", "cool": 0, "useful": 0}, {"date": "2015-01-17", "stars": 4, "review_id": "NFxCt5dDHW1kasxhn5kbqw", "user_id": "QGXnZAEWKtW_wxx2Px4dEg", "funny": 0, "text": "The burger was great (LA Burger), but the star was really the chipotle ketchup that is on the tables! I had it with my sweet potato fries and found it to be better than the sauce provided! Tangy and zesty!! Yummmm", "business_id": "iIwKW2cBAxjElE8eUzjwqA", "cool": 0, "useful": 0}, {"date": "2013-05-04", "stars": 4, "review_id": "jUs36KfrhdUneChWIqsHXQ", "user_id": "jkt9eRisDJlnCxIGLC9sQQ", "funny": 0, "text": "We have been here a number of times now and have never been disappointed with the simply devine cuisine. Favorite place to sit is in there inner patio, the ambiance is beautiful. Perfect place to go for lunch or early dinner on Sunday afternoon.", "business_id": "or4UVDjXEEjze3wNPjoAZA", "cool": 0, "useful": 0}, {"date": "2018-01-25", "stars": 5, "review_id": "wWDhd5GfT-4mgP2RAXiAhA", "user_id": "4AJhTfRTTYFUltp12Cg4SQ", "funny": 0, "text": "..the ups store in sun city west az is always welcoming and quick to serve:.)", "business_id": "dMHeWqacbwEg26J24skrhg", "cool": 0, "useful": 0}, {"date": "2011-10-03", "stars": 4, "review_id": "53PnTkKbV2_dM6JeLEOM1Q", "user_id": "lJFBgSAccsMGwIjfD7LMeQ", "funny": 1, "text": "I really like the location of this Chipotle, it's really easy to get to and I can always find a place to sit. It sure does get busy around lunch time though so watch out for that. Plus now that Menchies is next door, parking can be a little bit of a hassle. I really like the employees here and the general atmosphere. Not a bad place!", "business_id": "yKShDxZcD-9UtqvtZfdWqw", "cool": 2, "useful": 2}, {"date": "2017-10-29", "stars": 1, "review_id": "xJ4GYKd-45ogoyWIQ6knBg", "user_id": "RiFSFCblYAEcG8IxFLdlqA", "funny": 0, "text": "This place is horrible.  I came in for prime rib on a Sunday at about 4 and they were out. They were unwilling to offer me a substitute and the manager was a total jerk.  The server brought me sweet tea after I asked for unsweetened tea.  I am diabetic and sugar could kill me. I say avoid this place.  What a joke. I walked out and went to Cracker Barrel next door.", "business_id": "NQRm_I1FK-r7xd1tVRcb6g", "cool": 0, "useful": 0}, {"date": "2018-06-27", "stars": 5, "review_id": "3vW7b_gqpfOmagNS-X4WXQ", "user_id": "YBGooyC8-TF5LDKvlMwAYQ", "funny": 0, "text": "I've recently elected to try the facials at this location. I had two that were just so-so. As luck would have it...third times a charm. Andrea is really amazing. I always come out glowing and quite relaxed. Request Andrea-she's the best.", "business_id": "7ef7jYhmfbxSI7s57HoJAg", "cool": 0, "useful": 0}, {"date": "2013-03-15", "stars": 2, "review_id": "swFnGSLq_3F7Q3lG0-FfXA", "user_id": "zRYbWoTcs8TijwQ9Fa7A-w", "funny": 1, "text": "These people are SO RUDE. You call to order exactly what you need and they act like you're a burden on them. If you don't want to be in business to please your guests, then don't run a business! There are plenty of other bakeries in this town.", "business_id": "0Bg55OM_rzC_jdvIZRw_7A", "cool": 1, "useful": 4}, {"date": "2016-02-23", "stars": 1, "review_id": "qRgaBTO-nRsKmkRTBsI02w", "user_id": "84lmIsZzMOX5oKL79Zv2vQ", "funny": 0, "text": "If i had a choice I put no stars.  Worse service ever!! Want to change my insurance so I don't need to use them RUDE bitches ever.  They don't know what the fuck they're doing", "business_id": "vASl956jPt2eZXQMYVgKIw", "cool": 0, "useful": 3}, {"date": "2012-09-05", "stars": 5, "review_id": "gO4gdCIRECE57WXAqh3wpw", "user_id": "Zciq5UHl-x1k7OSbxITSbw", "funny": 0, "text": "Just moved to Madison and needed a license. I was called to a counter before my picture was taken. The employees are nice, knowledgeable, funny, and even gave my kids stickers!! A wonderful experience that lasted minutes, not hours!!! What's next...the Cubs win it all?! (go white sox!)", "business_id": "1gDderwE7QeuUORvi7S1jQ", "cool": 0, "useful": 1}, {"date": "2015-01-11", "stars": 4, "review_id": "QZUchJbcE2oW6M5oHnu3xA", "user_id": "bejZBstTRfzXcsUTk1i8hg", "funny": 0, "text": "Quirky hipster bar/restaurant with a great staff and wonderful menu. Had breakfast here. Ended up ordering \"Shit On  Shingle\" which was awesome. Great country cookin at a friendly place in a cool hood.", "business_id": "uGzxwS3Q6QuyFw2ZnDvw0w", "cool": 0, "useful": 0}, {"date": "2016-11-22", "stars": 5, "review_id": "-Mkp2ngTyvb8e8pbK6ANsw", "user_id": "k24QIVcmhhOnv9MCY3dELA", "funny": 0, "text": "Continued to be very pleased with the service and the food.  The additional star is because the steaks somehow seem to have been cooked better and were more tender than before.", "business_id": "pKk7jCFIm96qDdk0laVT2w", "cool": 0, "useful": 0}, {"date": "2010-09-12", "stars": 5, "review_id": "hsDbxarSsSGm7CIo_CYVtA", "user_id": "gGCv9qdMRgAa39ao0Phr7g", "funny": 5, "text": "IMO these are the best wings in Charlotte and I have tried a bunch of places that claim to be great.  It's a hole in the wall in a strip mall but they know how to make some fine wings and that's why the place is always busy.\n\nBy far their best sauce is the Hot Gold.  Try your wings extra crispy with this warmy tangy sauce and some blu cheese to dip them in and you can't go wrong.  Very affordable as well.  A basket of seasoned fries will run you about $3 and their side salads are always fresh and tasty!  \n\nThe wings are so good I almost hate to review this place as I don't want it to become too popular!  Do yourself and your taste buds a favor and stop in and try the Hot Gold.  The Hot Ranch isn't too shabby either!", "business_id": "sPwgafejYVdf8hd4-oDYVg", "cool": 3, "useful": 7}, {"date": "2018-04-01", "stars": 1, "review_id": "Pc8gWEh90zrXpA-ZTxEM4Q", "user_id": "E0mLuBD1Y-b_85GS1GRSBA", "funny": 1, "text": "Horrible, horrible, horrible.\n\nWe had a reservation and they sat us at the first table in the restaurant by the door. Shouldn't reservations get a little special treatment versus walk ins?\n\nThe food is garbage- rock hard waffles, Veal Hash with no salt, sliders with mushroom mush ... come on for $50+ a person. \n\nNo doubt this property will go down with Steve Wynn gone. \n\nSteer away from this shit hole.", "business_id": "N8D-5-fW7EkBdKjNYGhu0A", "cool": 0, "useful": 0}, {"date": "2017-11-14", "stars": 4, "review_id": "s5VAhT7iFQVGRbemLs0Z8A", "user_id": "wWHeaOS28fnCnFN1Pmo3xg", "funny": 0, "text": "4.5\n\nI love the halibut fish and chips from here! Once you've tried this, the frozen ones from the grocery store cannot compare and you won't settle for the grocery store bought version of fried fish.\n\nAmy's has a simple, clean storefront in the Starbucks plaza off Elgin Mills. It's not particularly fancy, but upon entering you feel a home-y, comfortable atmosphere filled with the aroma of freshly fried foods. They serve classic fish and chips, and execute it PERFECTLY. The fish is lightly battered but is amazingly crisp when served (even if you get take-out and bring it home, it still retains its crispiness). The fries are also great - thick cut fries that go well with the fish. \n\nThey also serve cod fillets, which are great too, but I prefer the halibut. The size of the fish is also generous, and you get really great value for your meal. \n\nThey also have some nice sides of coleslaw and salad which are equally as yummy to the fries as a side. \n\nIt's honestly one of the best fish and chips place around. I always look forward to my visit!", "business_id": "zZvkpJI39uhG1Pn4DbQkfg", "cool": 0, "useful": 1}, {"date": "2017-09-16", "stars": 4, "review_id": "G5XwcbsB8WY4t_vRLciVnA", "user_id": "-lsU9gI45Fbm82Z9I_Y2LA", "funny": 0, "text": "Yummy for vegan babies!!  We only tries gelatin and will be curious to try other parts of the menu.", "business_id": "LRnzpnNQWwpN3Bu24W53CA", "cool": 0, "useful": 0}, {"date": "2016-06-09", "stars": 5, "review_id": "KqiLUSdEw-xTyHIvYx_zZg", "user_id": "PLbecLM9yCvD8Ygrfxcopw", "funny": 11, "text": "We recently went to Vegas during Memorial day weekend (5/30/16) and it was the BEST vegas trip, ever!! :) We specifically came to Vegas just to see the Chainsmokers @ Jewel..and boy, they did not disappoint!!! We LOVE the chainsmokers!!! :) I contacted a promoter for the club and he got us (2 girls and 2 boys) on the GL. We all got in for FREE! :) We arrived around 10:30 pm because we knew the club would get packed! Getting in was super fast and easy. The people working there were really nice...like really nice..they even danced with us. I forgot one of the security guy's name...i think it was either Herbert..or Robert...but he helped us out the whole night by saving our spot and coming to get us when we got stranded outside the dance floor... lol. Since we got there early, we snagged a spot right in the front and we stayed there the whole night! We had plenty of space to rage out..omg...lol..we were in the corner so people couldn't come to our spot. hehe. We also got free beers from a table...that was very nice of them..hehe. \nThe opener for chainsmokers was good too! I think they were local DJs..i forgot their names...=x We danced all night and didn't leave the club until closing time (4am). hahah. The bartenders were really nice and gave us several cups of free ice without asking us to buy water or anything. Overall, we all had a great time. It was definitely packed, but if you plan accordingly and bring positive energy, then you'll have a great time!!! \n\nCheers to wegas!!! :)", "business_id": "R8811Sf7uYEa5m3KBc32Qg", "cool": 14, "useful": 15}, {"date": "2008-06-26", "stars": 4, "review_id": "-EEMYh97HQPgP5H9ij8Kxg", "user_id": "Dn7-gET_2Je-lM1cBHCS6w", "funny": 0, "text": "I'm tempted to give this 5 stars - stylish, great service and top notch master sushi chefs that I certainly never expected to find in a suburb of Charlotte. Great selection of rolls. The one meal I had, their deluxe sashimi assortment plus a spicy tuna roll - was simply superb. The fish was pristinely fresh, and the spicy roll wasn't ' the usual chopped tuna with chili sauce (NTTAWWT - its a favorite) but whole pieces of tuna with a variety of other ingredients - not sure where the heat came from, but it was balanced and great. \n\nBased on one visit they're up there with the places I consider shrines of sushi - Nobu, Ebisu, Kaz in DC. If it's the same after a couple more times I'd give them 5 stars. Either way, a must visit if you're in the area. and want sushi, with food and an experience that would probably draw crowds in NY or SF.", "business_id": "fJqY-E3adwx7LLozV1TfFA", "cool": 0, "useful": 0}, {"date": "2016-06-29", "stars": 5, "review_id": "vtCWveUtgbNinhnsIfY8jw", "user_id": "NO7PEQK1FaCkU3x6kdqTAg", "funny": 0, "text": "Been here twice and the food was great. The ramen tested amazing and the appetizer and side dishes were great too! 100% would recommend to others.", "business_id": "bzMO8LJmJtgo3KuyWGKUxA", "cool": 0, "useful": 0}, {"date": "2016-07-23", "stars": 4, "review_id": "U8wJ2Jkd_CICHYq3nddZBA", "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A", "funny": 1, "text": "Came here for a work lunch.  My co-workers got the Mexican chopped salad which they really enjoyed.  it looked pretty healthy.  We shared the guacamole for an appetizer.  It wasn't my favorite guacamole, needed a punch of something more sour or salty or something!  I preferred the free salsa and chips they give you.  For my entree I got 3 tacos: short ribs, pork, and fish.  They were all really tasty!  Came with a side of rice and beans that was just pretty regular.\n\nThe atmosphere inside is nice, I enjoy dining in there.  I think in the fall and winter it'll be nice to hang out on their patio.  I will be back!", "business_id": "qnn9E-e9orYf_wK37yLTYw", "cool": 1, "useful": 1}, {"date": "2012-11-19", "stars": 5, "review_id": "8KOmZwMZw_eBzmhFxIzP5g", "user_id": "aysdAeLJCq1P0T408mtL3Q", "funny": 1, "text": "This place is awesome!\n\nI find Calgary to be a pretty boring city to be honest. Maybe it's cause I'm used to my cities being really big and over populated, but this particular area of U of C is a breath of fresh air.\n\nIt's open 24 hours which is awesome and there's lot of seating area with plug available as well. Highly recommended if you're looking for a place to study or just need some quiet time.\n\nUnfortunately there's no way of getting a wi-fi signal unless you're a student. So you'll have to tether to your phone or apply for a course. Otherwise it's tough luck.", "business_id": "u7iS2ATnqftp2Cx_ejUqRg", "cool": 0, "useful": 1}, {"date": "2015-10-12", "stars": 5, "review_id": "n0HZltLLl9Hx2iFez5ZO5g", "user_id": "C9qjn7DDLjoEDvg8ds23Lw", "funny": 0, "text": "Southwest screwed us from Vegas and Chicago. This hotel gave us a great deal and was extremely nice. This hotel is like brand new, clean and amazing.", "business_id": "UYkOUsxYG9BgdzFYAD4h8g", "cool": 0, "useful": 0}, {"date": "2018-06-25", "stars": 4, "review_id": "PzqSOGJmgn9zRIQjZTbkeQ", "user_id": "_X50kayzmUwwdrqO9ki9qg", "funny": 0, "text": "My favorite is the Unagi bowl. It is a rice bowl with freshwater eel smothered in sauce and decorated with sliced avocados and egg scramble slices. This was a very filling dish. I was already full and I was not done with it yet! The eel is very soft with I like. It has a very fatty texture and that is the best part. I definitely will be coming back here for the Unagi bowl in the future. My dish came out to be $14.02 with tax. I love how they have a lot of things on their menu, it gives you a lot of choices to pick from.", "business_id": "hRL_qCrcu9UL773su0QabQ", "cool": 2, "useful": 2}, {"date": "2014-05-13", "stars": 2, "review_id": "pV1FTzJK48dmdB_vL4GtAg", "user_id": "PyqM7UvZLElMdlDr5EgPKQ", "funny": 0, "text": "I went to Chop Shop with some buddies on a Monday night. The manager Alex did an awful job of managing how the food went out. My order took 35 minutes and the multiple people got their food before me even though I ordered first. Once the order came out it was missing sides and toppings. After complaining multiple times the manger took a very laid back approach. He said oh there are a whole bunch of orders back there. This manager was just awful and shouldn't be in such a position. He is clearly way over his head if he can't handle a Monday night. My visit was on 5-12-14 aprox 8:20 pm.", "business_id": "JIETwXSEGIHMNyxZVEnNKQ", "cool": 0, "useful": 0}]