[{"useful": 0, "funny": 0, "review_id": "5D_MsAJHrMa8QKkpE3g1Sg", "text": "The butter burger was cooked perfectly and juicy! The ice cream here is the best I've had! This location is very clean and staff was friendly!", "date": "2015-11-05", "cool": 0, "user_id": "Ka7TIp74VHSa90rfdg4_2g", "business_id": "XgRDG9E_WLEbl8S-QUqQkQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "3nRIwp83jG_Hg4RVwW4yow", "text": "I am in love with this place. Today was my first time and we need one in Tucson immediately! \n\nThe parking lot was packed and just as I was about to get irritated I noticed there is complimentary valet service. Que  fancy! \n\nThe inside is super casual and clean and the staff was awesome! We didn't get to sit outside in the crazy cool and dog friendly patio. I saw a dog sitting on the a table outside! \n\nI ordered from the $10 brunch menu. Food plus 10oz beer or mimosa. I had the breakfast wrap, the wife had the breakfast flat bread. I recommend both. My girls had chicken tenders which were actual chicken with a tasty fried covering. They loved their food too. \n\nIf you have kids, a dog, and hankering for good food you owe it to yourself to come here.", "date": "2015-03-08", "cool": 1, "user_id": "nDdcMqgQkRZuvjRzXhUJ5g", "business_id": "mnwRtuVQEsIUomBchu0gwg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "P1OMjonI7MOGn0KqHGQC-A", "text": "i was there from June 24 to 27th. the room big enough for four adults. we checked in early and we got a room on the 25th floor facing the strip. that was the best part. the view was unbelievable. the AC. was strong. the room was very modern and clean. the beds were very comfortable. the casino i didn't care to much about nothing special to see or write about. there is a free show outside the hotel. if you haven't seen it. its worth check out. the area is pretty good, there is tram to the mirage and next to that is ceasers palace and on the other side is a big mall. accross the street is the Venetian, Harras casino (and a shuttle to Rio that were the best buffet in vagas)and the carnival bar. pool parties are not the worst but not the best either. the DJ was pretty good ,the down side very little shade. \n\nthere is a mandatory $22 a day resort fee that includes wi-fi in every room and newspaper in the lobby. they don't tell you about the fee until you check in.", "date": "2011-07-06", "cool": 0, "user_id": "D1_nrBr4dOrs7M82OaBRwQ", "business_id": "uanCi4OGc1mHLGl_AT4JhQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "PPepHS43hbNTnav1DQDpog", "text": "I was here for a conference in April, and this was probably the most beautiful hotel I've stayed in. The staff and service was wonderful, and the provided food was more than satisfactory. Wi-Fi was a decent speed (except in the lobby), and was free to members who join their loyalty program.\n\nThe main issue I had was with the room I stayed in the first night. It faced another room, and therefore didn't have much natural light. I also couldn't leave the curtains open if I wanted privacy. The worst part was the noise. There was a low pitched humming from air conditioning equipment outside the room. The noise wasn't incredibly loud, but it was very grating and made it difficult to get work done or sleep. \n\nThe next day, I asked for a new room. The staff was incredibly friendly and accommodating, and did not make me feel like a nuisance. I got a room that was much quieter, faced the street instead of another room, and had better natural light. I just wish this was true for all the rooms.\n\nOverall, 5 stars for service, 2 stars for the first room, and 4 stars for the second room.", "date": "2016-07-19", "cool": 0, "user_id": "WMCgAZsXqrFDLDNYrkdEFA", "business_id": "TAB_NFD7pjjouJUlCjCvKQ", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "__vzxaNMRj1p2PH2dJgjAQ", "text": "Went last week during the Happening Gourmand.  \n\nFrom the fixed menu I chose the Garlic Escargot, Angus beef bavette, and Crème brûlée.  \n\nGiven Narcisse was the least expensive of the Happening Gourmand restaurants I was pleasantly satisfied with the meal.   \n\nIn fact out of the 3 HG restaurants we tried Narcisse was my favorite.  \n\nThe standouts for me were -\n\nThe escargots  - nice twist on traditional escargots with cheese melted.\nThe beef bavette - inexpensive but well prepared piece of meat.\nThe french fries - savory and lots of them.\n\nThe service was a tad on the slow side but i think it was more to do with our waitress than systemic of the restaurant.", "date": "2010-01-31", "cool": 1, "user_id": "h2zLiqDXdA_sOdPFRGmM5w", "business_id": "bVuPp6xuI4UPXlAEkEd2bA", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "exAFZ38qPcqEcxKexk3zAA", "text": "Surprisingly good pie! Fast friendly service, location location location...and great value- especially for the strip.", "date": "2015-06-08", "cool": 0, "user_id": "FiRCRJYOOHN6IZZpO-B1gQ", "business_id": "glkEaoxbewiSMBiXs945JA", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "B8OigiOWqtJYT3PvJmnBkg", "text": "We went with a big group so we go to try lots of plates, the service was great and food was super tasty, pad tai highly recommended !!!! Pineapple fried rice delish, the shrimp appetizer was crazy good, so where the spring rolls and summer rolls!! Will definitely be back!!!", "date": "2013-04-28", "cool": 0, "user_id": "KKgHnDVFe8y5F7BI7njrFg", "business_id": "h6f3QbR0n0fpS2Tu9MJJTw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "v99zfmXQFo1Z9F7-qZD6tg", "text": "I used to tan with Donna when I lived in Vegas. I have a spray tan business myself, but it's extremely difficult to spray yourself as you can imagine. With that being said, I am very picky and Donna does an amazing job! Her prices are inexpensive and even if it was last minute she was able to accommodate me! If I'm ever in Vegas and need a tan she is my girl!", "date": "2015-10-23", "cool": 0, "user_id": "88ZDBykC9oV2o6as3WnTdA", "business_id": "hCfj1xtRSzO873TMX6rNTg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Zk2VW1G5gaNYc1wZpsvVdQ", "text": "Ari is the best!!!  I have dropped my phone and off course I cracked the screen (( So I looked online at the Apple Store it would cost me $140 ( I was trying to find different options, and I found this place )) If you have any problems with your phone  Go to this place !!!  It was so fast , I couldn't blink )  And it cost me way cheaper than anywhere else!!! Quality is awesome!!! I would recommend this place to anybody!", "date": "2016-10-26", "cool": 0, "user_id": "SldoJgM9ipGjp2URsBz5jA", "business_id": "YPBVDjYEsPMnzwo_AcNVYg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "7JPy7i0CcXU61n_dzLtChw", "text": "The food is very good and the decor is nice.  Unfortunately, the service doesn't follow.  Our waiter messed up our order multiple times.  The bartender knows absolutely nothing about wine - don't ask for his recommendations.  The hostess is totally clueless.  The kitchen is the key, not the front of the house.   Looks like they need to totally rethink the staff outside of the kitchen.  Go and enjoy but don't be surprised to be frustrated.", "date": "2011-08-19", "cool": 0, "user_id": "GWGAv8h20-vkQi1U5rKhEw", "business_id": "zr93wrNyXzc-HW4IcK4iRQ", "stars": 4}, {"useful": 2, "funny": 0, "review_id": "D1C_UHqaAcxqQ3qn6UdmLQ", "text": "THE BEST!\n\nI dropped my iPhone and broke the glass on the back.  The guys quickly fixed the back and charged a very reasonable price.  These guys are super friendly.  I can't recommend them enough.", "date": "2011-09-01", "cool": 1, "user_id": "GWGAv8h20-vkQi1U5rKhEw", "business_id": "wAQo05JRP0NBcHlNfjzUPw", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "eJJGmHdgLfcnr1M12T45Fg", "text": "Had the Chicken Teriyaki. It was awful. No flavor, the chicken was fatty. Took two bites and threw it in the trash. It was so bad I was fearful of food poisoning. Just didn't seem fresh. The one star is because I had to give it a star to even write this. For $10 I would rather have Chipotle.", "date": "2015-12-11", "cool": 0, "user_id": "LUsNCIM2zqLv-D1eRk2QoA", "business_id": "AqKWtFTREQ_PFSYiIWnBgw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "rZRnk-3s6rlqeu5JrBGKKQ", "text": "I'd give it 3.5 stars. \n\nThe prix fixe menu is a pretty good value unless you want their 24oz prime porterhouse. I'm OK with an upcharge since that's much different from the 8oz filet it normally comes with. What I have a problem with is getting charged $30 more for a steak that's only $20 more on the menu. When the manager's answer is \"that's a corporate decision\" and offers no other explanation, I think that's a really really poor answer (if I can even call it an answer). \n\nThe food was really good. I had very little waste on my porterhouse and it was very flavorful. My wife's filet was just right. The shrimp that it came with were huge and had a great bbq type sauce to go with them. \n\nThe service was very good with one glaring exception. They forgot our au gratins. When asked about it she had a blank look in her eyes. About 5 minutes later they were brought out to us and we were told our order had been burned so they made us new ones. No, they weren't. They were simply forgotten. Just say so and we'll move on, do not lie to us. \n\nA few glitches but the food was stellar. Will we be back......I'm not sure.", "date": "2014-07-24", "cool": 0, "user_id": "AdxhlxXSGjRsCQxG6ZjfTw", "business_id": "IT_4EEIbv6Ox1jBRMyE7pg", "stars": 4}, {"useful": 2, "funny": 0, "review_id": "oqfg-BBea86I61kqP-CJIA", "text": "He asked me what was wrong and I told him I thought the garbage disposal in the kitchen was bad and word replace it with a $500 garbage disposal without even checking to see if the old one was no good .Charged me $ 45.00 . Got a second estimate on the garbage disposal and ended up not even needing a new disposal", "date": "2016-04-04", "cool": 0, "user_id": "zJTEY5EjAt7Zfnl3Pmvzpw", "business_id": "OCwVdrklCtV7xTDplgm-GA", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "uf-BU4MquHapVtFt6E3amQ", "text": "Should have gone to Dunkins Donuts.  At least we could have gotten fresh bagels.  Eggs benedict had no english muffin and even the carrot muffin was stale.  The butter was cold and hard.  The food was awful and there's a lot of old people around.  When did Mimi's become Coco's??", "date": "2012-03-10", "cool": 0, "user_id": "WjmWNxvDNcnjTT0t_uDofA", "business_id": "3FlWR_osNPb8dcqLgHebHw", "stars": 1}, {"useful": 1, "funny": 0, "review_id": "if7m81tnr6PZM5bMjjDt1g", "text": "I've been to other locations close to my house and thought OK. But then I went to Trina's. This was very clean. \nTrina's offered a full spa pedicure with salt scrub, wax dip, callous remover, stone message and cooling gel for $40 dollars. During this time, I received a hand massage at no extra cost and as I wait for the nail polish to dry, a neck message; again no extra cost. \nThe basic charge would have been $23 if I would have kept it basic, but my much needed tired feet needed the full treatment. It was well done, was not rushed and very good treatment. \nI left with happy feet, relaxed hands and neck. It was worth the extra drive to get this treatment and well worth the price.", "date": "2013-08-17", "cool": 0, "user_id": "SdWIwJPU_wI9fRoWan2_Wg", "business_id": "ANXk1tWr1_uDny3ih_5Q-w", "stars": 5}, {"useful": 2, "funny": 0, "review_id": "7JaVY6VFg2rgD0lGkXeP3A", "text": "TJ did an excellent job installing my antenna on my condo roof.  He was on time, very professional and made sure I knew how to use the remote to change the channels for my regular tv stations.  He even took my old direct tv dish off of the roof for me.  He gave such excellent service and I would HIGHLY recommend him!", "date": "2016-06-07", "cool": 0, "user_id": "n_BR4Hg9LFVXKStmYKQapQ", "business_id": "HkmXmW-39-kmo2pLB65w5Q", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "Lz474ku0-sXVN3CeLAZpTA", "text": "Yummy Ugh to good!! for a small pastry.  Yumm all I can say and very clean inside the La Boulangerie. Il be back for sure!", "date": "2014-03-28", "cool": 0, "user_id": "mTyBkIXOBX0lfma34oypmg", "business_id": "WVBunygqFNO6UeI6CUMwYw", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "sWYQXLHcEuVec07guYzlPQ", "text": "Shopping at Chanel Wynn is for me, like coming home.\n\nI have amassed quite a collection from Chanel over the past few years and each one is dear to me.\n\nI love this store!", "date": "2010-03-26", "cool": 0, "user_id": "yEO7uAcwtG8e4oXLzc8kwA", "business_id": "6pM2YxQH8dQYs07_CH3Z6g", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "CV0VGZpx24p3-1ZjF-lUoA", "text": "First time here and honestly get the Porterhouse for 2 with their homemade sauce. Best steak I've ever had, better than Mannys...that night anyway.  Loaded mashed potatoes were amazing as well.", "date": "2012-09-28", "cool": 0, "user_id": "dXBM3AifWFUjQOwAYK0irg", "business_id": "jzr6jW5cQ0jpPhEo4kGMBw", "stars": 5}, {"useful": 0, "funny": 1, "review_id": "X4MuG98cyzeK8BxJ0L5ejQ", "text": "Went for Karaoke on Tues/Weds night 8 pm. We went \"early\", not knowing how the set-up was. Sat at the bar, bartender seemed \"aloof\" and annoyed they he had to serve drinks. We did not tip him at all. We then moved to the seating around the bar area which was getting crowded. Service was a tad slow, but OK. The bigger room was closed off for a private party at 6pm. We thought this party was going on all night, but actually ended at 8. However, no signs telling anyone of this.\n\nSo the Karaoke guy shows up at a few minutes before 8 and seems pissed off that I'm asking him his procedure. You know, like sign in sheet, or internet choices etc ? Every Karaoke is different. \n\nSo, anyway, Karaoke gets going and I'm 2nd up and was great, Excellent sound system screens etc. Only got to sing 2 songs because everybody and their brother starts coming in and gets to sing immediately, so rotation keeps getting pushed back.\n\nWe will be back in June again. Waitresses dressed in Bikinis with chaps seems a little corney, and mechanical bull is really corney, especially with 50 something lardos  mounting up.", "date": "2012-03-24", "cool": 0, "user_id": "6UXGaTo6_xySXmEah0gzGA", "business_id": "G5or_Fra4-6IYOVlm_dI2Q", "stars": 4}, {"useful": 1, "funny": 0, "review_id": "s-0iO63hdyqPucg_T_6ydQ", "text": "Fantastic food and service! My husband's first Chicago Pizza, he was in Nirvana! Be prepared to wait a little but worth the wait!", "date": "2016-06-12", "cool": 1, "user_id": "lc39I60ZjApJVYW7khxC8w", "business_id": "N8uKQ5Vdb1LAh-qXT_25Rg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "3zsgLEb5L4WwpQC5N4CbGQ", "text": "Guess I should have read the reviews before coming....but first off completely over priced...got the pet lovers wash and there's still dog hair on ALL my seats, excessive amounts, only needed to be vacuumed and came right off but for $57 and 1 hour and a half later and I still had to do some of it myself. Also at immediately coming into the drive thru I was approached to fix my windshield! If I wanted to do that I would have already please don't be so pushy!  Then when I picked up my car the lady gave me attitude about not giving her a tip after I said  I was coming back to give one! I didn't want to pay a fee at the atm so I was coming back with cash I told her and she said \"thanks for nothing!\" And stormed off! I would ask that maybe your employees show your customers more respect... as a food sever if I ever treated a guest that way I'd be fired! If I'm paying almost $60 to get my car detailed I will tip but I forgot my cash and was going to get some but she reacted very rudely. Also maybe have an option to tip on the credit card receipt so we don't have to be ripped off again at the atm after being ripped off by your prices. Won't be coming back unfortunately, it's so close to my home but will have to take my car elsewhere after an experience like that!", "date": "2015-10-31", "cool": 0, "user_id": "84CQgsdMMj2pynk7t8DalQ", "business_id": "uOpLtxBHoQS6nZhVML7i0g", "stars": 2}, {"useful": 5, "funny": 5, "review_id": "B504DD2_Z9qWxDghXK-BBg", "text": "I don't know how this place stays in business. The menu is so limited. Would you like chicken or chicken? Chicken in a pita? Chicken on some lettuce? Chicken rolled in a tortilla? And the pita chips are bland! Yuck! And  the potato salad has something in it that is way too tangy. I've only been twice and tried different dishes both times but I just don't get anything greek about this place.", "date": "2008-12-24", "cool": 2, "user_id": "YmTUXcWWuk3Hc0O7FMiOMg", "business_id": "e880MGw6C6PJL-n3EJoY_g", "stars": 2}, {"useful": 1, "funny": 0, "review_id": "6-b4myqyhuBOE91o-in0vA", "text": "This place is a real winner. My teenage son had never played pinball before we took him here. The following morning we asked what we should do in Vegas that day and he asked if we could head back to the pinball point. That's about as great an endorsement as I can think of :)\n\nSpend some time here, you'll be glad you did.", "date": "2012-08-07", "cool": 0, "user_id": "9PuTaCDQYJbDd-ldhViltg", "business_id": "8mIrX_LrOnAqWsB5JrOojQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "lMphcLrwp65r2Te0Elr8Cg", "text": "There was a time when Penn Station subs were huge and had plenty of meat on them. Those days are over.  A few years ago they started making their sub buns much more narrow with much less meat on them, yet they continue to raise their prices. I used to feel full after eating a six or eight inch sub from here, but now I am still hungry after eating them, and their monthly special is not a good deal at all. You get a small drink, a tiny 6 inch sub and a tiny portion of french fries that is laughable, and you pay nearly $10 for it. Nowadays they put so little meat on their philly cheesesteak that many bites of it are just a mouth full of bread.", "date": "2017-08-17", "cool": 0, "user_id": "DorwzN-G8l0GQdkdEB6z0Q", "business_id": "5R03yx9yR4VkK1L-Waj4Pw", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "0kWlBRyK6zwhLcqpY-aOkQ", "text": "Place is always clean, good is always fresh and staff is always friendly.  A little pricey for sandwiches but they do come with a cookie and wifi!", "date": "2013-03-19", "cool": 0, "user_id": "q3AiAe-AcpDrNsdZf8nCvQ", "business_id": "SkdDestSlipSj43lYgskxg", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "EHvgW1sSqx_0ISncVCByYg", "text": "This store is so messy, and store employees throw items anywhere they can fit them.  When you get to check out after having to dig through everything to find an item,  then you find the time you spent was a waste.  The price the rack says isn't the price,  no it doubles in price.  When shown the rack is full of this item they still deny to honor the price.  I won't shop hêre and will let everyone know why. Rude staff and dirty un organized store.", "date": "2016-05-14", "cool": 0, "user_id": "TRw33AcvE-F3ym_MO977yA", "business_id": "v1l_5Rlgq6HN1UbWAAvrow", "stars": 1}, {"useful": 3, "funny": 1, "review_id": "mgcvCLrcXQBZX3LoNqu1QQ", "text": "My hair of 20 years is a beast. One stylist actually turned me away because my natural hair intimidated her. I haven't had a haircut since I was a child and I've had anxiety with anyone touching my hair (bad experience from a relaxer at 13 that left me with a bald spot). \n\nI needed a haircut because 1) it was getting too hard for me to manage 2) split ends that was hampering growth and 3) I was going to be on Katie Couric's show. I looked up natural curly salons in Vegas and found Hair Artisans. I called them first and asked how they cut natural hair because that would determine whether they knew what they were doing or not. When Danielle said they cut it dry I immediately felt good about my decision to go ahead and book an appointment. \n\nI came in the following day with the beast unleashed, I felt apprehensive because I didn't want to be turned down again. Rather than feeling intimidated, everyone at the salon were amazed with my hair. To them it was gorgeous, to me it was still a beast. Danielle co-consulted with me while I waited for Arlene who was to cut my hair and discussed what needed to be done with my unshapely, unruly natural hair. She made me feel comfortable and dispelled my worries. To put my hair in perspective, when stretched it reached my waist. Apparently, I have different textures too so the back would be really tightly curly and thick while the front would have bigger curls. I couldn't wear my hair out because it looked like a bird's nest - no shape and it was too long and big. \n\nArlene arrived and immediately got to work. I was just so happy they didn't turn me down. She cut off the \"see-through\" ends and layered my hair to give it shape. She then shampooed, conditioned, and detangled my hair, which I felt so bad for because it's almost like punishment to have to detangle my hair. However, they seemed to enjoy it. Danielle and Arlene tag-teamed during styling showed me the process of shingling which further defined the shape and curls. \n\nI was so happy to see the end result AND to finally be able to wear my hair out. I felt like a D-I-V-A afterward. They recommended products for me to put on my hair, and for a college student, the products were affordable. The whole process was only $40! I couldn't believe it. Of course, I tipped them generously. I'm so grateful to them. I enjoyed my experience and am extremely happy of the outcome. I've never received so many compliments and likes on Facebook after I posted the new hair style. Sooooo happy! Definitely will be going back to them. I have finally found a  tamer for the beast.", "date": "2014-06-08", "cool": 3, "user_id": "XxBhKwhOkbu5eOFVwmRtrg", "business_id": "VsWV0m79WAD22Un_fA9iwA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "3rS3cSqxx27CFtLS0c3psQ", "text": "Holy Cow has this place become popular!! It's packed and the service is still fast and BBQ brisket is tastier than ever! Even the Girl Scouts are here selling cookies out front.  LOVE the old fashion neighborhood feel.", "date": "2015-01-31", "cool": 0, "user_id": "hal0m66UbOwm0Q48HdTCyg", "business_id": "6nKR80xEGHYf2UxAe_Cu_g", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "SK1kYTwUy5IJrou8fY1uUA", "text": "I just love this program. In 1 week I lost 10lbs. Dr. Mike Miller was awesome:-) and the MA'S were great too. The wait was fast and the receptionist was wonderful.", "date": "2016-04-09", "cool": 0, "user_id": "1WwZAndHhlWK9DhuA5im0Q", "business_id": "jgT_qJp_khknKCpsDr3fGw", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "iDZEP8tcuJ8pMNZY-WEaTQ", "text": "I live here in Las Vegas . When I need a gift for my son back in NY  this is where I come. Always leave with more than I anticipated!! \nJulie as always is a big help as is the rest of the staff! Lenny is another great help!! The store is located in the Miracle Mile. Love this store!!", "date": "2017-07-08", "cool": 0, "user_id": "4jTuelFFPk1nVdsTIQvWIg", "business_id": "r6MwVe9ucsHh4ZOUMnl6AQ", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "EiGQi-xp255rkCpIqGSj_A", "text": "This is my second trip to this place.  Burgers are good.  I tried the veggie burger this time.  I enjoyed it.  However, the service was remarkably slow dor a Thursday night at 5pm.  I ordered my food about 5 minutes after everyone else at my table.  They all got their drinks, but I didn't get mine.  After about 20 minutes (maybe more) I flagged down our waiter and told him to cancel my drink.  He brought it to me on the house, which was nice.  My food also came much longer after the rest of the people I was with.  I had to ask the waiter what was taking so long.  Good spot if you are in N.D.G. but would not drive across town for it.", "date": "2016-05-06", "cool": 0, "user_id": "JQZDMReD2GdbLIa26s-z1A", "business_id": "V6NpHkLhqwQJ7KqDfCjbhw", "stars": 3}, {"useful": 2, "funny": 0, "review_id": "iW0iTu5v3c3ypzousX6mlg", "text": "I finally had a chance eat here again!  I had such good memories of my previous meal here... 15 years ago!  I wasn't disappointed. My husband and I shared a platter of assorted mezzes. Everything was very tasty. The rosé wine we drank with it was very good.  Definitely a nice prelude to a visit to Marché Jean Talon. Ah, Montréal, I miss you!  We will have to try Alep next time we are in town.", "date": "2010-08-20", "cool": 0, "user_id": "5Uv5ekKsOOL4rX0Zsmzfpw", "business_id": "_Ac-WT9RXqmAHEfTKIlFfQ", "stars": 4}, {"useful": 0, "funny": 0, "review_id": "UI715LHPlrYEhJM7UwmgkQ", "text": "Had 2 fillings a couple days ago. From walking in the door, on Saturday morning, I was out in 45 minutes. The whole staff is super friendly and helpful. I've been going here for around 2 years now. My portion of the timings was $120, insurance covered the rest. Dr Resnick is super helpful and knowledgeable. He takes his time to make sure everything is right for you. If you have any problems you can call him directly afterwards and he will take care of it. Really nice guy.", "date": "2017-03-27", "cool": 0, "user_id": "wfF95fj3BxI1DCxNf2ND3g", "business_id": "2qSoPkVt7_P9fgc6__IDLA", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "v26oHFRhPiYagCW3ekHjGw", "text": "Our room stinks, the sink clogs, the elevators are trashed, but the view is amazing. When we got here there is construction....they should of told us this before coming. We drove around for half and hour.and then walked ten minutes to get to the hotel. I think they put us in a pet friendly room.", "date": "2013-11-26", "cool": 0, "user_id": "MLLqFeJcNYHRn9q1Ogr6WA", "business_id": "u_vPjx925UPEG9DFOAAvFQ", "stars": 2}, {"useful": 0, "funny": 0, "review_id": "jnl9oBKQtWk9HrfSfI4G5g", "text": "All homemade and all the fruit is from the orchard! It is unbelievable. I'm a continuous patron and will continue to go! I prefer the Whitehouse Cherry in a waffle cone. I can't get enough of it.", "date": "2014-06-15", "cool": 0, "user_id": "d8veymLDs8iXyqkR_l9UGA", "business_id": "_faNGF9a6X9Us1k-9XFsfQ", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "iOoGVhLskQ3W39Q2MV6R0Q", "text": "Love this place! I was a first time Crossfitter and was a little intimidated but everyone, members and staff were so welcoming. Coaches are friendly and very detailed orientated especially when it comes to perfect form for all of the movements. I have been going here for two months now and am already seeing results.", "date": "2014-02-24", "cool": 0, "user_id": "J_yu0a06vMeZ40cj34jWAA", "business_id": "-XRqGElwBAEYcyOjmvUjvg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "xe80KCPRcBvEWWS5_ACUzg", "text": "The food here is disgusting. Literally every item is cheese or meat, so forget ordering anything else. It's over cooked and stale tasting. Service takes forever. If there is a jays game it's insanely busy and service is the worst, but because it's the only place down here it thrives. It wouldn't survive any area with competition.", "date": "2014-11-11", "cool": 0, "user_id": "ipwdv0BB_0Rfz_a_2L0P6w", "business_id": "2vBo1wWJckBnGOHhxt9ecg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "lQJYmgOpKZ_8c6B_ImSjFA", "text": "I'm very pleased with our experience at the McCarran International Airport Alamo.  I made the reservation through Costco and got a great deal; and was able to use my Costco confirmation number on the Alamo website to utilize their \"skip the counter\" feature.  Printed out the necessary document prior to my trip and went straight to the rental garage after we arrived at the rental center.  There was an Alamo representative right there who took us to the row of our category vehicle and told us to pick anyone.  After we were loaded in, we noticed the gas tank wasn't full.  The attendant told us to let the person at the exit gate know, who would note on our contract what the gas level was (3/4 tank).  The exit gate attendant did one better - he noted in the computer that we paid for gas ahead of time and told us we did not have to fill the car up before we returned it.  The car was fine - a Jeep Compass, it was clean and worked well.  The return was super quick and smooth and indeed there was no problem with us bringing the car back with less than a full tank.  I love the expediency of the skip the counter feature and will always use Alamo just for that.  Great job, Alamo!", "date": "2015-12-31", "cool": 0, "user_id": "eMd7UgpWCleqNQWkbPB_sg", "business_id": "5874jeQ4BlypNzCJbL0Phg", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "ejZHRK4-BolB9KDWg2tFrA", "text": "if there was a scale to rate , ill give this place -10. for starters their servers are rude and arrogant. we had to talk to 2 servers and each told us a different story.  My little cousin took chicken tikka from buffet while we wanted to order from ala carte, one of the servers told us we cant or the child has to sit on a separate table in order to get served from the buffet. Ridiculous!! coming to the food, the buffet was cold and looked stale. Food quality is a serious issue here. taste was average so i'd give it a 6. I have been t this place twice and i have to say each time i was extremely disappointed.", "date": "2014-03-13", "cool": 0, "user_id": "twfq5EjKTEC4JpqAwPLACg", "business_id": "tqJGBUKMNoUNX6FvHOHQGg", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "X7nHG7bFA-9xPYhiUHrnAw", "text": "Watch out for the trick upgrade. We were stung an extra $116. When we complained they said it was our fault.", "date": "2017-02-07", "cool": 0, "user_id": "l5TjfKjNeVv6HNd-3IMrKA", "business_id": "sMef_GZAv8pIn0pCxiOsaA", "stars": 1}, {"useful": 9, "funny": 0, "review_id": "YeO-GBAmxbZVkkE4GoRjiw", "text": "I recently brought my  Movado watch in for a new battery. I was told that the existing battery in my watch was a cheap one and that it leaked and damaged the watch. I was then told that it would be \"at least\" $150 to repair my watch. Not knowing what to do, I left with my watch and thought about what to do. I brought it to New England Clock Shop for a second opinion. They opened it up on the spot and found no internal damage, replaced the battery, and charged me $5. Watch works fine now.\nMy experience with V Jewelers was a shady one, will never go back, will never recommend the place. I am a believer in supporting small business...but really disappointed in this one.", "date": "2016-05-21", "cool": 2, "user_id": "zKJ5KfKAMiaQdqx1VR_eng", "business_id": "sHuleksVZX_0Pm0Mbrb8Nw", "stars": 1}, {"useful": 0, "funny": 0, "review_id": "IP7tks13Sp-mOFtVYkwHBA", "text": "One of the best in the valley, price very reasonable, service great, but it's the food that always have me coming back for more, love the Kung pow and fried rice just to name a few, the lettuce wraps are low key meta, highly recommended", "date": "2017-09-24", "cool": 0, "user_id": "-MBSaRDX-SfPVG2--PtPQg", "business_id": "w3RH9W99ZIKvw0Qgibdn4w", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "ZtH9JO9_dBSAWSOnSSOePg", "text": "This store is amazing.  The staff was very knowledgeable. They have THE BEST SELECTION of special occasion and mother of the bride/groom in the entire PHOENIX area.  I selected a gown and can't wait to wear it.", "date": "2016-09-28", "cool": 0, "user_id": "yR-H_brKWgWnT8yE1yT1-Q", "business_id": "QJl-EAKJQjUZoBBQPKhCgg", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "HSyuhTqzop5b_aDGReUvjA", "text": "I'd really give this place 3.5 stars. So first with the positive. The palace tower room was gorgeous. I got upgraded to a suite and I never wanted to leave the room. The decor was modern yet functional. Lots of space - like 700-800 sq feet. There were two bathrooms - one with just a sink and toilet, the other with a sunken in jacuzzi tub and toilet with a bidet. The bathrooms were adjoined by a shower with dual shower heads. Disappointing there was no free in-room coffee or tea. Had to pay like $15 for it.\n\nThere are lots of restaurants and shops at The Forum in Caesar's Palace. You don't even really need to leave the property.\n\nNow on to the bad. Check in was terrible. First my room wasn't ready when I arrived at 1 pm. Fine they held my bag and were supposed to call by 3 pm when it was ready. They never called so I went to the front desk at 4 pm and they gave me my room key. Right when  I walked in the room reeked of smoke though I asked for a non-smoking room. I called the front desk and they tried to move me way across the hotel. I refused so thy finally gave me the min suite in the palace tower. So once I had my room I was fine but he check in was just awful.\n\nMy friend checked into her room via text from her email confirmation and just walked up to the bell desk to get her keys & she checked in early. So that's probably your best bet because the front desk check in was bad.", "date": "2010-11-21", "cool": 0, "user_id": "zj2xftUYPhMCJcNrPO3frg", "business_id": "VyjyHoBg3KC5BSFRlD0ZPQ", "stars": 3}, {"useful": 0, "funny": 0, "review_id": "r8Ixi0VKDN0grmapi-zwQA", "text": "Had the queso Frito, and highly recommend it. Also had the tostones and they were very enjoyable as well. Love the salsa that comes with them! For dinner we had pabellon a cabello, arepas and empanadas, all we would highly recommend. One of the best gems in Madison!", "date": "2015-06-21", "cool": 0, "user_id": "5196E-f81fGnxip2l_a6tA", "business_id": "RDQ_812x82H72J7C6jG36Q", "stars": 5}, {"useful": 1, "funny": 0, "review_id": "HJORAcl0fYMJI0cYxSqoiQ", "text": "No muss no fuss, great service! Prices are cheaper on Monday, Tuesday and Wednesday - not that you really need the discount, given the prices are already unbeatable!!! \nDolly is very sweet and she'll always try to squeeze you in if she can - but I would say make an appointment if you're trying to get in after work because it can get busy from 5-7. \nGreat place to go if you're looking for an inexpensive and quick wax!", "date": "2015-04-29", "cool": 0, "user_id": "W3z6j7fkDKwBbrREIYW7rg", "business_id": "zsM_wf_K_d8OMlccArh16g", "stars": 5}, {"useful": 0, "funny": 0, "review_id": "yiJcEPALKhIs_KiIDzbLhQ", "text": "Really, really good house salsa. Beef flautas and sweet corn tamal were outstanding. And excellent service.", "date": "2016-11-15", "cool": 0, "user_id": "ZdUFyF5eNyZxete-T4bmZA", "business_id": "DO5mQxiBOgHEznosjxvJXw", "stars": 5}, {"useful": 1, "funny": 3, "review_id": "MRXSShpNRmZdXrP7zPo7VQ", "text": "This is by far the worst place I have ever lived. I was drawn to it because of the low price and great location, however even that does not make it worth it. The complex is run down and the water gets shut off at least once a week for maintenance. The grounds are dirty and unkept. The actually apartments are out of date and the appliances are constantly breaking (I have had to put in at least one maintenance request every month for a broken appliance). My kitchen has flooded twice, and a pipe burst above my bathroom causing the ceiling to collapse in. \n\nEven worse than the complex itself is the management. They are rude, unresponsive, and unorganized. When you call to report a maintenance problem, they interrogate you and make it difficult to actually get the problem fixed. I could go on about this. \n\nThere are constant noise disturbances and I have seen the cops come to the complex for domestic disputes 5 times during my stay. \n\nThe price may seem appealing, but I guarantee it is not worth it. Do not make the same mistake I did and save yourself the headache.", "date": "2015-07-26", "cool": 0, "user_id": "7IrmXFuq6i9Xya4US1u8jw", "business_id": "RgGYDFkSI2a8Ul7HOclq7A", "stars": 1}]