[{"text": "Before we decided to wander through the AGO yesterday morning, we stopped into Frank for brunch. The server was awkward, stiff and extremely formal (in a way that seemed unnatural), but overall very attentive and helpful, so I wont hold her attempts at trying too hard against her.\n\nFrank has a vegan dish on their brunch menu, the roasted shiitake mushrooms with heirloom squash, which was nice to see. The server suggested a slightly more substantial dish the chef could make for us with braised lentils and eggplant (also with heirloom squash and tat soi salad). It was phenominal.\n\nBeautiful presentation, and absolutely delicious.  But, with phenominal food, comes a phenominal price tag, so that part was an unpleasant surprise.", "cool": 3, "date": "2010-11-15", "funny": 0, "review_id": "urhz69ahF0pVy0IbI1PMeg", "business_id": "y-Zbg19VSb-k15A_yzruYg", "stars": 3, "user_id": "YgavGxfAdjhkkbwlAY_9ZQ", "useful": 1}, {"text": "Came from new York and this is by far the best pizza I ever ate will definitely come here every time I'm in town the owner is amazing and very friendly", "cool": 0, "date": "2015-12-27", "funny": 0, "review_id": "nEjiQufmcwmtWxyLSUuyIA", "business_id": "XeUm1QS078kgjwONhul0ng", "stars": 5, "user_id": "H1UbzRQn0NjzWHEK-h7IrA", "useful": 0}, {"text": "Love love love Quantum Coffee  100% better then Starbucks (and done properly) Lattes, Cappuccinos and flats, Oh my!   \n\n\nAlso a few cents cheaper then Starbucks(but WAY better in quality)! \n\nService is always great baked goods are always amazing and super fresh! (Also sent in from local bakeries ) \n\n\nDid I mention they now have a reward coffee card ? That's right Starbucks .... You have zippoooo on Quantum... Suck my kiss.", "cool": 1, "date": "2016-05-19", "funny": 0, "review_id": "I8x6dVFeBVGS6XI6ryTQ2Q", "business_id": "NEYMAeK1BeR2E_vELnEIDA", "stars": 5, "user_id": "kBNFdviedCPFWyR-wVaAzw", "useful": 1}, {"text": "REALLY dry ribs, pulled pork tasted like watered down sauce was added after cooking. \n\nMac and cheese was creamy and good not over cooked \n\nSlaw was good- just normal slaw \n\nI honestly could not believe how dry my ribs were.... It was pretty heart breaking as I had been looking forward to going there just for that for sooooo long ! \n\nBrisket was cooked well ... For most of the pieces I got because again part of it was dry. \n\nTip***The sauces are good but they need to leave the ribs in for a longer cooking time seriously tho .... Please do.... Ribs are suppose to fall of the bone not be like jerky .... If I wanted jerky I wouldn't order ribs. \n\nCustomer service was great! Very friendly and helpful. \n\nThis place has a LOT of potential to go so far ... The major loss of stars for me was because when you are a bbq house that advertises ribs like that I expect them to know it is suppose to fall off the bone.", "cool": 0, "date": "2015-10-29", "funny": 0, "review_id": "-2FCX5wLY9aS7LspKKyo4A", "business_id": "TqMTY6xTHThm0C7J1pJ7Aw", "stars": 2, "user_id": "kBNFdviedCPFWyR-wVaAzw", "useful": 0}, {"text": "Okay, so I might be a total weirdo, but I wake up craving Pei Wei's fried rice some days.  There is very little I enjoy more than waking up hungry at 10 AM on one of my days off, logging on to Pei Wei's website, and ordering fried rice just the way I like it without having to explain it to anyone and risk them writing it down wrong.  I'm antisocial, so what?  Then, I know that when they open at 11 AM they will have my very special order of fried rice hot and ready waiting for me.  The portions are huge, so a $6-$7 order of fried rice can last me up to four meals, which is an awesome [if not exactly healthy] deal.  \n\nI don't really like much of their other food that I've tried.  There's some sort of curry dish that was nice, but I'm sticking to my fried rice with extra egg...  yum.", "cool": 0, "date": "2010-07-07", "funny": 0, "review_id": "61LX4t_LBGvy00fWB27DWg", "business_id": "vU8-ATy2-MASm-bQXdhRaw", "stars": 4, "user_id": "vbe6VKvvOHn0BkqAhhmEmw", "useful": 1}, {"text": "I came into Wally's  last night for dinner with my wife and another couple. We were seated at a large round table in the corner on the patio. Our server Candy was amazing! What a gem she is. I have never had a more remarkable server. Seated next to us was a very large rambunctious group of ladies (if I can even call them ladies). The disgusting display of disrespect towards Candy was something I have never seen before. They were behaving like they were in a night club and to watch them bark orders at her and to treat her as if she was a slave to them was horrifying. But even more astonishing was how Candy carried herself through it all. That smile never left her face. I hope those women wake up today feeling completely ashamed of themselves, especially the one who did all of this in front of her teenage sons. I hope I never see any of the women in Wally's again and no server here ever has to go through what Candy went through.", "cool": 0, "date": "2016-01-22", "funny": 1, "review_id": "KiKChQV4kvN_FfAdfpZBZA", "business_id": "9i7m5zn2ky8Z63dth11UWg", "stars": 5, "user_id": "skr4z5eEw36_QjK0jeSNKw", "useful": 0}, {"text": "The food was AMAZING! I got the steak \"hand-held\" with a homemade bleu cheese sauce. It was unbelievable and the beer selection was great. If you get Mac and cheese and like heat, try adding just a touch of siracha sauce, two-thumbs up. The plates were moderately priced but a little steep if you were expecting pub prices, $14 for my sandwich. Good for me though I had bet my friend before we went in about the quality of food and I WON!! the food was great, wish I had a local bar like that in my neighborhood", "cool": 0, "date": "2011-04-05", "funny": 0, "review_id": "V8-exiXirxKwshtnvZxqZA", "business_id": "K6fYrrTorlpXmqutRcrHzg", "stars": 5, "user_id": "8HFAnnpgdOyQbSwCU8GclA", "useful": 0}, {"text": "I was kind of hesitant when I seen that a Thrift Boutique was coming to the neighborhood. But when I chose to stop in; it was a pleasurable experience; very upper class. They have clothing (men, woman, children) some sporting, kitchen, baby items. Great condition, some prices could be lower, but over all not too bad.\nI've been in twice; looking forward to going back to see what is new.", "cool": 0, "date": "2016-08-30", "funny": 0, "review_id": "yjgm1_GMxV0ioIXfqISIkQ", "business_id": "ZpRt2D9ME9NpLuYU9tmOtQ", "stars": 4, "user_id": "Bl-cBFv_uFvLAwaPEDwlZQ", "useful": 0}, {"text": "Best Buffet, I ever had. I would absolutely recommend to all friends traveling to Vegas. The food is very fresh and delicious and the customer service is great.", "cool": 0, "date": "2017-07-08", "funny": 0, "review_id": "4dKT29CqKE730zlsmCRiCQ", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 5, "user_id": "VvL46e4bK2DIOqZQZ6vUyA", "useful": 0}, {"text": "Love this store.  All of the best brands in one place including some very unique ones you won't find anywhere else.  The best women's clothing boutique in Toronto!", "cool": 0, "date": "2016-02-21", "funny": 0, "review_id": "t3SECSreDW24T4al2ppJHg", "business_id": "tqgDsKlKdH73HVs5jxfemw", "stars": 5, "user_id": "aBXJK7fk2GDhDmgJEKiBeA", "useful": 0}, {"text": "Needed a duplicate building FOB for visitors and building management would not issue.  CloneMyKey to the rescue and within a couple days, they delivered as promised with excellent customer service.  These guys are 100% legit and would highly recommend.", "cool": 0, "date": "2015-09-30", "funny": 0, "review_id": "pBRvnpW4ByFhm8kjvx5r0Q", "business_id": "lOYv3HSPkO8hy1jaoER-Rw", "stars": 5, "user_id": "k3AtUSZRiDe_OZBK1fjMtg", "useful": 0}, {"text": "Horrible service. First, I wanted it to go and it was presented to me for dine in. Second, the sandwich was wrong, even after I asked if it was a BLT with Avocado. Good thing I checked before I left. And there was no acknowledgement of the inconvenience and wait time. That goes a long way. Will likely find another Einstein to go to.", "cool": 0, "date": "2017-03-10", "funny": 0, "review_id": "egBTPo6XmOplA5ClLv6YZw", "business_id": "KYkUtRB1QKrI6Twov98leA", "stars": 1, "user_id": "VYU6ZQP58KkgqL2_o2QQhA", "useful": 0}, {"text": "I'm fairly new to the thin-crust pizza scene, and this place really didn't do it for me.\n\nA friend told me about this place, so I checked it out with a couple buddies last Friday evening. After an hour waiting for a table (expected, considering we just walked in at 7pm on a Friday), our server ran down the specials, and pretty much the whole menu. Very friendly, though a bit tough to hear in the smaller, crowded environment. \n\nI went for the Salami pizza, which arrived at the table quicker than expected. Unfortunately, I was not pleased with how quickly the thin crust can get soggy upon saucing and piling on toppings. This point alone dropped my rating to 3 stars. I've heard mixed reviews about the crust, but my buddies and I all agreed that it was just way to soggy for us. \n\nI did, however, find a fix for the soggy pizza - take some home in a doggybag, reheat in the oven, and it's the delicious taste of the pizza, with a better crust.\n\nI doubt I'll return to this Pizzeria - next to try is Terroni's.", "cool": 0, "date": "2010-07-15", "funny": 0, "review_id": "mRkzBt-nhAL7keH5oFMumA", "business_id": "KVpvE6pOPM9KMvak4HFsNg", "stars": 3, "user_id": "NArI8E3qQQvcW1SnzyqDYA", "useful": 0}, {"text": "As close as I have ever gotten to \"authentic\" Mexican food. I was expecting the same ol canned beans and flavored food, but it was almost as goods as my mother home cooking! Of course no one can ever beat moms haha. Hard to empress a Mexican with restaurant style food, but this place did it indeed! Will be back", "cool": 0, "date": "2015-08-18", "funny": 0, "review_id": "kK8pneuKN-grZ33GobC7iw", "business_id": "Sovgwq-E-n6wLqNh3X_rXg", "stars": 5, "user_id": "_ku-IIAx1MvfBzaP6QS-zQ", "useful": 0}, {"text": "This place is great! I love Taylor, she does an amazing job on my nails every time! I'd highly recommend going here. I get acrylics w/ decals, rhinestones, & designs every time and they always get compliments for the next 2 weeks!", "cool": 0, "date": "2017-04-13", "funny": 0, "review_id": "cjcgk28A3K0cBFfa_DvpaQ", "business_id": "Yf8PiUFYTgeN-NVSgrntPQ", "stars": 5, "user_id": "mmkBUUJ2gWdynQSSmJRz0A", "useful": 1}, {"text": "The food is generally pretty good. The service can be a hit or miss. A little bit on the pricey side.", "cool": 0, "date": "2014-10-09", "funny": 0, "review_id": "_v5uvlhMDnLDlh5K4vfAIg", "business_id": "Mksyt1TZQ-7vzCZjeuzfAg", "stars": 3, "user_id": "xNSvX-tVu4D_V3zTR8051Q", "useful": 0}, {"text": "I spent half my life eating food in New York and needless to say I am extremely picky ... I have never had a better Greek meal in my life ... Oh did I also mention that my mom's maiden name is Staros ... OPA ... They also have live music at noon for lunch can you imagine! Tomas may you have a great success in your restaurant fabulous! :-)", "cool": 0, "date": "2014-06-30", "funny": 0, "review_id": "Y8Pt3uac5y0XqBtybtl1yw", "business_id": "k3usuzYs_UVBkSgUbmthdQ", "stars": 5, "user_id": "u-iEwnRvS3LU4yT7gZ2cYg", "useful": 1}, {"text": "Just finished a terrific dinner at this great barbeque restaurant.  From the sangria, frozen lemonade and cornbread to the baby back ribs, mac & cheese and coleslaw, it was all excellent.  Service was friendly, portions were generous and food was out very quickly.  The free take away bag of sugar donuts was a wonderful end for a delicious dinner.  Even at 5:30 on a Sunday night the restaurant was full and a reservation helped us to be seated promptly.", "cool": 0, "date": "2016-05-30", "funny": 0, "review_id": "MrYBbWD-cT08FBpNohEnoA", "business_id": "VyVIneSU7XAWgMBllI6LnQ", "stars": 5, "user_id": "KpV8_I9vLBCbrG-d5ED2FQ", "useful": 0}, {"text": "This is the worst experience we had at Lakeside Wynn from the waiter to the food the music in the restaurant. The worst don't know how they received to be in the Forbes Travel Guide Four Star award-winning restaurant.", "cool": 0, "date": "2016-05-30", "funny": 0, "review_id": "TRTDqClehII50Ut0l5_WLQ", "business_id": "oi3FWENKZ5y_bDCpEb8yOw", "stars": 1, "user_id": "TGPkoF4sub0vqYQ1w1UYUg", "useful": 1}, {"text": "Très bon restaurant pour le petit dej choix variés : \u009cufs pancakes et fruits frais. Service impeccable", "cool": 0, "date": "2017-08-15", "funny": 0, "review_id": "Pdo_4ehBTPvdDPMk5MeF6Q", "business_id": "kJaoLPzOYh_7UoKuxL0l6Q", "stars": 5, "user_id": "5fAaBl0dC69kW5untTf8KQ", "useful": 0}, {"text": "Went for brunch/lunch with my family... We opted for the Bellagio over the Wynn based on the reviews. We arrived at 1100 and finally got through the long line around 1200. I was pleasantly surprised with the cleanliness, huge variety of the food, and drinks. There is a little bit of everything from meats, pastas, seafood, salads, pizzas, breads, fruits, breakfast items (omlet station, pancakes/waffles, warm maple syrup, thick slabs of bacon, red potatoes, and sausage-SO YUMMY!!!!) and desserts!!! Champage/mimosas were optional for a small extra charge and the orange juice tasted like it was freshly squeezed. My favorites were the large cocktail shrimp, prime rib, ham, turkey, sea bass/salmon, coos coos, sushi, eggs bennidict, and the best cherry danishes that I've ever had!!!! The fresh fruit was amazingly sweet and ripe especially the strawberries, cantaloupe, and watermelon. The waitress was attentive and checked on our table often. We tried everything and I wasn't disappointed with anything. My daughter is 8 and can be a picky eater, but even she was in  pure heavan with the selections. For 3 people we spent $98.00 and it was worth every penny!!! We'll defiantly be back!", "cool": 0, "date": "2012-11-13", "funny": 0, "review_id": "DBRf92L7MMl5CL4VAqT4KA", "business_id": "ujHiaprwCQ5ewziu0Vi9rw", "stars": 4, "user_id": "MVj_1U4D5h7iDtu5TG0d2Q", "useful": 0}, {"text": "The worst place been there twice same nasty service  how can this place be open with this kind of rude Spanish people and I am Spanish is embarrassing", "cool": 0, "date": "2016-06-17", "funny": 0, "review_id": "K2QJsw2IovlGYS9ypKkECQ", "business_id": "6cYgq6_kSOa2SgXrjyaLZg", "stars": 1, "user_id": "pibm8xKWF7LZgKf12iqSLQ", "useful": 1}, {"text": "I am very undecided about his place. Yes - it's convenient as I live close by - BUT the prices are ridiculous. I compared a couple of items from the local Fresh Co and Metro and Cousin's adds a couple of dollars to their canned/dry goods. Also their produce is overpriced such as their asparagus which is always a couple of dollars per pound more expensive then the other grocery stores close by. Their roast chicken, made on location, is ruined as it is slathered with horrible bbq sauce. In fact, most of their hot meat items are slathered in this sauce. Their customer service is simply deplorable. Their cashiers look miserable and pained even when they have to say the total price of your order. The parking is a mess. Very dangerous. Lastly, and certainly not least, the male employees noticeably come out and circle any good looking girl, woman, lady etc... that walks in to the store. I know this because it happens to me and makes me uncomfortable. They will slowly yet obviously start coming out of the back and the aisles and circle/pass by you a couple of times. I swear sometimes they are notified through walkie talkies or something that a 'female has entered the store' and they start coming out like vultures.", "cool": 0, "date": "2017-09-02", "funny": 0, "review_id": "2R09lxDcHFovasBeXR_CXQ", "business_id": "iitV_44p3NfpbFv-Mt4VaA", "stars": 2, "user_id": "Tw0l4fJtukjeJ30r25wffg", "useful": 3}, {"text": "I recently got my car full detailed and they did a good job on it for a reasonable price too. the staff are nice and friendly. I highly recommend this place. Will come back for sure", "cool": 0, "date": "2016-06-26", "funny": 0, "review_id": "tAqsy5Kq-6VESe9YJUsOKg", "business_id": "9t_8diw5-AlHwpRdZAP22w", "stars": 5, "user_id": "plZ58vScKsk2oNXxX1eFWQ", "useful": 0}, {"text": "Hannah listens to what look you are trying to achieve with your extensions. They last as well. Great service and she takes her time with you.", "cool": 0, "date": "2015-07-25", "funny": 0, "review_id": "VCqQl7786gh6brLeuAI6DA", "business_id": "wcYcF_C7GTm6Q888V7ePDg", "stars": 5, "user_id": "uhnM9xSAlh_G87HYyJSgVw", "useful": 0}, {"text": "This place is awesome! Just moved to Vegas on Sunday. I've had 3 separate occasions when I bought e-juice from a local smoke shop and they were TERRIBLE.. One actually gave me a headache ( never ever buy a juice from the company called 'Dolce Vapes'). Anyways, I went into Vapor Bombz and it was great. Edgar recommended some great liquids for me and my taste and the prices were very fair. They have a rewards program so after 9 bottles you get the 10th free! If you Vape like me, that adds up pretty quickly. I definitely recommended this shop it's amazing.", "cool": 0, "date": "2015-03-06", "funny": 0, "review_id": "cQcqzuTGheyFkEdqwm-Lxw", "business_id": "5B2bliw6ZYnFv8VVCdoSDw", "stars": 5, "user_id": "ywe_fvZcN3KSIEKapjE6Rg", "useful": 0}, {"text": "Where can you find $2.00 a dish dim sum anymore? The quality is good for the price you're paying. I went to a dim sum place and paid 3 times that price for a mediocre meal. This isn't a gourmet place like the ones in Markham and Richmond Hill but its perfect for the downtown dwellers. \n\nThe ladies pushing the carts are nice - the wait staff are super busy so sometimes you have to remind them of your requests. \n\nIf the dim sum dish you are craving has not come around after a few carts have passed,  you can order the dish through the wait staff who will put the order into the kitchen - nice and fresh!\n\nStars taken away for ambiance and decor - need a major update. Food presentation can be improved as well, but all in all, it's $2 a dish! Take some to go for a nice easy dinner!\n\nRandom comment - Elevator is a bit sketchy - if you're not afraid of heights, take the stairs - the elevator takes a while to get there and you'd want to let the elderly on first anyhow, leaving you to wait for it to come back again.", "cool": 0, "date": "2013-09-07", "funny": 0, "review_id": "VEH2hrTL84HADVIhxogYgA", "business_id": "pofDmHoIsdvPcSKzb2iMag", "stars": 3, "user_id": "PkRFSQgSfca9Tamq7b2LdQ", "useful": 0}, {"text": "H&F Jewellery is amazing!\n\nI had given my husband some ideas of engagement ring designs I liked and after going to the traditional big box jewelry stores, a friend of ours recommended H&F.\n\nThe customer service here is great - they are extremely knowledgeable, attentive, honest and the prices are very reasonable! My husband surprised me with a custom designed engagement ring and I love it!\n\nWe went back for our wedding bands and I worked with the gemologist there to create 4 beautiful bridesmaid gifts - necklaces with a pearl and white gold heart pendant - my girls loved them!\n\nWe've recommended 5 other friends to H&F - they've all been satisfied with their engagement rings and wedding bands.\n\nGo to H&F for all your jewellery needs - you won't be disappointed!!", "cool": 0, "date": "2012-05-19", "funny": 0, "review_id": "abStF7f3_IyfZmOP82baZQ", "business_id": "nW45ez1L6U4PsYhV1BTrGQ", "stars": 5, "user_id": "PkRFSQgSfca9Tamq7b2LdQ", "useful": 1}, {"text": "The flavor of the noodles were definitely good, however not only is the fried chicken bowl impossible to eat, the chicken we had was not edible to say the least. It comes as a drumstick on top of a bowl of noodles and soup, how are you supposed to cut it off the bone with no plate, unless you slosh your soup everywhere? Picking it up and eating it isn't exactly useful because then you're eating a chicken leg and then some noodles afterward? It should be a cohesive dish, not a challenge. \nRegarding the fact that it was inedible, let's just say it was cut into and we felt uneasy eating it....\nShortly after we overheard a woman asking for a refund due to her chicken.. so definitely don't get it lol.", "cool": 0, "date": "2017-12-10", "funny": 0, "review_id": "xhWfoJC-W80p2yDDhDUSBg", "business_id": "U0eUwTGWDBVdE67qVHYEjQ", "stars": 2, "user_id": "CyzXeE6dTerrHgUpLBvQDg", "useful": 1}, {"text": "Michael Dennis and his team have always been extremely helpful and professionl when I have pool problems I can't solve myself.  I can always count on X-Pools to go the extra mile to get things done!", "cool": 0, "date": "2013-04-05", "funny": 0, "review_id": "fZmTmJzAlXVVaNJ-xKy12A", "business_id": "pxkIhzA-XCLz1mtxITbs0Q", "stars": 5, "user_id": "nj9vFayHV1E5y5IDlfhtsQ", "useful": 0}, {"text": "Average at best. Been here twice, twice got chewy bulgogi that tasted old. Grey and chewy and too sweet.\n\nSushi is terrible. \n\nAvoid. \n\nIf you want sushi, go elsewhere. Like anywhere else.\n\nIf you want Korean BBQ, go to Cafe Ga Hyang.\n\nNever again.", "cool": 1, "date": "2016-03-25", "funny": 0, "review_id": "A8Rx-bY2FYPNLE386RAa4A", "business_id": "8Y5p2IQMLX6QjGPzxanexg", "stars": 1, "user_id": "Arm7cgLCDWnSKJhpphJ_3Q", "useful": 1}, {"text": "Still some of the best tacos! Chicken and fish ones tops, addictive to snack on the chips and salsas. Upping to 5, happy to support a local small biz offering great value for great food :)", "cool": 0, "date": "2016-11-15", "funny": 0, "review_id": "suZKIgwvbFuSgTFS_J1ZZg", "business_id": "9pWzjhdrPgsZEmF7-QOaIQ", "stars": 5, "user_id": "vexkrpa0-IAZ_j5z7ZJyxg", "useful": 0}, {"text": "Very pleased with our experience. Great off the strip option for the Las Vegas area. Excellent prices for the stay. The Feast buffet is a great priced food option. Bottomless mimosas for breakfast was a fun experience.", "cool": 0, "date": "2017-09-03", "funny": 0, "review_id": "7lbykaWFD8YBwT0mU1Rexw", "business_id": "0QzCeORfF8EY34UODWRV9A", "stars": 4, "user_id": "6vJY67yve43Ijvn8RKVUow", "useful": 0}, {"text": "It was decent before now it's terrible. Wings are so dark it looks like it was fried in old oil. Flavours didn't taste normal. Won't ever go back again.", "cool": 0, "date": "2015-11-07", "funny": 0, "review_id": "3ARL8Y4ZPZ1qE9vEk2PH6w", "business_id": "JJys4pp5xmf3bB4E3lmxRA", "stars": 1, "user_id": "RsgRH4ixaiJ1zWnmXam6pQ", "useful": 1}, {"text": "THE PLACE IS TRASH.\n\nToo bad I actually have to give this garbage dump a star. Living at Daybreak Gardens is akin to living in a dumpster surrounded by gangsters and roaches. I have come to realize that they have trashy people living here, trashy people running the place, so it's perfect for trashy living. \n\nDon't be foolish enough to call and complain about anything like drugs or your neighbors threatening you by yelling at you through your windows. Nothing is their responsibility. I mean nothing. Drugs are acceptable. Violence is acceptable. Really, any kind of ghetto behavior is acceptable. \n\nBe prepared to call the police for any kind of help because the management wants the place to be run down and full of thugs. And believe me, it is. The place is trash.", "cool": 0, "date": "2016-04-19", "funny": 0, "review_id": "0oBiepvILtRkfsq-LlrWng", "business_id": "y6eUneu8lbQLsls12KmqqA", "stars": 1, "user_id": "HV0ERLL5UTCrZlTFjN385Q", "useful": 2}, {"text": "What an OVER-THE-TOP experience I had with Party Booths. I work with a Nashville radio station and we partnered with Party Booths for a major station event. Leading up to the event, the team was very prompt in answering my questions, professional, timely, and truly a joy to work with! Our listeners enjoyed the custom take-home souvenir (photo) they received and all of the photos were available to view online within a few days following our event! I would HIGHLY RECOMMEND Party Booths to anyone looking to add an element of FUN to your event.", "cool": 0, "date": "2016-05-11", "funny": 0, "review_id": "Q4aA8DNvZOxS8DmtZGHmDA", "business_id": "OGFUJTsNlCAnUIg8OOD66g", "stars": 5, "user_id": "bldp7R-Rm3eHoZCXnL9LoA", "useful": 0}, {"text": "Unbelievable. No words to describe the magnitude of this place. Food's divine. View's divine. So romantic. Expensive, yes, but sooo worth it. Try the Chilean Sea Bass if you ever get the chance. OMG. Almost brought me to tears.", "cool": 0, "date": "2014-04-15", "funny": 0, "review_id": "ax3A4yb6t_OMnptVGp2ifw", "business_id": "OtGSQQzV7uF8XPAsNIh7Bw", "stars": 5, "user_id": "6oA8D7W2x2ECcUXMtAe6MA", "useful": 0}, {"text": "A neighbourhood staple, Lahore Tikka House is located on Gerrard East in the heart of little India. They do one thing and do it well: Halal Pakistani cuisine. The space is fairly plain, the decor is mostly barebones, and they've been 'under renovations' for the last few years. Despite that, this place seems to run seamlessly and churns some serious Indian food. Outdoors they have a large patio where the huge indoor space can spill over to in the warmer months once the restaurant gets busy, which it inevitably does. If the seating is full and there's a line at the door, no worries, this place has a great takeout service, which I usually get. Just call ahead, and it's usually piping hot and set for pickup in about 20 minutes.\n\nFlaky with hint of spice and smokiness, Lahore's samosas are better than your average samosas on the Gerrard. But my usual order includes the Vegetable Biryani. It's a huge portion of perfectly cooked Basmati rice, tomaotes, peppers, cauliflower, chickpeas, potatoes, and a mild blend of tumeric, cumin, and chili powder. I also love their Paneer cheese. The squeaky Indian cheese is an unaged curd cheese that is denser than tofu, but seems to absorb flavours just the same.  Lahore serves their Paneer Tikka Masala, and in my opinion, it's the city's best. Lightly seared and tandoor, it's served in a smoky, slightly spicy sauce; it's made the way it should be. And of course, be sure to order a side of their naan bread. Not only is it lightly oiled, seasoned, and softly charred, but it's also perfect for making sure you soak up all of the sauce.\n\nNext time you're looking for some Indian food, forget all those 'all you can eat' buffets and head to Lahore Tikka House on Gerrard East. It sets the bar pretty high for good Indian food in Toronto.", "cool": 2, "date": "2010-11-27", "funny": 0, "review_id": "Pswa777brp60Z7SYvptBeQ", "business_id": "RUd_M7DPJq1I3DPq0oF--w", "stars": 4, "user_id": "YHWsLBS8jzZiPjKHMFOaAA", "useful": 3}, {"text": "Anyone remember when Future Bakery was big business? It had multiple locations around Toronto, and it was focused heavily on the food and culture of its Ukrainian ownership. While the Annex location is still kicking strong and remains a popular beacon for starving U of T students, the others, except for the tiny St. Lawrence Market outlet and a baking factory in the city's Westend, have all but disappeared. All that remains is a lone, ceramic Ukrainian Easter egg sitting high up on a shelf in the Annex location. But time moves on I suppose, and there's a reason that despite the others all going under, the Annex location is still packed at almost all hours of the day.\n\nFuture is cheap. Straight up, that's probably one of the predominant reasons they're so busy, but it's not as if you're getting some reheated crappy food for your money. They make some pretty good stuff. (Right off the bat, I'd like to point out that there is a food outlet right in the back of this place, and I think they sublease it to sell food in there, but I am including it in this review, despite that they might be two different places.) Most notably, you can grab a pretty good breakfast there, especially on a Sunday morning. Sundays in the Annex are deadsville; everything is closed until the early-afternoon, so if you live in the area or you happen to find yourself there because you thought everything would be open, this is a great place to grab a pleasant morning breakfast or a greasy hangover cure.\n\nFuture has some seriously amazing cakes, and if that's your thing, then you should know that Future is probably one of the best values for cake in the city. Besides having a killer selection of top quality cakes, they all sell for about 5 bucks a cut. There are a whole ton of different kinds too, ranging from fruit pies and caramel-based cakes to cheesecakes and heavy-chocolate tortes. Although I don't find their coffee particularly spectacular, they do have it available, and it's still a pretty natural choice to go with the cake, despite being nothing-more-than-average.\n\nOnce the warmer months hit, Future place has got a pretty spectacular patio too.  Busy, big, and perfect for people watching, it's easily the 2nd best patio spot in the Annex. It covers the whole side of Future's corner building, and it's an ideal place for cold pints.\n\nFuture pretty much accommodates everyone. Early morning breakfast, late night after the bar, mid-week meeting spot, in-between-classes study hole; no matter what you're using it for, chances are that Future will be able to offer you something. So despite the fact that the Ukrainian aspect is no longer really existing here--or at least not being a visible existence--it hasn't slowed this place down at all. Most likely, people haven't even noticed the lack of Ukrainianess. And while purely for nostalgic reasons, I find that a bit on the disappointing side, as long as every time I go in there I can be reminded of Future's past by that lone Uki Easter egg, I'll make due, and I'll being eating cake.", "cool": 1, "date": "2011-02-16", "funny": 0, "review_id": "ihW0mpuMrkkmeN3TeZ4rog", "business_id": "kw8Lh8bJAtquHkT9CB4zGg", "stars": 4, "user_id": "YHWsLBS8jzZiPjKHMFOaAA", "useful": 2}, {"text": "Expensive ($90 CDN per head), but really well executed french food. I especially liked my foie gras poêlé. See photos.\n\nDon't know if I can call this place romantic. It was dark, alright...\n\nHaven't had much french food that can quite compare, but I live 3000 miles away (cry)", "cool": 0, "date": "2009-02-11", "funny": 0, "review_id": "2zH8mmlmBMD6zd5O3Np8lg", "business_id": "Ht-_i0UAq7YDBaqJwcQMdQ", "stars": 5, "user_id": "4zRsDqF-gASVB3-dEWDo7A", "useful": 1}, {"text": "Buffets can always be overwhelming since its all you can eat and theres a variety of choices. I've only been to this one for dinner so I can't comment on their lunch options.  The dinner has kobe beef, prime rib, duck, paella as some of your options along with salad and sushi. Theres a lot to choose from so you should be able to find something you like. \nThere can be a long line for dinner so be prepared. My friends and I think its worth the $38.", "cool": 0, "date": "2009-07-30", "funny": 0, "review_id": "xAXG7B0PecEW-WzogdcpRQ", "business_id": "ujHiaprwCQ5ewziu0Vi9rw", "stars": 4, "user_id": "T52A1VUAnsZaKV8RJ5r5hg", "useful": 0}, {"text": "Alan basically saved my Thanksgiving weekend from being wasted! I needed a BIOS update to be able to build my Kabylake system and with no profit to himself, he helped me find a place that would do it the same day. Came in super clutch!", "cool": 0, "date": "2017-10-08", "funny": 0, "review_id": "y--ZifPBgLd0GOFxAAD-Pw", "business_id": "7ep7mVds1lc5Ar7xPtdBDw", "stars": 5, "user_id": "0hSChYYQQKPS0qksI4VtSQ", "useful": 0}, {"text": "It's really upsetting writing this review.  I have been to centennial hills a few times and they were great visits and I really liked the place and staff.  I decided to bring my 3 dogs for their spa special, I called and made an appt for first thing in the morning and when we arrived we were first to check in for the spa day.   \n\nI'm not going to go into all the details of what happened and why it was the worst experience for myself and my dogs but I want to warn you.   Please before you bring your pet find out what all \"spa day\" includes because I was mislead.  \n\nThere was a lot of mistakes by the staff and I would still consider myself a customer of this facility if they would have stepped up and owned the fact they fell below their service standard.   Mistakes happen but when they do step up and stay we messed up and not just preach policy that didn't happen in my case.  \n\nI did ask for a refund and they gave me the money back.   I would have been more satisfied with them saying they messed up and we could have split the cost. \n\nJust make sure when you go that you ask a lot of questions and make sure you follow up to make sure your animal is ok because if they are not they won't tell you.", "cool": 0, "date": "2015-08-23", "funny": 0, "review_id": "sVPOsblxaoMLmKf_dPVRXQ", "business_id": "OActfpEHMEOCdGH5HN6MOw", "stars": 1, "user_id": "BBuCypsgRNU9_LM4b0fcyA", "useful": 2}, {"text": "Awful Cake made in unhealthy way. I bought for my Son's b'day and wanted to take it to the playground to share with other kids. The cake has serious problems with the way how it was made. It doesn't taste like a cake and was like you are eating sugar syrup. Returned it in 15 mins after taking it home. She took my number and told the manager will call me. She never called back. I called her back again and left a VM for them and they returned the call after a month and asked me to order something new. I told her about my previous experience and she said she will ask the manager to call back. She finally called and said they were sorry but couldn't issue a refund since they didn't find any problems. Well, I wasn't looking for the refund but I would have been happy if they could just respectfully acknowledge the problem. These people have attitude, they are not getting by business back ever.", "cool": 0, "date": "2015-09-15", "funny": 0, "review_id": "WUKpMVdJlvpuIeinVzF5KQ", "business_id": "VhEWjWUrcHFFNAyZN-TzyQ", "stars": 1, "user_id": "lJpYNlisYrFLES2rgaHjEQ", "useful": 1}, {"text": "My favourite bakery in the city. Everything they make is excellent: pastries, breads, gelato, coffee, cakes. I love that it's a family business being run be the younger generation. They obviously care a lot about their community and it creates a wonderful atmosphere. Some highlights are the cannoli, their ring cakes and the olive ciabatta.", "cool": 0, "date": "2016-07-25", "funny": 0, "review_id": "CWr6_KAvQRf7maPg_WHtBw", "business_id": "02Ycww2etUAxorZb5gIM8Q", "stars": 5, "user_id": "6f6tttboYKy0QBmomP60eA", "useful": 0}, {"text": "I had a very negative experience today with Dr. Conway from Martin Vet who was unprofessional, rude, and hostile - someone that I certainly would never trust to care for my pets. I wanted to have my dog have comprehensive dental care completed under her care after my regular vet provided me with a full work up and referral for dental work. When I contacted Martin Vet to set up the procedure and provided them with his medical records no one responded to set up an appointment for over a week. After calling back and speaking with multiple staff, I finally heard back from Dr. Conway herself at 7 pm on New Year's Eve.\n\nShe called me on the verge of hysterics insisting that despite the referral from my general vet from a dental visit completed a week ago, and the urgent needs of my dog she needed to first examine the dog and charge for a consultation before scheduling an actual appointment. When I asked if any dental diagnostics could be completed at the consultation, she stated my dog would need to be sedated for that. So, I would have to wait another two weeks to treat my dogs dental needs.\n\nSince my dog recently just had a wellness exam, and the medical records were provided to the office, I asked if the consultation fee could be waived once I paid for the dental procedures and sedation. To my knowledge all medical professionals are expected to examine a patient prior to sedating them when asked regarding this issue, Dr. Conway angrily stated \"No, the day of the procedure we just check their temperature.\" This was very concerning to me and I would not seek care from an establishment that sedates dogs without doing a thorough work up the day of the procedure. \n\nAs a dentist for humans, I can tell you that without radiographs a dental diagnosis/consultation cannot be given, so billing for a dental consult without radiographs and then billing again another separate fee for a dental exam under sedation, is unethical. No dental diagnosis can be obtained without radiographs. As well, it goes without saying that if anyone sedates your pet - a thorough exam should be conducted by the anesthesiologist performing the sedation, all medical records reviewed the day of the procedure rendering the consult performed by Dr. Conway unnecessary and inhumane as it delays the ability for a pet to be treated in a timely and compassionate manner. There are many options for vet care in Toronto, and this is not a place I would trust with my pets.", "cool": 0, "date": "2016-01-01", "funny": 3, "review_id": "Bb6yeKKdpw6TcDfhEZfhoA", "business_id": "QzUhe8LwHf-XZVFjj69E0g", "stars": 1, "user_id": "KMgkXFjB8iuXTBn5BIQQzA", "useful": 3}, {"text": "Friendly, helpful, and professional Hostess and Waitress .\nI had the Clams with a Garlic Butter Sauce and my Wife had the cold Lobster Roll\nBoth were delicious and the beer \" Side Launch \" on Tap was good too. \nOur first visit and looking forward to the next time.", "cool": 0, "date": "2017-12-06", "funny": 0, "review_id": "Umh2JWzo9B6u7oF4HuLqjg", "business_id": "K1nwSvx14on6eVBbu5E9rA", "stars": 5, "user_id": "BRlK07TgXekl2jdRHMrbYw", "useful": 0}, {"text": "this place was a disgrace not only to me but to America, horrible service, horrible attitude, horrible environment. I went with my children and they sat down to take a break because my little baby's were tired and the ladies told my babies they have to be standing and wouldn't allow them to stand up and began to yell at them. I have never been so disrespected like that before in my life. I highly suggest you don't waste your time and go here i also saw one of the employees pick her nose while she was getting out brackets on so disgusting. HORRIBLE PLACE", "cool": 0, "date": "2017-02-01", "funny": 0, "review_id": "6O8NIMzjNjyLl_T8gQTy1A", "business_id": "VKHLI58XlTYTMSkxyjhU7g", "stars": 1, "user_id": "q_a-J4pKCe3HgDuLNrBz4w", "useful": 1}, {"text": "Do not order the hot dog. Not sure what it is made from but you won't like it. Chicken Florentine soup was good", "cool": 0, "date": "2015-04-08", "funny": 0, "review_id": "iJyk6DDtAkOS9RWseOVwEA", "business_id": "VZQPYoK6l_vo5jwYgabJdQ", "stars": 2, "user_id": "1TuAUOw-FWn7sy95hZDejA", "useful": 3}, {"text": "The atmosphere, wait staff and the food all fabulous. Let's not forget the DJ great music. \nFirst time in Vegas and was not loving it but Herringbone had class, trend and style. I would definitely recommend it", "cool": 0, "date": "2017-11-10", "funny": 0, "review_id": "_fC7hHbsvIpeuLEMUk2mjg", "business_id": "-wCtRhzWJ40Z4F8mmg7kWg", "stars": 5, "user_id": "v4W1zLelbCeHXUrgw8eYIA", "useful": 1}, {"text": "0 star! Shrimp won ton but no shrimp! Only meat inside ! Told them about that staff just say nothing ! Bad list !!", "cool": 0, "date": "2013-10-30", "funny": 0, "review_id": "P-MseEXGmyB4MOUrCif1HA", "business_id": "UnWWyBzpo6L1tT3_5mUqZQ", "stars": 1, "user_id": "6jjQkX_rQafuL4Ied1XtuA", "useful": 2}, {"text": "They really knocked our food service out of the park. It was truly the most amazing food I've ever had at a wedding and being that it was my own, I was adamant about the quality being key. I don't want to diminish the fact that if I were at a restaurant and ate this food I would be extremely satisfied. \nI still keep receiving unprompted feedback stating that this was the best food my guests have EVER had at a wedding. Thanks for making my day so great and my guests' palates satiated!", "cool": 0, "date": "2013-08-21", "funny": 0, "review_id": "wuvAvDmy_qQmRflyuZcT6Q", "business_id": "yXvyFDIdJTM0kLGSe7VYAw", "stars": 5, "user_id": "iVpbYnfpJFZUk2-ivScSmw", "useful": 0}, {"text": "Moms to Be is my go to store for baby/toddler items. When registering, the sales associate helped us as first time parents navigate all of the NEED items versus the NICE TO HAVE items. Huge selection and yes, it can be pricey, but they stand behind what they sell.\n\nDon't forget the AS IS store too. Great deals!", "cool": 0, "date": "2012-03-18", "funny": 0, "review_id": "3FaARkVkhCiAxLCT9SaBIA", "business_id": "pLP4zc_eImuD5-AMtZAYHg", "stars": 5, "user_id": "scaPIsZT65tJn_ofLWJbyg", "useful": 0}, {"text": "I have a complaint of being overcharged.  The product is  mediocre, the older woman ringing my order up, insisted on charging me individually for each cupcake, when I had a 6 pk. and a 4 pk. of cupcakes which costs $32.50.  10 single cupcakes were $36.50.  I even put a nice tip in the jar before she started ringing.  Made me sorry that she felt she just had to swindle an extra $4.00 out of me.  I left because it was busy, but, it's bothering me.  Seems there's a buy 5 get 1 free deal.  I wasn't given that, either.  Just ripped off in more ways than one.  Will never be back and hope to save you from an unpleasant experience.", "cool": 0, "date": "2016-08-04", "funny": 0, "review_id": "aZw_J0GoUnDWUmfwq_WYpA", "business_id": "Qmx1rFrQHpcYT6XPNgv0zQ", "stars": 2, "user_id": "qXLWeNPNcEplWj4meCckdA", "useful": 1}, {"text": "Line out the door.  45 minute wait on a Wednesday night.  Cramped noisy tables all with the dreaded Barstool.  \n\nSeems like a good scene if I hadn't been hiking all day.  You obviously don't go there to relax!\n\nThe beer was OK.  Their Peachy Lambic was pretty good. The food is OK.  The service was friendly.\n\nFour Peaks wins Pheonix's shortest dress award - that might be a huge draw for some!", "cool": 0, "date": "2014-03-03", "funny": 1, "review_id": "D9dp6gj7Z_p86jo1VRVwyQ", "business_id": "JzOp695tclcNCNMuBl7oxA", "stars": 3, "user_id": "f0JHYn-MoQ9KP1Fjifel_Q", "useful": 1}, {"text": "Jason and the staff at Aloha Auto repair are the BEST..Truly the best place to take your vehicle, They are honest and don't try to rip you off like a lot of places..\nIt figures I found them and now I'm moving..\nI took my car there because of all the great reviews.. and they are correct\nThey are the BEST..", "cool": 0, "date": "2014-11-19", "funny": 0, "review_id": "ZwMsMguRtkKSOZ6XyVIJPg", "business_id": "jt9O4tqBb-a7encP9ZEGVQ", "stars": 5, "user_id": "EWK0I0eVUJ2a0ECJ5pLLKg", "useful": 2}, {"text": "It was alright. Still think YAMA sushi is the best. Too many rules here. Didn't like how there's a limit on baked mussels and desserts!!!! And how you can't order half rolls. There ahi poke salad sucked and barely had any fish in it. Most likely won't be back.", "cool": 0, "date": "2015-11-01", "funny": 0, "review_id": "taVOtm0bZhGHmrZZGwqhKw", "business_id": "dzKDFiWLkspVBJKGfT0M2g", "stars": 1, "user_id": "5rljRZuV-cQI599k_SwhBQ", "useful": 1}, {"text": "I'm writing this review over a year after moving away from Phoenix because I miss Elite so much. Incredible attention to detail and everything you'd want from a dry cleaner. If you think all dry cleaners are the same, that's because you haven't tried Elite yet.", "cool": 0, "date": "2016-06-10", "funny": 0, "review_id": "Ut4OxaoNMLs1j-4MMaqggw", "business_id": "Awz0pdZbfSHnprg3cyq2aw", "stars": 5, "user_id": "P-wOD5nbxybCSvxZjqOkQg", "useful": 0}, {"text": "Restaurant is cute, Korean dishes and sides amazing.  Great sushi prices.  Will go again", "cool": 0, "date": "2014-01-23", "funny": 1, "review_id": "vovh-450iTniA01MRu9m3A", "business_id": "8Y5p2IQMLX6QjGPzxanexg", "stars": 5, "user_id": "CYwsQ6tjFMcqHe_okpnMcA", "useful": 0}, {"text": "Made a special trip down there Sunday the 20th at noon and they were CLOSED!!!! Website clearly states they open at 11:00am. Very disappointed :(", "cool": 0, "date": "2013-10-21", "funny": 0, "review_id": "gOWE2-w6vVZ0oph02Z-s8Q", "business_id": "3GEEy7RP6e4bT4LAiWFMFQ", "stars": 1, "user_id": "KMbPhOkpK5xJjOtnxQBEdA", "useful": 5}, {"text": "I love that it is open later than others. They are fast and accommodating. This location is well kept and feels clean. My nail tech was not very personable, BUT I actually appreciate that. I am not a fan of small talk while getting my nails and toes done. I have only been once so I am reserving that last star for when I go again to make sure the service is consistent. As of now I would highly recommend!", "cool": 0, "date": "2017-06-30", "funny": 0, "review_id": "x4vCPn9NqrvnMk7id2916w", "business_id": "McPUgVVyRhNf0v06pPuV4w", "stars": 4, "user_id": "235zPC8XA5cW8QIKNeaCQQ", "useful": 0}, {"text": "I contacted Ron to arrange a bouquet, pin, and flower crowns for my recent wedding. He took a considerable amount of time out to speak with me regarding flower colors, types and arrangements. The end results were beautiful! I was floored when I saw what he had created. Just gorgeous and ready exactly when he said they would be. I would recommend Bloomers to those looking for bridal flowers or just an every day arrangement.", "cool": 0, "date": "2016-11-09", "funny": 0, "review_id": "i2C5AAktffS1MnUn_ZAXMg", "business_id": "aUWc_viqJs2SAYSFXwvXDg", "stars": 5, "user_id": "235zPC8XA5cW8QIKNeaCQQ", "useful": 3}, {"text": "Let me start off by saying that I'm not the one to rate any place 5/5 often (call me stingy with ratings) but I will give credit where credit is due. What an incredible spot this is and I've been up here a few times and keep coming back for more! Yes , hands down its the best view of DT Cleveland but this place offers much more than just that. The food and cocktails are generous portions ,plenty of options for you beer snobs and a nice variety of wines for a nice day out on any roof top,I particularly enjoy getting the Ahi Tuna Tartar and the Steak tacos which by the way are also on the happy hour menu,  I've had my steak tacos a couple times with a beer brewed just for the hotel locally (bartenders tell me it's made a few miles away and only available at the hotel) , I'm no micro-brew beer snob but find that pretty cool and the beer is absolutely delicious !! To top it all off on the 12th floor (The lounge is on the 12th,Ha!) the service staff is just straight up friendly. I've sat at the bar and in one of their fancy couch sections (open seating BTW) and gotten serviced pretty quickly and by some very friendly people , I had heard some mixed reviews but my experience has been Spot-On the few visits I've had with friends for happy hour or late nights, they get to you quick, bring you great refreshing & delicious cocktails with a smile , Kudos to whoever is making those things happen ..I'm a huge fan! Highly recommended .", "cool": 0, "date": "2016-07-08", "funny": 0, "review_id": "VHlk-3qjeoed9F1vAXVcww", "business_id": "xnLNPkL7bbdhD842T4oPqg", "stars": 5, "user_id": "Pnyedcoi2k6YZ6TfwGOYGw", "useful": 1}, {"text": "OMG, I have a new love in my life and we met at Bistro La Bon!   Too bad we can only see each other on Sundays--but it's worth the wait.  Yes, I've been totally smitten with the chocolate waffles served at Sunday brunch.  This is not to diminish the  wonderfulness of the other items served, but this is like eating chocolate air further indulged with chocolate sauce and whipped cream.  I ate mine at the end of the meal as sort of a dessert, however, it's not nearly as sweet as it sounds,.\n\nOther items I found delectable were the Swedish Meatballs, the Mozzarella Pinwheels and the Silver Dollar Biscuits.  There was a great selection of items on the buffet with plenty of options for vegetarians as well.  \n\nI'll definitely return for a rendezvous with my new love!  I'll make a reservation next time--I was lucky to get a table right at noon without one this time.  As it grows in popularity, which I'm sure it will,  reservations will be a must at prime time.  Luckily they do serve until 3 pm for those who might want to dine when it's less crowded.", "cool": 1, "date": "2010-07-26", "funny": 1, "review_id": "Ig-CQD0ZKrlMNIflEfsJMw", "business_id": "jXHmmircEbhQmZjWDR1xIA", "stars": 4, "user_id": "-jqjlvvIJNnLYhpb4ovDUQ", "useful": 3}, {"text": "I haven't cut my hair in 12+ years and was nervous about how my drastic makeover was going to turn out, but the staff made me feel so comfortable from the moment I stepped in the salon. Excellent hospitality all around and my hairdresser had a great vibe to her. She answered all my insecure haircut questions professionally and with humor! Would recommend this salon to all my friends. Thank you, Hannah, for the great haircut and for the wonderful salon experience.", "cool": 0, "date": "2017-06-23", "funny": 0, "review_id": "29GRv1JxeJQil-pBlEKmbw", "business_id": "5qc1Xv36E36DF6zCBG51Cw", "stars": 5, "user_id": "YWWV3U6URAw4zrHET0ReBA", "useful": 0}, {"text": "I was so pleased of the environment and service.The quality of the food is so good.\n\nI seriously recommend this place if u want real south indian flavour .", "cool": 1, "date": "2014-08-10", "funny": 0, "review_id": "JTYalRBrz0QkZPxsNc9A3g", "business_id": "ebhkQpSusPpPgZLU1a_HxQ", "stars": 4, "user_id": "NaND5HsXbwQJQOjH2AtXIA", "useful": 1}, {"text": "We have been going there for over 2 years.  My girls only do the recreational program but they have something for girls and boys from ages 3 & up. They have a competitive team and another program that some of my friends' children have been invited to join as a fast track to preparing for competitive gymnastics. My girls have had positive coaches and lots of fun.  I like that they see the team practicing when they are there so they can see what dedication and talent those girls have. I also like that they have several levels that your child moves up so they feel a sense of accomplishment.  Every few sessions they evaluate your child and the skills they have as mastered, still working or beginning.  I feel like kids can progress and the coaches are aware of when the kids are ready to do so. My girls have moved up 4 levels since we started.  When they are ready to move up, they do, they don't have to even wait for the next session.  Since we do recreational gymmastics, I feel it has been an excellent balance of conditioning , skills, and fun that keeps my girls looking forward to going to gymnastics for over 2 years now!  We had their birthday party there and it was great.  You can choose to go 1x, 2x or 3x a week to help fit your goals for your athlete. They also offer a free trial class!", "cool": 1, "date": "2012-09-30", "funny": 0, "review_id": "jb8Pdich6h3I_yf7FdHrCw", "business_id": "3SAFbn21EiQwH6a2L62wyQ", "stars": 5, "user_id": "e7NvUKk5ofaI4e9aGPMwgA", "useful": 14}, {"text": "Ive been to Vegas buffets many time, but this was by far my most disappointing experience ever! All of us got sick!!!'The staff was lazy (wrong drinks and only 1 refill and dirty plates everywhere) ) and food was terrible ( meat was overcooked or raw and chewy and other food was flavorless and sloppy, sushi was spoiled, gelato was grainy and had ice in it from melting and refreezing, cookies were stale, salads were wilted) poor, substandard quality. It cost over $270 for 4 of us so we were expecting good food and service, I had a much better buffet experience at the Rio or Aria for less money...", "cool": 0, "date": "2017-08-27", "funny": 1, "review_id": "a1jzZRTZwee8NJSEiERbZw", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 1, "user_id": "kvl44_FD2SUrLrkUjMFuQw", "useful": 0}, {"text": "I have never in my life left the doctors office crying until I entered legacy urgent care. I went there for severe back pain. My first visit I was given medication, X-ray was done and had to get a MRI done. Three days after my first visit I went back in because the medication wasn't working.. When I was asked what was wrong I would begin to explain and would be interrupted every time. I was not given the chance to finish. The doctor gave me stronger meds and sent me on my way. After I went for my MRI I went back into get my results. The doctor explained to me that in the MRI there was nothing really serious and that I should be alright. When I was asked if I was ready to go back to work I informed the doctor that I was still feeling pain. This is when I felt the Jekyll and Hyde situation happened. He went from happy to pissed and 1.5 seconds. He began to yell at me telling me I didn't want to go back to work and he refused to fill out any FMLA papers that I needed to hand into work. He filled out a form for me to get blood work done and told me that my job was in jeopardy and walked out of the room. Oh I should add he also got in my face while talking with a loud voice. I really didn't want to go back there but I was unsure if another doctor would release me for work if they didn't treat me. I went back to get my blood results and to see if he was willing to release me for work. My blood work came back and it showed that I had inflammation I don't know about you but I pretty much think that indicates I'm in pain. The doctor did a 360 and was once again kind. This time he did fill out my FMLA papers and I left there with the intentions of never going back. I did end up going to another doctor that a friend had recommended and brought my MRI results with me. The new doctor also did x-rays and discovered there was a problem. I am now on my way to getting therapy and proper medication. I rarely write reviews good or bad however this time I felt the need to inform anyone who has intentions on going to this location. I know the others have really good reviews and I'm sure their encounter with the doctor went well. Mine did in the beginning too. If you want to go to a doctor who never gives you A chance to explain what is going on with you then by all means this is a doctor for you I wish you luck.", "cool": 1, "date": "2015-04-15", "funny": 1, "review_id": "pnXwTl6_tr3Li5-8BDZQvw", "business_id": "aNickGLG7x7AR8EwiUXVtw", "stars": 1, "user_id": "bsv2CJx74UuEfc1FDW21Rg", "useful": 3}, {"text": "Attended this clinic for 2.5 years. Why did I fire Dr. De Los Santos? Why will I never go to this clinic again? \n\nIn a nutshell: severe incompetence of doctors, poorly run clinic, rude receptionists, the walk in doctors are inexperienced and unprofessional, Dr. De Los Santos is extremely rude and unhelpful and appointments are unnecessarily rushed or rescheduled. \n\nOut of a nutshell: see stories below\n\nI am 27. In pretty great health. Maybe I would wind up here once every 4-5 months for something over a 2 and a half year span. Here are the stories of some of my visits:\n\nMy experiences with their walk-in doctors:\n\n1) Me seeing young female doctor\nMe: \"I have this bump on the inside of my finger\"\nYoung female: \"it feels like a ganglion cyst, you can google that and look up some treatment options\" \nMe: \"I'm sorry, google it? \nYoung female: \"yes, there are videos on how to smash it with different objects, like a book.\" \nMe: \"I googled that before I came here and it is supposed to be dangerous\" \nYoung female: \"well, you could just wait to see if it goes away. There isn't really anything we do for it here.\" \n\n2) Me seeing middle-aged male doctor\nMe: \"So, I dropped a weight on my toe. Went to the hospital and they x-rayed and it's not broken but the swelling is so bad I can't even lower my foot, let alone put weight on it, because it feels like my toe is going to explode\" \nMale dr: \"you need physio therapy. My buddy works over across the hall. I'll set you up with him, he'll take care of you.\"\nMe: \"they said at the hospital that I would need a hole drilled in the nail to relieve pressure and that any family doctor could do it. That's why I came here.\"\nMale dr: \"no, physio is what you need\"\n\n(2 weeks of agony and very expensive physio later with this doctor's \"buddy\" my the skin around my toe starts blistering with blood pockets and I go to my physiotherapist appointment):\n\nPhysio guy: \"whoa...that's not good. I don't think I should treat you while it's like that, let me get my doctor friend to take a look\"\n(He brings in the same male doctor from my walk in appointment) \nMake dr: \"oh wow, you need to have a hole drilled in the nail to drain that\" \n\n(I lost the nail in my toe which could have been prevented by relieving the pressure early.)\n\n3) Me seeing a young male doctor:\nMe: \"I am pretty sure I have a yeast infection.\"\nYoung male: \"oh. Ok. Well...we can uh..well we can do a quick pap, I guess. Um.. Ya. Ok. Is that what you want? Does that..I mean, that's probably the best idea. \"\nMe: \"ya...ok\"\n\n(He pushed my thighs further apart instead of asking me to do it then did the usual stuff but then took out the speculum and put two fingers in my vagina and felt around like he was looking for my g-spot. I've had someone feel around for abnormalities, but this was like i was getting fingered. I have never had a pap that included that sort of nonsense. I have never felt more uncomfortable in my life.)\n\nSo...needless to say, I stopped going to the walk in. I thought I would stick with Dr. De Los Santos (my Family dr).\n\nThen came the referrals. Referrals for everything. Sometimes 5 minute rushed appointments and 1-3 referrals elsewhere, every time I went. I am in general good health by the way, just low iron and some allergies (hence all the blood tests). I have been rudely rushed out of my appointments and felt like I was an absolute inconvenience for being there.\n\nThen I made an appointment with De Los Santos to get results for allergy tests. The clinic is a 3 minute drive from my place down Strachan. (Silly to drive, I know, but it was a freezing day in winter). I left about 10 minutes early. (Always plenty of time). Then bam, I get behind a truck that is trying (and failing) to back up into a parking lot, blocking the whole street. It was taking forever so I called to let them know that I would be late possibly. The receptionist asked how long and I said, maybe 2 minutes, it won't be much. She said \"ok, that's fine.\" I park in an open spot and run in. Yay! I am only 1 minute late. I wait at reception for probably another minute (with one person in line in front of me and three people behind the desk, I might add). I finally hand them my health card and a nurse comes over and says, \"oh, Dr. De Los Santos has already taken another patient since you were late. You'll have to reschedule. If it's an emergency you can see a walk-in doctor.\" At this point it is 3 minutes past my appointment time. I was just livid. \n\nNever, ever, ever again will I go back there. I don't care if you can instantly heal the blind and make them see, no one has the right to treat people the way she does. And the other doctors there should still be under the supervision of someone who knows what they are doing.", "cool": 0, "date": "2014-07-21", "funny": 5, "review_id": "5GbXa7pk-Oq1mrqvGBe-Zw", "business_id": "jSm10odmxWoEs0l2CSqang", "stars": 1, "user_id": "KlNPKn3Y8pjyQvsS9zQuyg", "useful": 8}, {"text": "This place is awesome! great tasting juice & the employees are always nice & knowledgeable.", "cool": 0, "date": "2015-10-29", "funny": 0, "review_id": "h79Fwub9MERPJe339w6Wtw", "business_id": "aYfHXWNjLNUVoQa5CMA2jg", "stars": 5, "user_id": "hBmJs49zYcXdV4wo8F5iiA", "useful": 0}, {"text": "Paul says he's semi-retired, so I almost hate to review him, but he really was fantastic.  He understood the quirks of my old house and made some really good recommendations.  I called him on a Friday after I closed on my new house and he was able to come Saturday to change the locks and install a new combination lock.  He's a got a great dry wit on top of being good at his job.  I was really happy with his work and his service.", "cool": 0, "date": "2016-07-27", "funny": 0, "review_id": "4ghpp-bGvbNr4OfCsSJ-ng", "business_id": "OMNFQuk3DfAt2oesBiDgKw", "stars": 5, "user_id": "uWeAWWzKpOl6o7V-BdtUGg", "useful": 1}, {"text": "Great pitchers of magaritas and sangria.  Huge patio. Staff is friendly and competent.  Food is ok but not great.", "cool": 0, "date": "2016-08-09", "funny": 0, "review_id": "6F3SdErqgug6o0t9uDM8KQ", "business_id": "OACjhgf8nnYGzFnOhA7uhg", "stars": 4, "user_id": "uWeAWWzKpOl6o7V-BdtUGg", "useful": 0}, {"text": "Great food, great service. Ask for Kathy... She is the most personable and sweetest waitress I've ever met.", "cool": 0, "date": "2014-03-15", "funny": 0, "review_id": "QRhFuk3T8-ZQjmIPfo1KfQ", "business_id": "a1v8QIdbA_HTg_YyNlBY_w", "stars": 5, "user_id": "cbfivZddqFY3QBf3uZ-m8w", "useful": 0}, {"text": "I like this place because of a few reasons.... 1 the pizza is cheap and still maintains a pretty good quality. 2 the arcade games make me feel young again with old school ninja turtles and mortal combat. 3 great place to have a family meal because there is a kids room with tons of seating. I'm just surprised I've never been here before until recently.  Great place!", "cool": 0, "date": "2014-03-26", "funny": 0, "review_id": "rx1gg66gRCvQtDWrGa30MA", "business_id": "nrqN45BQyxDjXy2q3VdolA", "stars": 5, "user_id": "yaHS6znivcj08iK0Azi9fg", "useful": 0}, {"text": "I'm giving this location 2 stars! The lady at the front is not very welcoming! We came on a Monday morning it was not busy only 7 tables had people sitting at them. I asked the lady (she might be the owner she's always there) at the front if we could sit in one of the booths that were open. We had 3 adults and a 2 1/2 yr old. She said no you can sit at the table that's a half booth on the wall. I tried to explain I have a young child a booth is easier to contain her. I didn't want my daughter to be crawling all over people next to us! She said no and sat us at the half booth. Then she promptly sat a party of 2 in the booth I asked for right after seating us. \n\nThen they have these fake little trees on the table and my daughter was looking at it.  Now granted my daughter at one point was poking it with a fork which I missed because I was looking at the menu.  The same lady came over and ripped out of my daughters hand and said \" I'll take that!!! \". My daughter was so upset it made for a miserable time.  I wasn't going to let my daughter ruin a $5.00 fake tree from Michaels!!! \n\nFood at this location is lacking! The Gainey location is much better!! The only nice thing I can say about this location is the servers are always great and so are the mimosas!!\n\nMy point of this review is if you have small children don't go to this location and if you want better food food go to the Gainey Ranch location!", "cool": 0, "date": "2017-10-24", "funny": 0, "review_id": "kUeydH6ZA70K_O_n-unB3w", "business_id": "roR1_DDlMk7mhi5_R6XVKA", "stars": 2, "user_id": "nA78yTKKp8I7V34yC7HTVw", "useful": 1}, {"text": "Great place. Quality work. Super friendly staff. All seem very genuine, funny, accomodating, made me feel like I was at a friends place or something which I have never experienced in nail salon. Also, not trying to be politically incorrect or anything but couldn't help but notice they all spoke perfect English which I thought was pretty cool. Just all around really good experience.", "cool": 0, "date": "2015-05-04", "funny": 0, "review_id": "CqjU8B6tMtXyE50mRuRx2A", "business_id": "UYYJ-XXX9Ije_m9035A7nA", "stars": 5, "user_id": "rWsmIlUA961Gl6kZSZUvQg", "useful": 0}, {"text": "I have had the opportunity to stay at a few Omni properties around the world and this hotel in Charlotte is worn and truly subpar in both service and physical condition. The rooms are tired and outdated, not particularly clean and bathroom show signs of mildew, cracking in paint and tub caulking. During my 4 night stay I was surprised to see room service trays left out almost all day smelling up the halls. I had an urgent package sent overnight and the front desk never notified me of its arrival. It wasn't until the night of check in that they happened to notice it in the back under my name. This hotels location is ideal for central uptown CLT activities but it's in desperate need of renovation and front desk training.", "cool": 0, "date": "2016-04-16", "funny": 0, "review_id": "X2PdT71cQZh_jKrU3nO2Dg", "business_id": "IrHAhdmL9QH9g3NscAIsWA", "stars": 2, "user_id": "LOrhiD8zEpIWDMJMbR5riw", "useful": 0}, {"text": "Idk why they get such a high rated for such a dishes. maybe they never had real Japanese Italian. They smells very bad and most of dishes too salty. They might trying to sell drink thats why it was so salty....  some seafood also smelled and they are trying to kill refrigerator smell tp use extra garlic and pepper, but still smelled. \n\nWe had family came from Cali and we checke yelp that they wanted to try such a high rated Italian dishes. But it was just such a disappointment.", "cool": 0, "date": "2014-10-24", "funny": 1, "review_id": "qzhHwuTtUafyqkPIUvhlHA", "business_id": "6H8xfhoZ2IGa3eNiY5FqLA", "stars": 2, "user_id": "1w-pL71BflIk0Jo6Tj3cYg", "useful": 0}, {"text": "The Worst Nightclub in Las Vegas!\n\nSo, me and my friends got tickets to see Tiesto on Saturday we were so excited. We get inside the club (after waiting 1hr in a long a** line ) and we had to go through several flights of stairs to get to the main dance floor which had very little lighting, It was so dark that I ended tripped over and mind you I was sober, wearing flats. I started thinking about the girls who were wearing heels and were going up and down does stairs. I wonder how many injuries been reported from those stairs.  \n\nAnyways, once we reached the dance floor we headed to the bar, my friend ordered his drink and was charged  $18 per drink and not even tall glass more juice than greygoose !!  ridiculously overpriced. \n\nIn the dance floor we couldnt even dance this place was so over crowded people started pushing, elbowing and some even fighting so many out of control drunks with no security close by. I grew extremly concerned. \n\nAfter an hour in the crowd we couldnt take it anymore and we all decided to leave  find an empty space to just breath fresh air.  We couldnt find any . There were no exits!!! The exits were obstructed by the multitude of people, we couldnt get out of the maze of bodies. I became very anxious, i wanted nothing more than to leave i was so overwhelmed\n\nAs we were trying to make my way out I was harrassed, shoved, and punched, so were my friends.\nOne of my friends was asked if he had any drugs by this ratchet thirsty looking chick, wtf?!? \n\nsecurity sucks i was pushed and yelled at by one of them when i asked him for assistance to get out.  I was so livid. Any remains of fun from earlier that day were stripped down at this place . \n\nNever Again!", "cool": 0, "date": "2016-06-27", "funny": 0, "review_id": "7FL_XKdUksX5xDfJabAWMg", "business_id": "X8c23dur0ll2D9XTu-I8Qg", "stars": 1, "user_id": "08bJ-GODWV__F2qCkms9CQ", "useful": 3}, {"text": "This a great place!  The wings and pizza are really good and at a fair price.  It's great for the family and it's close to home and they do a lot of fund raising  for the school.", "cool": 0, "date": "2015-09-23", "funny": 0, "review_id": "ebrlYsDF0Lhk1lJuXUE5rQ", "business_id": "yvJqxVTO_qwRGLMtUrqzQw", "stars": 4, "user_id": "uU_ol_n14rgh8kuuZ--WSQ", "useful": 1}, {"text": "It's a great place to eat but they took my favorite sandwich off the menu and I really  don't like the others and the last time I had the salad bar it was very disappointing  so I haven't been back and I used to go a lot", "cool": 0, "date": "2015-09-21", "funny": 0, "review_id": "HQuAMVpAvforgLnqRZf5rw", "business_id": "358UeNvBBE03JKX3u2FtLQ", "stars": 1, "user_id": "uU_ol_n14rgh8kuuZ--WSQ", "useful": 2}, {"text": "This was my second visit to Carnevino. My first, right after they opened, was my best dinner experience in 2008. I have to say that this last trip left a little to be desired. Some of the dishes, especially the pasta were amazing. The orchiette pasta with sausage and broccoli rabe and the black ink pasta with crab meat and jalapeño were fantastic. The prosciutto wrapped cheese puffs, which melted in your mouth the last time I visited were served luke warm and was very disappointing. The steak of course was very flavorful ~ and one serving for two was more than enough for four of us to share. \n\nThe biggest disappointment and the reason why they are only getting three start for this trip was the service. It took us about 1/2 an hour to get a bottle of wine... and the service for the remainder of the meal was mediocre.\n\nI would try Carnevino again, but I would try it for lunch, sit at the bar, and only order cocktails and pasta....", "cool": 0, "date": "2009-04-26", "funny": 0, "review_id": "-_RzTknPAYSuPvuWVd9F1w", "business_id": "7fxebHYUwIF6CakxSr70iQ", "stars": 3, "user_id": "uDgy4OGBVKef-_DLYceolQ", "useful": 0}, {"text": "Very health-conscious restaurant. I feel judged by all the residents because it literally resides in their basement but its a great switch up for breakfast if you ever get tired of fried eggs, bacon, and chicken fried steak. Kinda pricey but you pay for the quiet time.", "cool": 0, "date": "2011-01-26", "funny": 0, "review_id": "CTlvq5qrdK7P6bi_jDI1fw", "business_id": "xQtCOQIwrGIiDeHWVHdkBw", "stars": 3, "user_id": "3OY8rbQ6a6HFvYaFx1oTzA", "useful": 0}, {"text": "Ordered the High priestess combo which rang in at about $15. Now, as much I enjoyed the burger I can't justify eating here more than once or twice a month, way too expensive . I went simple to see if the burgers reflected the hype they were receiving. \nWith the lines sometimes going out the door the seating was sparse, and uncomfortable. Maybe a hint that they needed you to eat and move it along .\nI would recommend you try burger priest and check out the secret menus online.", "cool": 0, "date": "2013-12-17", "funny": 0, "review_id": "GE0Q9TG39DgxcxeuO4FOlw", "business_id": "YJ05ntGlszxACOD5zn1YjA", "stars": 3, "user_id": "2Opml_jGfYyy3XjtdJXhZA", "useful": 0}, {"text": "So far not so good.  The appointment was at 4.:00 PM and we were 15 minutes early.  Did the questionnaire and had the blood pressure done about 20 minutes after we got here. It has now been an 1 hour and 35 minutes and still no doctor. The staff is nice but that only goes so far.  If you can't see your patients in a timely manner you should do one of two things,  a: hire more staff or b: make less appointments.", "cool": 0, "date": "2016-03-23", "funny": 0, "review_id": "iKZgXCg_EoXUvLZs_VWITA", "business_id": "Kg3BfZdGuMkM1LBgi1e79g", "stars": 2, "user_id": "I66RdvP7MUxfWyJScTfIqA", "useful": 2}, {"text": "I'm in love with their Tosta Mista sandwich. The coffee is great and the servers have always been sweet, attentive, and pleasant. I have nothing but happy thoughts when I think of this place. I wish we had one of these bakeries in Brampton, but it's totally worth the drive.", "cool": 0, "date": "2015-11-04", "funny": 0, "review_id": "vNl9gXYakEkQ71kk_QAJqw", "business_id": "kmMx1em0IDc6zb7hqJctvw", "stars": 5, "user_id": "ch5ICy4Pc3ZVYRE7JdoXew", "useful": 0}, {"text": "Our company recently had some work done here - due to the close proximity of where we were working.  We later had to have some additional work done and took it to our local service station.  We found out that the work we had paid considerable money for (nearly $2,000) had been done faulty.  We called them to discuss with them, and they promptly hung up on us. Do not under any circumstances use this company - unless of course you like to spend good money for nothing!!", "cool": 0, "date": "2014-10-14", "funny": 1, "review_id": "qn21eaPerfWs18XWqmq9dQ", "business_id": "WbjfPBLko5z1-OFWQ-jDsQ", "stars": 1, "user_id": "SYeKgz4SoWz_YFTvWPamvQ", "useful": 2}, {"text": "The food was amazing, I had the breakfast sandwich. I'll come back just to get this again. The service, though, was really bad. The waiter never stopped by and the food took forever.", "cool": 0, "date": "2012-06-30", "funny": 0, "review_id": "RT-KNKBQ6nYJStJPZCa8ig", "business_id": "1ThbwFVBL9YA2oOM11iO7g", "stars": 3, "user_id": "Uo-pgxV4JsiEwdSEVs4l2A", "useful": 0}, {"text": "Once upon a time, I was in love with Hobby Lobby. I bought my crafting supplies and my home decorating miscellanea here... couldn't wait to get my hands on the ad each week. But that was years ago, and these days I almost always walk out empty handed, even if I walk in armed with a list and a coupon. \n\nFirst... I get the whole vintage/but not vintage look... today's version of shabby chic... but when your rustic finish is chipped and shows the plastic base... you are just selling crap. And that is almost entirely what they sell - poorly made, over-priced junk. \n\nSecond... the staff, omg, the staff is not good at their jobs. Unless their jobs are to move slowly, say \"uhhh I don't know\" and turn away, and not respond to anything else you say... because if that's what they were hired to do then they are just fine. They are also good at blocking aisles and not moving when you say \"excuse me\" - or if you are standing looking at something, they are very good at stocking the shelf in front of you, without saying a word. \n\nThird... so the company has Christian values. Fine. But they seem to pick and choose which values they are going to go along with... paying people poor wages, not training them properly, selling low quality products, selling low quality products made in sweatshops by more people who are being paid an even lower wage... these are not Christian values.\n\nFourth... the final straw for me: There was a pretty decent line at the registers, and the lone cashier was calling different areas to get someone to open another line - good, right? Well, she paged the framing dept. and this apparently angered the useless manager who was standing watching her, and the mgr. proceeded to berate her in front of everyone, telling her that the framing dept has better things to do than work at the front registers. Are you kidding me? An employee tries to provide good service so you yell at her in front of everyone? I put my items down and left.\n\nSorry HL, I tried... but I am over you.", "cool": 5, "date": "2014-01-18", "funny": 4, "review_id": "zyPg8ZpvvZChuw9dW6L36g", "business_id": "Giw0OL-ey7MqysdAVdkhfg", "stars": 1, "user_id": "jcaLhEuPvyFoQal4qQA2mg", "useful": 16}, {"text": "Haven't went out for dessert for quite awhile and me and some friends happened to drop by this place for some amazing desserts after dinner. Love the crepes here! My husband likes the ambience. There are lots of pictures and special lighting fixture. We ordered a green tea cheese cake, 3 crepes and they are wonderful! Will def come back again!", "cool": 0, "date": "2016-05-22", "funny": 0, "review_id": "YoOxvKbMOmetvtkBun6wxw", "business_id": "FnQ-_pGdw11za0LQ_aORxQ", "stars": 5, "user_id": "C08C4I0AmpL_110BJsxOVQ", "useful": 0}, {"text": "Service was great. Owners were exceptionally polite even on Black Friday. They have a but two medium for $8 deal going on rn and the quality of their drinks is decent! \n\nDefinitely my go to for bubble tea when at Markville \n\nWent back in late December but this time for their classic panda drink they substituted the white tapioca for the small clear beads you get in Asian desserts which just really didn't do it for me :/", "cool": 1, "date": "2016-01-07", "funny": 1, "review_id": "lHr5-NZwCAlaKQ-MInSlRg", "business_id": "qikNjb3CE2KHWIcxRpovgQ", "stars": 2, "user_id": "FNyEz_Tx1EBFqIn0s-7kVw", "useful": 1}, {"text": "Camelback was great in every way -- prompt response on initial quote, a moving team that handled our goods with speed and great care, and no surprises on the invoice at the end!\n\nI wish I had used them to load in Indiana and will definitely use them again.  Hands down the best local movers I've used.", "cool": 0, "date": "2014-08-23", "funny": 1, "review_id": "Baok1OkBArGz44Al7ulsyw", "business_id": "jeTvVMOR8W_04xFsPjzOEQ", "stars": 5, "user_id": "VCtDuVSom8I0MaRklBxycg", "useful": 0}, {"text": "I love this store it has perfect gifts for every occasion.  I love Miriam she is an A plus service employee.", "cool": 0, "date": "2015-03-04", "funny": 0, "review_id": "zGL3hJ7LSCnwYWG2hON-UQ", "business_id": "ZYJ8qFc3I-UbSIOii2HW0g", "stars": 5, "user_id": "vjxvq-nTwe2deDk0vpOKfw", "useful": 0}, {"text": "Looked promising at first glance, but horrible in the end. Dry meatballs. Clueless sommelier. Filled with people from Woodbridge. Very strange for a place on the Dundas strip. Avoid!", "cool": 0, "date": "2014-09-27", "funny": 0, "review_id": "7EjBgd3L1enP0tIQuU0yRQ", "business_id": "JG26f5Ppxvmz1EP6nh2WkQ", "stars": 1, "user_id": "7u9Gz1g5YKunZDuWqw7O8g", "useful": 2}, {"text": "My husband and I went here for lunch during the week and it was terrible. The portions are small, the service is well below average and the food was not good. We ordered the pulled pork sandwich , and it was extremely dry. The burger was ok, but the fries were burned and salty.  Never Again!", "cool": 0, "date": "2011-06-30", "funny": 0, "review_id": "96LYvLt_uL779-3IqubVdA", "business_id": "Yp1swb-8pO8i-6-jaK2tsA", "stars": 1, "user_id": "TtV527nQhO9ziCMEIhGEKg", "useful": 0}, {"text": "Most of the reviews of Vesta Lunch, the good ones and the bad ones, are right.  It's a 24 hour, seven days a week greasy spoon with all the pluses and minuses such places have.  If you're lucky, however, George Golias will be the cook behind the counter and he's a fascinating fellow, a 73 year old Czech who has been in Canada for forty or so years, speaks, reads and writes ten languages including Japanese, Arabic, Greek, and Russian to name a few.  A one hour documentary movie (The Night Cook) was made about him in 2011 and has aired at least eight times on TV Ontario.  He'll make you a good breakfast and entertain you, if you ask, with stories of his life.  The place is worth a visit if George is there!", "cool": 0, "date": "2012-12-06", "funny": 0, "review_id": "8a2s4dvQa6AWPmyfY-48vQ", "business_id": "_CLE-gHZLhj6mDl3QrdSwg", "stars": 3, "user_id": "LVh0eKMnU5izTNDjVbWdnw", "useful": 4}, {"text": "They sold to me their product with tricky information. \nThey told to me that I'll have life warranty but they didn't mentioned that this warranty is only for once device from the receipt,  not for other devices.", "cool": 0, "date": "2015-01-14", "funny": 0, "review_id": "qe_3BsF2zoB-fwDgW-L3xg", "business_id": "25lVJgvthMyvoRz-W6splw", "stars": 1, "user_id": "Y1s-coMhkVpPjMd-Q5e7vw", "useful": 0}, {"text": "WARNING! Although Yelp states it's open. The restaurant portion of this supermarket is Closed on Saturdays and Sundays", "cool": 0, "date": "2016-08-06", "funny": 0, "review_id": "KAbkTxMemKu1ghJh9rnVWA", "business_id": "zYbEKtLeosxhTzF4zSRIyA", "stars": 5, "user_id": "WcXwN-Q7UEVDEJmi_ArAQw", "useful": 2}, {"text": "So slow. I keep thinking that it will get better with this team, but NO!!! Months of poor management and organization. So frustrating. No sense of urgency when it comes to making orders. The most basic orders take forever...UNREAL. Hands down one of the WORST and MISMANAGED Starbucks I've ever been to. Someone with a clue please come and manage this train wreck of a location. They are not even busy...now. I get waiting a bit when they are.", "cool": 0, "date": "2017-09-14", "funny": 0, "review_id": "SxnyDeqZD-7vE4GihdFimA", "business_id": "GG9VcABDC1hDFnjVi6q5Fw", "stars": 1, "user_id": "LGKVwyWuZ6-mmj-kLsFiew", "useful": 0}, {"text": "LOVE this restaurant. My family has been going to the downtown location for a long long long time. We couldn't be happier when we knew they have a second location at Bayview Village, since it's our favourite mall and it's closer to our home. The food and the service are excellent. We go there almost every Sunday; sometimes for Dim Sum, sometimes for dinner. \n\nIt's suprised to see they were temporarily closed due to some health issue few weeks ago. I checked their inspection history on DineSafe. They got a green on April 7, and about a month later, they got a red. How bad things would go in just a month? Since we shop around the mall quite often, we know the managers in all the restaurants quite well. Pearl's managers as well of course. \n\nThey told me because the Public Health Department received a complaint from just one customer, saying she didn't feel well after eating at Pearl. There are a lot of reasons to cause one person felt sick. I hope the Health Department checked all the restaurants that she went to on those days. \n\nIt seems to me maybe the inspector thought it's a slap in his face that he passed the restaurant not long ago, and then someone felt sick after eaten there. One of the owners of Aroma espresso bar said they got a yellow one month after their opening. That's quite funny to me. How unsanitized they can get for a month?\n\nI believe in Bayview Village and Pearl. As the upscale shopping mall in North York, Bayview Village won't allow any restaurant to put customers' health in risk. They must have their professional cleaning and pest control team to ensure the great health conditions. As for Pearl, they had been in the industry for so many years. I think they know about what sanitized environment means. They wouldn't risk customers' health like that. \n\nJust saying.....", "cool": 0, "date": "2014-06-11", "funny": 0, "review_id": "hSKqAuqK2Luop1xJDxILjA", "business_id": "dVMP0_oELc7hf77NYCgudg", "stars": 4, "user_id": "4V-FdDxOo1lHiv3zFDcy-A", "useful": 2}, {"text": "Love Bianca!!!! Been getting my lashes done with her for 2 years now and I'm always happy with my gorgeous lashes . I'm seriously addicted to them !!! Don't go to anyone else!! EVER !", "cool": 0, "date": "2017-03-11", "funny": 0, "review_id": "2tnoacf89FI2qVlKaEMSbQ", "business_id": "qharoRpIxEun9X_8OT_jbg", "stars": 5, "user_id": "m6JxkhliWluXyzktsnMqwg", "useful": 0}, {"text": "If I could give zero stars I would! This is the most horribly slow drive thru I have ever  been in. You can guarantee that I will NEVER BE back. The food was below average and the fries were cold. 15.00 got me the following: a 40 minute wait in the drive thru,  a cranky toddler, cold fries , and a drink that was filled to the top with ice and no fruit punch. Never, Ever Again!", "cool": 0, "date": "2016-02-24", "funny": 1, "review_id": "7A0YzyAyrP6CCgFKMZ6-OA", "business_id": "9Lu2VvdAPswV-RRiQFfXXQ", "stars": 1, "user_id": "17KObD74hqrluv2TzXnF1Q", "useful": 1}, {"text": "I've now ordered from the Painted Pretzel twice. I live in Florida and both times the products shipped quickly and the first order tasted great (still waiting on the second one to arrive). \n\nWhen reading the reviews I was confused because when I contacted customer service after the first order (to tell them I wanted it delivered on a certain date) they got back to me quickly and were able to do that for me. I think when they appear on Shark Tank they have issues keeping up with the volume of orders.  Most companies have issues when the episode airs/re-airs. Don't judge them so quickly try ordering again when the episode hasn't aired you won't be disappointed. \n\n My most recent order was placed Saturday, Feb 13th, I received the shipping information on Wednesday Feb 17th and it will be arriving Friday Feb 19th.", "cool": 0, "date": "2016-02-18", "funny": 0, "review_id": "f_zbmVyO_O2YjkH-Kk--HQ", "business_id": "GHLCTktW4li1QpWJMoDyEw", "stars": 5, "user_id": "9bmEulLg5qtFe72-6SZvAA", "useful": 1}, {"text": "I have been going to the Beehive since I was in high school, but it's not where I would go for a cup of coffee. The atmosphere is creative, but I find the staff to be a bit pretentious and the coffee to be mediocre. The crowd that usually ends up here are the ultra so hip so indie so hipster so unique and different and therefore better than you. The kind of folk that are more interested on the paintings on the wall and the cool layout than actually enjoying a quality cup of coffee and a friendly staff. \n\nI must say the place has a cool layout. There are swings inside and they have a large space, which is good compared to the typical small coffee shop. \n\nWifi isn't free, so get that out of your mind. That being said, if you're trying to actually accomplish something, I wouldn't go to the beehive because the crowd is pretty young and has a tendency to be distracting. There are other coffee shops in the South Side that offer a better experience.", "cool": 0, "date": "2010-04-06", "funny": 0, "review_id": "p1xwwC6iVqxeHS-0DrjxvQ", "business_id": "5h7ra0kJKswSZEzbFSIpaw", "stars": 2, "user_id": "yahPcmffLfJawrtjTqKzdQ", "useful": 1}, {"text": "With every visit to Vegas, there is a visit to Il Mulino.  This is my favorite Italian restaurant of all time.  Italian food is my favorite.  This is more than great food.  It is truly a dining experience.  Table 54 is my favorite spot in the dining room as you get a panoramic view of the entire restaurant.  There isn't even a need to order appetizers because they serve so many little appetizers, all included with your meal.  Amazing cheese, bread, etc.  Fantastic wine list and very knowledgable bartenders.  Everything I have had from here is amazing.  I always get a pasta dish with bolognese and it is consistently amazing.   I make it a point to try everything else that those I am with get.  Haven't ever been disappointed.  I wish there was and Il Mulino in L.A.!  Highly recommend Il Mulino @ the Forum Shops in Vegas.", "cool": 0, "date": "2013-05-24", "funny": 0, "review_id": "r9nmiptaCeXBCayfZoB4Rg", "business_id": "8yiLVWzJyyTEhYE0fVNvlA", "stars": 5, "user_id": "yEX2mk_BS_7ZgW7nEgGxxw", "useful": 0}, {"text": "I've only been here once but it was a great experience. First; the view of Pittsburgh is amazing! I had the Veggie Strudel and I thought it was amazing! The only reason I'm giving it 4/5 instead of 5/5 is that I wish they had more of a mixed drink menu; its really  just wine. We had to ask them to make a certain drink but they were happy to do it. If they make a mixed drink menu, I think they would attract more people. The server was nice, kind of quiet, but nice. I recommend everyone going here!", "cool": 0, "date": "2014-08-24", "funny": 0, "review_id": "EEQNazde-w_spkfSrVTbtw", "business_id": "X-aqEYlXcWQj0fp6aGDP8A", "stars": 4, "user_id": "iIp-OgJfp7l2k0DX6X4dbg", "useful": 0}, {"text": "We specifically chose this place to file our taxes as a married couple because they said repeatedly over the phone I won't have to mail my original ID (I need it for travel). We verified it with them several times and they acknowledged REPEATEDLY that they would be able to certify a copy so that I didn't have to mail the original. Yet, when we came by for our appointment they told us I would have to send the original and they can't certify a copy. So basically they're saying they're gonna charge $150 to mail an envelope. Thank you, we can do that ourselves. What exactly are they getting paid for? And why say they can certify a copy of my ID over the phone several times when they can't actually do that? Thanks for wasting our time.", "cool": 5, "date": "2015-04-08", "funny": 12, "review_id": "Spq6LR6s5oS8WHKx3vGP6A", "business_id": "E5GnSqLpuPTKCChnZmD7ag", "stars": 1, "user_id": "kwV24XuUKN5ncelesciW-A", "useful": 12}, {"text": "What I liked best about working with Asia is how comfortable she made me feel and how patient she was with my questions.  I feel like it wasn't just hiring some one to do my make-up, but it was like having a private lesson on how to apply it myself.", "cool": 2, "date": "2013-01-15", "funny": 0, "review_id": "mLlWHrCblqqIOv1KqDdNtA", "business_id": "HnF3g_mSAVW-z8lWWSnL1Q", "stars": 5, "user_id": "YmYHav4gI7DSIGVlO0Zs2w", "useful": 5}, {"text": "An hour and a half to serve four people mediocre food? I think not. The mole sauce was delicious, but just putting chicken wings to swim in it on your plate does not make it suitable. The chimis were less than good, with absolutely NO seasonings for the meat. It should have been delicious, but honestly it was a let down. The food was mediocre (if not lacking) and the service was awful. Service was slow to pick up after people left, never asked if we wanted refills (after an hour and a half! really?) and honestly needed work. Along with all of the food. Only a few chips and out of the bottle salsa for starters? No thanks. \n\nNext time, I'll just drive all the way to Phoenix for some Mi Patio! Honestly, the only thing worth the money is the menudo. I won't be going back here again.", "cool": 0, "date": "2013-11-03", "funny": 1, "review_id": "n5rDMemANstnfJzG58CjMg", "business_id": "KK7-mHecrlhTIXxW1eATEw", "stars": 2, "user_id": "MbnMkMnz30hO5zxVQ-7mLw", "useful": 3}, {"text": "I took my truck to a different company that my insurance company recommended and they totally messed it up. They broke things and did a terrible job. Then i took it to John at east valley collision and he did a great job. Fixed everything the other company messed up and repainted the whole truck. I can not recommend them enough. Great work great service. I can't stop staring at my truck. It looks better than new!! Thanks John and the team at East Valley Collision!  I love my NEW truck!!", "cool": 0, "date": "2015-10-04", "funny": 0, "review_id": "vPPhsx0QeQaIKw-vdtR92Q", "business_id": "wSyzTB_kznAYBTi_mbD44g", "stars": 5, "user_id": "1mrqYp0jpwNQqi9d8MZb5w", "useful": 0}, {"text": "After reading a number of negative reviews about the Palms I thought I would add my experience with a recent 4 day stay. We were upgraded upon check-in to a junior suite because the superior king we had booked was not available and the room was amazing, unbelievable views and quiet. The package included a bottle of liquor, 2 buffets and $20 drink voucher/day and everything was as advertised and the frozen margaritas at the bar were the best. Every one was friendly and efficient especially the Valet parking. We were a little older than the regular crowd but that presented no problems and only added to the ambience because the people watching was great. If you have a car the location is excellent with easy access to the freeway and presented no problems. All and all a terrific trip and I will stay there again.", "cool": 0, "date": "2011-08-24", "funny": 0, "review_id": "gRtNZL9rWNyW2FM9RY1HUQ", "business_id": "ajoqEHnCZTD8-8GqGLq9-Q", "stars": 4, "user_id": "b8WyqgLOX-tTklLjLDsd5g", "useful": 0}, {"text": "We stayed at Luxor for four nights. The check in line was long, but moved fairly quickly. We were offered a room upgrade for a small fee, so we upgraded to a Pyramid Suite on the 17th floor. That was the highlight of our entire stay. \n\nWe got to our room to discover a dank, gloomy room that smelled of stale cigarettes and mold and mildew. The air conditioning was insufficient and the room never cooled down. There was even a flyer placed in our room advising us to keep the curtains closed to keep the room cool. I thought that is what AC is for. We had a nice view, but couldn't enjoy it because the room heated up too much. Also, the furniture was uncomfortable and the bed was extremely hard. Sleeping on concrete would probably be more comfortable. \n\nThe air handling system on the casino floor was poor. Every location in the casino smelled like you were at a cigarette smokers convention. Even the restaurants reeked of smoke. \n\nThis place is in serious need of a remodel. Another Yelper posted a photo of the pyramid suite from 10 years ago and the only change to the room was a new bedspread. The furniture and lamps were identical. \n\nThe only reason for a 2 star rating was because every staff member I encountered was extremely friendly and helpful. Unfortunately, I will not be back. There are far superior locations that aren't that much more expensive.", "cool": 0, "date": "2016-06-17", "funny": 0, "review_id": "KWcMvgdP1yoG6xXhjk54PQ", "business_id": "AV6weBrZFFBfRGCbcRGO4g", "stars": 2, "user_id": "msb3mhHGmN9gobdDmIFdbg", "useful": 1}, {"text": "What can I say except that this place is awesome! I've been shopping here several times a month for about 3 years and consistently receive excellent customer service from all employees.\n\nThe fabric selection is fantastic and you can't beat the prices. They have a huge selection of upholstery fabrics starting at $3.00 a yard.....that's almost free! All of the fabric samples are nicely arranged on the wall by type and color, making it easy to find just what you need.  They also have leather, vinyl, foam, outdoor fabrics, thread, zippers, wooden furniture legs, feather pillow inserts, gobs of fringe, beaded trim and tassels just to name a few things. The list goes on and on.  It's a fun, friendly atmosphere and you never know what you'll find. I never leave empty handed and I'm always thrilled with the smokin deals!", "cool": 1, "date": "2015-08-01", "funny": 0, "review_id": "ElOZE1FUOIfSEl8RwD2fcw", "business_id": "fU5wuLXc0U6KQgCCGczRCQ", "stars": 5, "user_id": "QJZkC4R1VgUFuoPP6dYULA", "useful": 5}, {"text": "Best cookie place in champaign, especially when you want something sweet late at night.", "cool": 0, "date": "2011-04-29", "funny": 0, "review_id": "8Sn78b_HSROhkGW43acPzA", "business_id": "4OuEWZHLRISfdfoz_DOZIw", "stars": 4, "user_id": "uh2DXG80jJ7gxDTWi-2Q3Q", "useful": 0}, {"text": "An absolute ripoff.  They jackup their prices expecting you to us a coupon.  Never seen such a scam.  I would suggest avoiding this chain.", "cool": 0, "date": "2016-07-09", "funny": 0, "review_id": "xwmpgtN4YGFwoiaMIJqB4g", "business_id": "FcegSvNZer-YZ9t8dMwe5A", "stars": 1, "user_id": "c6JVY6-PctJqI6ZGloGPSg", "useful": 1}, {"text": "The best Indian food I've had in Toronto. Best service, too. Love their chicken masala, and chicken vindaloo that's the hottest but most satisfying dish I have enjoyed here. Can't wait to go back... For the umpteenth time. Oh, I forgot, Indian beer complements all the great dishes.", "cool": 0, "date": "2015-06-21", "funny": 0, "review_id": "E2XNb9xy9cgfyHHL4fZX9w", "business_id": "PxH02Eu2Z4MUycBLU80D8g", "stars": 5, "user_id": "seyapo-LpcaF8745xEKtRw", "useful": 0}, {"text": "I'm very pleased with my experience at 3 Guys. They're very easy to schedule with, and have been very helpful with my many vision needs and questions. I was happy that the optometrist was able to refract me to 20/20 vision, as many optometrists before have not been able to.", "cool": 0, "date": "2015-01-13", "funny": 0, "review_id": "vodivmPkSNHBrLxaDHxv4A", "business_id": "UyF7JnYrECL38R4Nn38cDw", "stars": 4, "user_id": "HAbASizzsq-Z26CbdTpbpQ", "useful": 1}, {"text": "Overall very good steak. We had a party of 5 no complaints. Wait staff looked a little too busy to provide the service level I would have expected.", "cool": 0, "date": "2013-08-13", "funny": 0, "review_id": "6Wm1hPOXvULorTGIUiaKuA", "business_id": "7ODXq--HE7QpzvWwgk5rMA", "stars": 4, "user_id": "5XXs5j1MhHtxYalTLpV7iw", "useful": 0}, {"text": "This place is the best hot table in Vaughan !  The lunches real good. They change the menu daily and every is fresh. The 3 brothers that run the place are great guys and go out of their way to please.", "cool": 0, "date": "2016-02-19", "funny": 0, "review_id": "6-PbDlvgTkImFtLHeNinpw", "business_id": "JgqK9aby6pM9YnEJyimc4A", "stars": 5, "user_id": "5XXs5j1MhHtxYalTLpV7iw", "useful": 0}, {"text": "Zen, my biggest fear has come true.\nI have been a regular at Zen Scarborough for over ten years.  I tried the new Markham location recently.\nThe restaurant appears to be very nice when you arrive however inside the atmosphere feels very cold and sterile. It is not quaint or inviting and does not make you want to talk to your neighbors like the old place did. The service is extremely slow and there is nothing to look at while you're waiting. At the old location you could look at the fish display cases and ponder what you would order next or discuss with other people at the counter things they have tried. \nI ordered Omakase set one. This $85 dinner includes one appetizer, sushi dinner and a dessert.\nWe arrived at 6:30 and left the restaurant at 10:15!\nThe service was extremely slow there was some times as long as a 15 minute wait in between pieces of sushi.  My overall feeling of the new Zen is that it is now extremely expensive for the service and for what you get. I was very disappointed with the appetizer and the desert. I was under the impression they had a professional Japanese chef in the kitchen but did not see his talents come through that night.\nThe lack of alcohol possibly had something to do with the long wait as well, green tea just wasn't cutting it. I may try it again but not in the near future.", "cool": 0, "date": "2015-06-17", "funny": 1, "review_id": "JfPs5c0-_aHrafnSDrR2sg", "business_id": "Hk1Q874UqawFXq0XzIIBYg", "stars": 2, "user_id": "Phn8NLoCW9QLGYJ9Fr38Mg", "useful": 4}, {"text": "There rooms smell like wet dog i seen someone overdose on the stairs theres no way to get into the front desk  the whole staff is rude theres nothing i can say good about this location don't even waste your money to stay with there one night there Wi-Fi sucks and the complimentary breakfast is just cakes and coffee never have i stood in such a slum in my entire life  bad bad bad", "cool": 0, "date": "2014-10-21", "funny": 1, "review_id": "rFURjqfOVPM4mlVJHFPhHQ", "business_id": "de48Zmda7m_B8bSY6jXIRg", "stars": 1, "user_id": "TxE0LwN75nxjl8ZLnkBe5w", "useful": 0}, {"text": "If you are looking for value and you can sleep with a lot of noise this may work out better for you.  This was a Priceline deal that looked too good to be true. \n\nFriendly and helpful staff. Neighborhood looks sketchy. Clean rooms and comfortable bed.\n\nThe problem was noise. Located on an extremely busy road and near a train tracks AND in a flight zone. Many military jets flying over. Was truly a nightmare for me.", "cool": 0, "date": "2015-07-23", "funny": 0, "review_id": "2JjA20I_HPDXns2qZ_IoZA", "business_id": "6YrO-hJNof4wsx4f0YQ8yg", "stars": 2, "user_id": "7_Pn7OaaeHkZDGwMC-iZaA", "useful": 0}, {"text": "We were in Vegas this past weekend on a family get away.  We watch Gordon on TV and we figured his restaurant had to be good given how he is a top chef.  So we came here and had burgers.  Well to say the least it was complete disappointment.  I had the truffle burger it was undercooked and they just tried to hard.  The ketchup was not even close to ketchup.  Both wife and kids were not impressed and not one of us finished our food.  Anyways good was overpriced and service was slow.  We could live with bad service, however, the food was lacking and Gordon's restaurant took something so basic as a burger and screwed it up trying to make it appear\"Hollywood\". Anyways save your self some time and money and get McDonalds.  Both are crap, but at least McDonald's won't let you down.  On the bright side TV has been great for Gordon's brand as we saw several restaurants with his name on it walking down the strip... Hope they are also not overhyped garbage for unsuspecting folks who believe what they see on tv.  Oh and at the end of the service they give you an iPad to review your service.  All questions are about the servers performance... Perhaps because they don't want feedback on how terrible their food is. What a let down!", "cool": 0, "date": "2016-04-10", "funny": 0, "review_id": "s9ocDjo7JBtJ1p9UjtxfGA", "business_id": "cYwJA2A6I12KNkm2rtXd5g", "stars": 2, "user_id": "sv9iapOU9KNn0JFZcbbpUw", "useful": 0}, {"text": "The best of the best of the best.  I told Tim how much furniture I was moving and he gave me an exact estimate. I have used other companies to move and they always gave a vague estimate that depended on time, and I got screwed every time. Tim's men are polite and put everything exactly where I asked, unpacked a few things that my disability prevented me from unpacking, and made the experience a good one. They hung padding in doorways to prevent damage. I saved big time using Tim's crew, and it was so much fun I even tipped the movers. I will tip them even more next time, the experience was great.", "cool": 0, "date": "2016-08-29", "funny": 0, "review_id": "XWyYopWzmbanloECxMyEHg", "business_id": "SFUcFXBobTXgrfR6tG_8Iw", "stars": 5, "user_id": "PeQNmHpFbd3DySidHZDfOw", "useful": 0}, {"text": "Only oysters I've had in Toronto were from Rodney's and these are definitely par for the course.\nThe fries are crazy good with their lime aioli, the steamed clams were killer with the broth, and of course all the oysters were fantastic.\nWe had to try their deep fried panko crust oysters, the Cascumpec Bay oysters from PEI, Beach Angel oysters from BC,Wiley Point oysters from Maine, La St.simon oysters from New Brunswick and Copps Island oysters from Conneticut.\nThey're all great but the Beach Angels were my favorite for sure.\nAll oysters come with a side of horseradish of course and a choice of a red wine vinegar base sauce, a traditional seafood sauce and a chipotle base sauce.\n\nI would say Oyster boy has better service than Rodney's, but I would say Rodney's has the better food. May just have to eat at both places back to back to properly compare, which I wouldnt mind at all.", "cool": 0, "date": "2015-05-10", "funny": 0, "review_id": "HlkK2KsU0femRNofP7l5eA", "business_id": "9GKi6rHN_0FRdcVahyIOXQ", "stars": 4, "user_id": "8zfso9J17J2PavWneLBzAw", "useful": 0}, {"text": "May be the best hard tacos in the city. Grand Electric has solid soft tacos but I find I always crave Wilbur more. Burritos are super fresh and better than Fat Bastard or Burrito Boyz by a long shot. \nThe carne asadas, chicken tingas, and bulgogis are stellar. The baja fish is a generous portion of fish. Everything just tastes very fresh and I've never had a bad experience there. Sometimes the wait can be a little long if you're eating there but I've never been there when its not busy. \nLove that you can grab as many dips and salsas you want at the salsa bar which is quite extensive. The pico de gallo is always a nice addition in my opinion. \nDon't be discouraged by how Americanized/Canadianized the logo and the building looks. Tastes pretty authentic Mexican to me...", "cool": 0, "date": "2017-08-26", "funny": 0, "review_id": "NInbLPbUUbottOQNiuoJUA", "business_id": "VRwT0pscR5vESCrAnUpNwQ", "stars": 4, "user_id": "8zfso9J17J2PavWneLBzAw", "useful": 0}, {"text": "I had a massage at Mozaic a few weeks ago and it was fantastic. Tina was my massage therapist. It was a wonderful experience from the moment I walked down the stairs through the big double doors and into the spa. The unique physical layout of the spa is very  calming as you walk through it. The lighting is very subdued, and the hallways are nice and spacious  which lends itself to the privacy you want with a spa experience.  The massage was probably one of the best I've had and the people were great.  Im going back for a 90 minute massage this week. SWEET! I would highly recommend it.", "cool": 2, "date": "2016-05-11", "funny": 0, "review_id": "QKmvySLK5At61kl_zKJqNQ", "business_id": "zMGhQqA1Hho808BuQr9I6A", "stars": 5, "user_id": "i4zxEUKMJkNfT1-zyPdHpQ", "useful": 1}, {"text": "I have been a customer of the Car Repair Company for 8 years now.  They've seen three of my cars for both maintenance work and for repairs, ranging from minor to major.\n\nThe owner has fair prices, ensures that his team thoroughly explains the problem found, gets permission before conducting repairs, and delivers when promised.\n\nEverytime I've been in to the shop, I've been treated as though I was family.  Today, they took it to a whole new level.  This morning my wife's car smelled like gasoline...they got me in without an appointment first thing....got the part...and repaired it, all within two hours.  That would have been great enough, but what took it to a whole new level?  The office manager was cooking up lunch while I was there...RIBEYE steaks of all things, for the team.  When they invited me to join for lunch, I thought they were kidding.  No way they said....and here I am stuffed after downing 14oz steak.  I'm still shaking my head in disbelief.\n\nCar Repair Co has a life-long customer.", "cool": 1, "date": "2010-09-03", "funny": 0, "review_id": "0YDphoFXHExfdiZbDeV3pg", "business_id": "flTZuP-Spp3IE69a3pkBlQ", "stars": 5, "user_id": "UGA2XG3fpWIW19Jl6y_s-Q", "useful": 1}, {"text": "What a great place!  The atmosphere is wonderful, very casual yet professional.  Nice bar.  But above all, the salmon is fabulous.  The best salmon in town.  Maple lime sauce but so delicate. MMMMMM   Nice use of local organic foods.", "cool": 1, "date": "2011-04-22", "funny": 0, "review_id": "KfmtbgkjsqHc15fmHdgNVw", "business_id": "RPO5ISR18Xllgk9ahdPepA", "stars": 4, "user_id": "QBvqqhMXZOYttY0S2BQknw", "useful": 0}, {"text": "This is an amazing place for events/meetups/gatherings/live music and more!\nSuper artsy, with some great art to gaze at.\nOriginal, super unique and cozy!", "cool": 0, "date": "2013-10-31", "funny": 0, "review_id": "QHLmnYt1ppRd1Lw9gfxUFg", "business_id": "vDretNqzo-0yqQkV5wOvbg", "stars": 5, "user_id": "AHXy4uTg_L8VFXNRufLYdQ", "useful": 0}, {"text": "I recently got a car at Carmax, the  Sahara location. One of the Sr. Sales Consultant Mike, took very good care of me when I had trouble deciding on the best car for me. His knowledge of cars & patience with me help me take my time to pick the right car I would love. Good looking out Mike.", "cool": 0, "date": "2017-01-25", "funny": 0, "review_id": "mmYrXwAy5835wgfyJeUyWg", "business_id": "HxGBySw5WIapBu1M8WWcbw", "stars": 5, "user_id": "ftvJR_ibFsFoATlgB5PqwA", "useful": 0}, {"text": "I am here right now getting a pedicure and they are close to closing time.  I am so impressed with how much they are cleaning, sweeping and wiping everything down", "cool": 0, "date": "2015-11-22", "funny": 0, "review_id": "BNyzLfUx3OqjNu8kWEpwQA", "business_id": "Uh3NYhnjiLcD6lmj58v9nQ", "stars": 5, "user_id": "IPGM6CtG9MGuMZVTmJgdEw", "useful": 0}, {"text": "Great place, the staff are prompt and friendly, they have a great selection of craft beers and the food is off the hook. The Calamari Burger was one of the best things I've ever eaten. Prices are average (which can still be too expensive for me some of the time haha) and the clientele ranges from hipsters to business people. It's a casual place with no dress code but a HUGE step up from a lot of Danforth restaurants. \n\nMy only complaint is their seating. With two long cafeteria tables and one group table at the back you would think they have plenty of space, however on a busy night (Thursday, Friday, Saturday) it's impossible to be seated if you bring more than 4 people. My friends and I waited with a group of 9 for 45 minutes because they were \"waiting for the big table to open up\". Totally understandable, however, during that time they were seating smaller groups of 2-4. I feel as though they could have pushed a few tables together to accommodate us. We all had one drink at the bar then left for a larger establishment.", "cool": 0, "date": "2015-03-07", "funny": 0, "review_id": "N4dSl5custNgS_YZYbQNKw", "business_id": "UkoseRjoLT4K2bEzvmyhYA", "stars": 4, "user_id": "lS9cL1SdwjwVGYZ68jXbSQ", "useful": 0}, {"text": "I made reservations here for a birthday party, they were very accommodating to the 12 of us. The food was excellent and prompt as always and the service was fantastic! The waitresses/waiters that served us were super nice and the manager was just amazing. They even gave me a complementary brownie for my birthday. This is great place for a quiet dinner or a big party!", "cool": 0, "date": "2012-12-30", "funny": 0, "review_id": "7g_tlDaHb6y-0VTjrvokeg", "business_id": "HAnPo3pHgCnw8pNxJZtH-g", "stars": 4, "user_id": "lS9cL1SdwjwVGYZ68jXbSQ", "useful": 0}, {"text": "I like it. \nI was invited there by my English teacher and we met each other in the patio then went inside and started with Capirinia (it was an amazing drink). there was a good environment to talk in English and eating dinner. Although they didn't have fish on that night , we enjoyed of two type of food which I can not remember their name. (Picana and Fijuada we think).\nBy the way! I am writing this article beside my teacher because of my test and review together!", "cool": 0, "date": "2017-10-05", "funny": 0, "review_id": "8nhfJNMM7XnqU_VvnO3Wfw", "business_id": "nQxYkbV4P2h2HqJB0nfpxw", "stars": 4, "user_id": "E0EfangsyOjIOQnVSPVPWg", "useful": 0}, {"text": "Awesome joint in Chinatown Montreal, of all places. Extremely friendly and willing staff that takes care of you. Food is outstanding!  We had the ribeye tacos, the carnitas tacos, and the battered shrimp tacos, along with a pulled pork quesadilla to share. Find this great little spot and enjoy.", "cool": 1, "date": "2017-04-16", "funny": 0, "review_id": "T4bM4_eSgbw9FFH4BSgvSg", "business_id": "Ok9vikKusbG_Ue9pJf6s3Q", "stars": 5, "user_id": "58gTph5ckehX3iu4OdJ0Ew", "useful": 2}, {"text": "Friendly and really helpful staff. A lot of unique juice options which they walked me through the flavours. As a new user, they were able to recommend what would work best for me. I would strongly recommend visiting this great vape shop.", "cool": 1, "date": "2016-04-10", "funny": 0, "review_id": "uDi3KuG9pDOUke-4cHgWLQ", "business_id": "iV7mkvE_lr66Qq945UF7sA", "stars": 5, "user_id": "3PsPu1LWAJA25sQ7wT2T5Q", "useful": 1}, {"text": "I love this place. Any time we are anywhere nearby we make a trip here. The tacos are just the best and the people who work here are the coolest. Super fun vibe and great prices.", "cool": 0, "date": "2017-05-02", "funny": 0, "review_id": "1kWcimIJ0EgeJ0dDXwv0wQ", "business_id": "ApeTrSttf8f4KUrBVtcKgw", "stars": 5, "user_id": "ncBdukjoJ1IJE7cYrM4G6g", "useful": 0}, {"text": "Nice atmosphere, food freshly prepared and a good value.", "cool": 0, "date": "2011-03-31", "funny": 0, "review_id": "i8mJVbQvWXRL04l5I3R0uQ", "business_id": "dHFIvgOYM2Ys7-K47fYWsw", "stars": 4, "user_id": "oF8JgcJLIbLX5RJl2tRaDA", "useful": 0}, {"text": "Great service. Bought some tea with the brewing pot tried it at home and was extremely happy with the purchase.", "cool": 0, "date": "2015-04-14", "funny": 0, "review_id": "6loDvDlJUTFpzjCt-JrI6w", "business_id": "yLLiYvu1gT7JBIg-YSow1w", "stars": 5, "user_id": "GRqQ7EzBOV2hnzPFl37UBA", "useful": 0}, {"text": "What a great restaurant. My wife and I are use to going to Morning Star Cafe not far away and wanted something for a change. This place is excellent. We both had their chicken and wild rice soup and it was very yummy. I had the turkey and roast beef sandwich while my wife had their daily special. We both really enjoyed the sandwiches. This place really has your drink choices covered as well. Lots and lots of choices! We will be back for sure!", "cool": 0, "date": "2014-05-21", "funny": 0, "review_id": "92hBRM9rF9j7stGjvxH5nA", "business_id": "hH36Av7cncv499KS3kjcXg", "stars": 5, "user_id": "YocX3pAiBir8NGJoqYE4Xw", "useful": 1}, {"text": "Terrific little beautiful place. Intimate but not pretentious. Always delish. Love it!", "cool": 0, "date": "2016-02-07", "funny": 1, "review_id": "1Pn-v0Cajpp9gmrpEvGeZg", "business_id": "9a3DrZvpYxVs3k_qwlCNSw", "stars": 5, "user_id": "Gf30POD_shfr7ZyEXbqTBQ", "useful": 0}, {"text": "Ridiculously small portions for the amount you pay!! The employees are not friendly and seem miserable working here. You are better off paying a little more for better quality and more food somewhere else in the airport! Or just bring a lunch from home!", "cool": 1, "date": "2014-04-15", "funny": 0, "review_id": "mkhXts_j93jK54NR14jBUg", "business_id": "PCugqia4CsE9krMJyJ8UXw", "stars": 2, "user_id": "wL1fditZ9ku8mfiq-qs7cg", "useful": 0}, {"text": "Great experience, great food!\n\nFirst, 5 salsas for your chips and queso!?!?!  Whoa...and each is unique, so you can get just the right flavor.\n\nSecond, refritos (refried beans) done right!  My girls and I all noticed that.\n\nFlavorful food done well.  Just ignore that it is in a light industrial area...get over yourself.  This place is well worth it.", "cool": 0, "date": "2016-01-16", "funny": 0, "review_id": "D470gRvyO6_DXaXJ-PPKlg", "business_id": "DtU7Jq2YEaxZitAotT95yQ", "stars": 5, "user_id": "k_hR5J41N25QHTluoVB-uA", "useful": 0}, {"text": "Great spot for drinks and food. My only hesitation is that this place is way too small to accommodate the weekend crowd.", "cool": 1, "date": "2015-07-10", "funny": 1, "review_id": "K-G12_jJSZ6LTwXLJ-YFfA", "business_id": "PAZC7ENEmDDgNMZngJSxxg", "stars": 4, "user_id": "j0hB41zzYy_9wZQLpTXVvw", "useful": 1}, {"text": "I've never had any trouble here. I bought my car here a couple years ago (2013 Kia Rio). Buying my car was as painless as possible! After it was purchased, for every oil change, tune up, etc., Keith Anderson and his crew have been friendly, helpful and open about anything my car needs or will need in the future. Any time there is a concern, they show me the problem, explain options for a solution and we go from there. I wouldn't even consider going anywhere else!", "cool": 1, "date": "2015-07-29", "funny": 0, "review_id": "Yez2VQemPQLsITdIgyzO9g", "business_id": "C-S0oZRD0hqf6t2BOggBKA", "stars": 5, "user_id": "_W1M5kpxe3fI3QA0zLciOw", "useful": 1}, {"text": "Herb N' Legend is an awesome store. They have a huge variety of products for good prices. The employees are very nice and helpful; plus the 20% off glass coupon code works. I would definitely recommend going here and I plan on making more purchases here.", "cool": 0, "date": "2013-05-13", "funny": 0, "review_id": "NPZ_ysfYIheNhM3YlH0rQg", "business_id": "MwcQq2402eDGXuNuMPQi4Q", "stars": 5, "user_id": "XBV_ZtgEQn3DF52aSDe2rw", "useful": 0}, {"text": "Great New Mexican food. Excellent menu choices. Friendly service. Home town atmosphere. Our server was Ken, was attentive and friendly, offered several menu recommendations. Was our first time eating here. Will definitely come back again.", "cool": 0, "date": "2014-04-05", "funny": 0, "review_id": "0Yn0hBb3CSuk9Cmf_EhW0w", "business_id": "DuQtouEXOfo5K4ukON3qwQ", "stars": 5, "user_id": "a08pGysWIjLTSPkWxPUxlg", "useful": 0}, {"text": "Forget Dunkin' Donuts, where the donuts are the only thing not worth eating, this is the real deal.  A neighborhood donut shop, for reals.  \n\nDo the time warp.  Seriously, do it!  Because this place will take you back in time to when donuts were made by...people!\n\nFirst, peruse the nicely varied selection of donuts and other pastries. Then, sidle up to the counter and give your order to the somewhat surly, but efficient server.  Finally, your heaping box of doughy goodness home or take a seat amongst the chatting oldsters.  If you're prone to Homer Simpson style drooling, check yourself.  \n\nWhat are you waiting for?  Get yourself a donut, or three.", "cool": 1, "date": "2012-11-14", "funny": 0, "review_id": "cqkKfYxAS_AGKS3kf8ePzw", "business_id": "u9u-E8blEuyEGmtfeLA6Tg", "stars": 5, "user_id": "p6ciuugLXnwkZGq6jWlibA", "useful": 2}, {"text": "I had a tree delivered and planted by Whitfill Nursery.  Raymond and his crew did a fabulous job. A+++ customer service.", "cool": 0, "date": "2016-11-07", "funny": 0, "review_id": "zbVMv9vtodVQKdCiHwQSdg", "business_id": "NWwBrQBLYXwe-EU860rfAg", "stars": 5, "user_id": "qg11zWWCHPGCDtaMzqLq3w", "useful": 1}, {"text": "William is an amazing hairdresser there \n\nI recommend this salon to my friends.", "cool": 0, "date": "2011-06-02", "funny": 0, "review_id": "HB9sLwzFUpKr9q5q8lzd7Q", "business_id": "E8zpGiYERqkN-FMhq0bPIg", "stars": 4, "user_id": "yX6Abde40z52skpEn4LtnA", "useful": 0}, {"text": "I brought my dad here during his visit.  This is now my favorite restaurant in Charlotte.  We both got oysters during the Happy Hour.... 46 of them. Lol. We also got their dark and stormy drink.  It's made from rum, ginger beer, and lime.  Yum !  I had 2.  We both got their NC Trout.  Amazing.  I got the sofrito sauce which was excellent.  He got the lemon aoli.  We both agreed the sofrito was better.  Definately will be back !", "cool": 0, "date": "2017-09-23", "funny": 0, "review_id": "3SJaeYIoPNpS3vdZtzKWcg", "business_id": "_a8vCw5cxt1vhN-HbgNGuw", "stars": 5, "user_id": "gERe-EPQPDsEkWu2fKeRYA", "useful": 0}, {"text": "ZERO stars. As I was in a back room in my home vacuuming I had a knock at my door which I did not hear. My fault there. I had my phone on me and received a voice mail to call a number that was different than the number on my phone. I call and give my name and say apparently I had someone at my door sorry I didn't get to them or hear it. I get told that once they leave the area that's it. No coming back. So I say ok I'll only be home until noon the next few days. I get told by the lovely lady on the other end that that's just not possible for them so I can call another time when I'll be available to recieve my order.  So whoever spent good money on flowers for me just wasted their money. Very poor and disgusting customer service. I will make sure I pass this on to everyone I know.", "cool": 0, "date": "2015-05-11", "funny": 0, "review_id": "MtEBcyTJqBjkOIGGfGhcgA", "business_id": "gPgE8Mrkskj5TnI_I7Ll3A", "stars": 1, "user_id": "5n15kEXnvZeMItM8v9DahQ", "useful": 1}, {"text": "New to desert dentistry everyone are so welcoming. They give you a great experience. Love this place definitely a place to bring all my family.", "cool": 0, "date": "2016-04-20", "funny": 0, "review_id": "2X2r4qT2wNaZWCvD4b-06Q", "business_id": "2lpTbgwlVEYXgFBqUpKmrg", "stars": 5, "user_id": "bzKM79h6g7AQ7MlN8AOj7w", "useful": 0}, {"text": "Wish there was negative stars.  Volunteered to take the next flight.  The manager Shureen forgot to book my ticket or get my luggage off the plane.  She walked away and while she was gone. Someone sold the last seat.\n\nHer solution was phoenix to Portland to Burbank or to Long Beach with a cab or a flight tomorrow.\n\nWhy am I forced to suffer cause she messed up.  Should have gotten me on another airline.  Never really apologized.\n\nNo one could give me her managers name.", "cool": 0, "date": "2014-11-17", "funny": 0, "review_id": "V09EYFo-Gv1Ap5PjN0ZaBw", "business_id": "bp5ARRJu3_8CBsAS4tOWhA", "stars": 1, "user_id": "oLnIgS6qm15dJB7OYUUlog", "useful": 0}, {"text": "This is a bad or can call worst buffet in my life .... Does everyone tell you this is a good place to eat .... Please don't trust them\nDon't waist your money to come over here it's a dirty and nasty place in Vegas ... I don't know how they can stand on business ...\n Food taste are salty and .... No words to tell....\nService wow is horrible .....\n\nI am so regret to step into this place ..... I really want to get my money back .... If possible....:(", "cool": 0, "date": "2015-10-11", "funny": 0, "review_id": "3f9s5He_08QcySAvKVnCQg", "business_id": "x8O-Mll5ksDpeIgtA0XY-w", "stars": 1, "user_id": "9Msg1avVJlufJ8ZsiYgr1Q", "useful": 0}, {"text": "Unlike the other 2 reviews, I had an amazing experience thanks to the lovely Carrie.  She was helpful, joked around, solved all the issues and saved me money.  I can't speak of the other employees but she deserves 5 stars.", "cool": 0, "date": "2014-02-20", "funny": 0, "review_id": "mNz5oFCj2GYEJpmt4zPbCg", "business_id": "-JSa1m_LamlVBzHcPCsZJg", "stars": 5, "user_id": "iTEOlNWDHG9kfYzy3aUc7A", "useful": 0}, {"text": "We live close to this restaurant, but had overlooked it.  We didn't realize that it was there.  But some friends recommended it and we decided to give it a shot.  We were really glad that we did.  The atmosphere was relatively quiet and quite intimate. We were comfortable from the moment we sat down.  Our waiter, Ray, was attentive and very knowledgeable.   The food... oh, the food.  We both loved it!  I had the lasagna, a unique implementation that had me eating the entire very large portion, even after telling my wife that there was no way I'd ever eat it all.  My wife had a special veal meatballs with fettucini entre' and also loved it.  We will definitely go back and we were excited to find such a great place so close to our home.  We highly recommend this restaurant!", "cool": 0, "date": "2017-07-24", "funny": 0, "review_id": "eTFmhTG4IBJlTeEZ3xdHxA", "business_id": "M4mNS2LZPjpzQyiJgL8znw", "stars": 5, "user_id": "UYiRqDOrbHsNQ9n5-b2xYw", "useful": 0}, {"text": "I love Salon Vivace. My hairdresser is Brianne - I am forever a loyal customer of hers. She is very good at what she does  - I have very long, thick, dark hair. She was the first sylist that ever showed me that I have a natural wave in my hair, which I never knew! She gave me an amazing cut & style and then gave me wonderful tips on how to keep it up myself. She did a wonderful job and most stylists dont help you - they do it for you so you keep coming back. Well her styling + tips will make me go back to her and only her every time. She is wonderful.", "cool": 0, "date": "2011-05-06", "funny": 0, "review_id": "A7IY1Vsbrmkn2nmFEjpAUw", "business_id": "g7ihFxbKjtxYGQGF31xcSQ", "stars": 5, "user_id": "lAMi4C99Bex1fxIlEtCG8Q", "useful": 0}, {"text": "I went to see Tatiana for the for the first time to get eyelash extensions. She explained everything and it was done professionally and perfectly. The results were gorgeous and they have stayed on perfectly. She is efficient and her services are real & well priced. I am going back there to get fillers and to get a facial - and all of my friends are going there too after seeing my eyes.", "cool": 0, "date": "2017-02-28", "funny": 0, "review_id": "foaBpnLvS-i_-sH2kxSopQ", "business_id": "FXIygv0F-w6nFICgd_9wCg", "stars": 5, "user_id": "lAMi4C99Bex1fxIlEtCG8Q", "useful": 1}, {"text": "I like to review new restaurants and I want to say good things.  Here, the service is very good and friendly and the food is served very quickly.  On the bad side, my wife ordered a margarita and it was pretty much just lime juice.  Terrible!  My margarita was ok, but seemed small for the price.\nThe food...not good.  I had the enchiladas Verde and the sauce seemed to be primarily vinegar.  It even had a metallic taste.  The rice was pretty much the same.  My wife's enchiladas mole was somewhat better, but still had that vinegar taste.\nI really wanted to like this place, but we will not be going back.", "cool": 0, "date": "2017-08-20", "funny": 0, "review_id": "R1uwIlp_QPd-Ndr9j7pWTg", "business_id": "oJQTaE-0pyDly6z0T05wxA", "stars": 2, "user_id": "unWkGWOgwCe82QP9HJ7_bw", "useful": 0}, {"text": "Just went for a pedicure. It was great. Everything was so clean (really pay attention to this part and compare to other salons you may have been to) and the price and service were great. The nail techs there really work as a team because they realize your time is valuable. This place is very professional. Would reccomend them to anyone.", "cool": 1, "date": "2011-08-31", "funny": 0, "review_id": "YsgOJ_bT5Nc_JLiImUGZew", "business_id": "2lYMhZL2oHUpOQ2KjR5aJQ", "stars": 5, "user_id": "VraV4Ci-oJsONsoIWCNeXA", "useful": 1}, {"text": "Nice hotel, awesome pool. Wifi did not work in room but did get refunded some of the resort fee because of the problem. Staff were all super friendly and always willing to help out", "cool": 0, "date": "2015-09-29", "funny": 0, "review_id": "RZ-iW8NIiXG18x5AMw_o3Q", "business_id": "DfgZlNgKwBvCpA_0alumXw", "stars": 4, "user_id": "S2jls6R1RNDRPEHxtk3C1w", "useful": 0}, {"text": "Mozaik is beneath the stellar boutique ice cream parlor, Sweet Republic. What better way to cap off your spa treatment with a refreshing sweat treat? But this review is about Mozaik. If you don't already know, they're a full-service spa with everything under one very hip roof: massage, facials, mani/pedi, hair cut & color. This is a big plus. Who wants to drive from place to place in Scottsdale's oppressive 3,000 degree summer heat? Not me. I booked a fax wax, 90-minute massage and color. FACE WAX: I was long over-due. The peach fuzz had to be expunged. Karina took her time, waxing a small area at a time. She took the sting out by applying pressure on the newly waxed skin with her fingers. A++ for NOT ripping off any skin. MASSAGE: Full disclosure: I am a massage aficionada. I have long known the benefits of a good massage, and have actually gotten off the table after 5 minutes of a bad one! Why waste my time and money? Kristina is the masseuse. Love her tats! The room was the perfect temperature. Soothing music. Really comfy table, and especially comfy face thingy. OMG A++. Killer good back, shoulder and head massage. The girl can knead! COLOR: Eva is a gem. Her own hair is her calling card, and testament to her brilliance! My hair is very resistant to color, and the color and developer I had been using was just not working for me. A rich auburn has always been elusive. The color would fade a week after application. The frustration brought me to my knees. Eva assessed the situation. She used 10 instead of 20 developer, and mixed two colors to finally, FINALLY give me the color I always wanted. She even brought me outside so I could see the true color in all its glory. A+++. LOVE Mozaik!", "cool": 2, "date": "2015-07-02", "funny": 0, "review_id": "po00D2d6a2mXZWzNsmlBzg", "business_id": "zMGhQqA1Hho808BuQr9I6A", "stars": 5, "user_id": "BeytFkMrN7bmKDyqP7ZZdQ", "useful": 6}, {"text": "I'm gonna sound crazy here but I enjoyed chronic Taco more than this.  I feel like the food was better and the service was much better.", "cool": 1, "date": "2016-11-11", "funny": 1, "review_id": "97OnOB1O-OS6IW0hmD94pA", "business_id": "mss-LiOfL1vtoNo3WoEoJw", "stars": 4, "user_id": "pIY9lMQswVm1NzTOWfucJQ", "useful": 1}, {"text": "If you are Foodie like us and enjoy weekend unique breakfast places Or midweek this is a MUST!  The service was great and the chef came out to the tables and talked with patrons. The waitress was super knowledgeable and even gave the history of the chefs. There are delicious cookies, muffins, and doughnuts. They have all kinds of coffee drinks as well or mimosas and more. They smoke their own meat on their patio which was yummy. We enjoyed eating outside on their awesome patio.  My husband & I think it the BEST  in Vegas. yum!", "cool": 0, "date": "2016-02-20", "funny": 0, "review_id": "pcMruojjetsmX-ejWN3Nnw", "business_id": "uBdYMY6a6A7FyxzTSwOiDg", "stars": 5, "user_id": "HXLooju5wjKxPKzeY6Hxiw", "useful": 0}, {"text": "Dr Pham is great! He is very gentle and my visit was painless. Caring and friendly staff throughout the office. I love that he does Botox and Juvederm also!!!", "cool": 0, "date": "2015-07-09", "funny": 2, "review_id": "dvNigfc1AI28p9HO-3yS9g", "business_id": "2vSQMDH2q0elKS73TmGl9Q", "stars": 5, "user_id": "zKJ5KfKAMiaQdqx1VR_eng", "useful": 3}, {"text": "Ich muss mich einem der Vorgänger leider anschließen. Es ist nur Standart, den es in Landsberg defintiv auch besser gibt.\nIch hatte ein Essen mit Steinpilzsoße,.... drinnen waren grad mal 3 kleinere Stückchen vom Steinpilz, die man suchen musste,... naja,... das Fleisch war ok,... aber auch nicht besser als in anderen Lokalen,...\nWas hier wirklich riesig sind, sind die Pizzen. Der Belag drauf ist normal, ... und manchmal etwas weniger (manchmal wird hier etwas zu doll gespart). Die Zutaten sind überwiegend frisch,.. aber wie gesagt, nicht alles ist frisch.\nWer total gerne Pizza ißt, ist hier bestimmt gut aufgehoben.\nAnsonsten ist es im Innenraum eher eng,.... gemütlich ist es daher nicht wirklich, weil es einen sehr \"überfüllten\" eindrückt macht,... ein paar Tische weniger und damit mehr Platz für die Gäste wäre bestimmt ein guter Ansatz um es für die Gäste angenehmer und gemütlicher zu machen, denn die Einrichtung selber, auch gerade mit dem Ofen,  würde schon Gemütlichkeit ausstrahlen.\nDie Sanitären Anlagen sind sehr sauber und vorbildlich.\nNegativ: Kaum Parkmögklichkeiten vorhanden, denn der \"MINI-Parkplatz\" ist in der Regel voll (allein schon durch Besucher der Videothek usw.).. ansonsten bleibt dann nur noch der Straßenrand, und auch der ist in der Regel voll....\nFazit:    Das Essen ist OK aber nicht außergewöhnlich super oder hervorragend.  Die Pizzen sind riesig und gut und lecker. Das Personal macht einen ziemlich arroganten und hochnäsigen Eindruck. Alles sehr eng. Unzureichende Parkmöglichkeiten.", "cool": 0, "date": "2010-12-06", "funny": 0, "review_id": "hM7FVcqR5cPE4R8_poCHyg", "business_id": "qQc8N_HaJJ5RQ-6WAx23rg", "stars": 3, "user_id": "IKAWdIPg8oRWZffD02uJIA", "useful": 0}, {"text": "This restaurant poorly labels their menu items on postmates. \nI ordered a side salad with no bacon.\nThere was bacon in my food. \nI also ordered the potato salad as well that has bacon.\nI had a plain bagel and it tasted like plastic. Will not be returning or ordering ever again.\n\nI posted a picture.", "cool": 0, "date": "2017-08-18", "funny": 0, "review_id": "gVmPDo338eNqce6m3qfNgw", "business_id": "BBt-H2kcXYGumD0Ey84hQw", "stars": 1, "user_id": "Vve0t8wupauV-VQtzxGTXA", "useful": 1}, {"text": "Praline, banana, caramel French Toast!!\n\nI expected a lot and Sunny Morning delivered! \n\nSeat yourself wherever you would like! Looking around the room everyone's plate looked to be delicious.  I went with the French toast and was not disappointed! \n\nI was surprised how many people showed up solo to order their favorite breakfast dish. \n\nIf you are looking for a breakfast spot this is a no brainer. ENJOY!", "cool": 0, "date": "2017-10-13", "funny": 0, "review_id": "Lrs-8B6ghOVxOesP0u2vQA", "business_id": "B4-2wA8Pj8MQK1Ylymypqg", "stars": 5, "user_id": "14YnvoXaFaFtz_eLKBKOOg", "useful": 2}, {"text": "Very tasty. A lot like pop-eye but spicy is better.like Thursdays deal.3.99 for 3 pieces and cab add a side or two for 1.25 each! Not too shabby.", "cool": 1, "date": "2014-04-05", "funny": 1, "review_id": "idr_K9NrlwmL6F3QqCYbZA", "business_id": "lxZoKGTQvsTFrahsYrPFKQ", "stars": 5, "user_id": "qKVLujoE0_GMqk3iUAeTYg", "useful": 3}, {"text": "Really good quality sushi for a great price! Found this gem yesterday and went for dinner on a Wednesday evening and was very pleased.  You have the option of AYCE or a la carte with a large menu and lots of options. Prices are really decent- $22 for AYCE and individual items for a la carte are cheap. Quality of the food is really great! The sashimi was very fresh, noodles were done well and flavourful, rolls were tasty. I ordered the Lakeshore Roll which has BBQ eel, tobiko & cucumber topped with avocado- it was delicious! My ONLY complaint was that the rolls were a bit on the smaller side (but you get a fair quantity) and the one piece of shrimp tempura I had wasn't as crispy as I like but I think that was luck of the draw because my crab tempura turned out great.\n\nAtmosphere was cozy and quiet. It's located in an old plaza so it doesn't look like much on the outside, but the inside is modern and clean. Servers were super friendly and we didn't have to wait too long for the food to come out. They also do delivery in a pretty wide-range.", "cool": 1, "date": "2017-03-09", "funny": 0, "review_id": "lsX7l4QixgmL81j17vv4TQ", "business_id": "d3vN5zc7rCSdan4xbfOEkA", "stars": 4, "user_id": "qGDlXkTC0Gy0K6rbo3oD5A", "useful": 0}, {"text": "These chain of restaurants have the best service that you can get in Vegas, it is genuine and warm. I've worked for the industry in Vegas for almost 3 years and it is so refreshing to find servers and service of these quality. Going to firefly, we are helping our local community by investing more in our local business. It is a versatile place to dine out, either for a date, friends, or even family reunion. I am latina and firefly is THE only place in vegas that offers a tasteful place to enjoy latin american culture. I hate to hear people bad-mouthing these great restaurants, but plz keep in my these are ignorant people. Before any out there start pointing fingers, check your own kitchen and how you prepare you on own food, there are more chances that you will get food poison in your own kitchen, than in Firefly. Media is just taking advantange that Firefly is a place loved by locals and they are just making money out bad publicity. I can speak for my friends n myself that i will go back to firefly as much as I always do ( which is twice a week, every week) no matter what. Thanks again and please support our local business", "cool": 0, "date": "2013-05-11", "funny": 0, "review_id": "wSw7Tq4UJLSiuHzvRj7gvA", "business_id": "bfIizwyT3-QXrntWbBpfKA", "stars": 5, "user_id": "9OXcULZWs9d-XTfwjFa8aQ", "useful": 0}, {"text": "I've visited Vivace several times. While I was dining in the restaurant area for brunch, everything was great. Mimosas kept flowing. Although the two times I've been to the bar, it's been a horrible experience. I went one evening for drinks. When I got there, the two bartenders were fighting, and I kept having to wave one of them down to order a drink (I was one of three guests at the bar). The second time I dined at the bar, it was for brunch, because there was a wait for the dining room. My friends and I grabbed a table by the bar, and it was a good 10-15 minutes before anyone greeted us. Again, the bar wasn't full by any means. We kept having to go to the physical bar to reorder drinks because no one was stopping by the table. On one occasion, the bartender told us to order from our server (who was m.i.a.), and when we said our server hadn't been around for a while, he rolled his eyes at us. The worst part was it took 2 hours for two courses to come out. No apologies, no managers. But two hours! By the time the second course came out, I had to box it and leave because I had somewhere else to be. The worst dining experience I've ever had. The dining area seems great, but avoid the bar at all costs.", "cool": 0, "date": "2015-08-06", "funny": 1, "review_id": "u8fRdyYWKSXVXU7QJGu51g", "business_id": "bm_PGQMGMjylitqkNIEzTw", "stars": 2, "user_id": "r7VXej768A33xSjEFkBKkw", "useful": 0}, {"text": "This joint on the strip was not even decent but it has mediocre food.  I stopped by for a late breakfast and I regret it.  \n\nThe rice leans towards the congee side, the soup dish was bland, and like previous reviewers say the longganisa was like a hot dog and it tasted weird.  The price was sort of expensive, too.  \n\nI dunno why I ended up here maybe I was jonesin' or something.  I should have eaten at the Bally where they had the cheapo prime rib breakfast.", "cool": 0, "date": "2012-05-21", "funny": 0, "review_id": "COGtcmwxx-bfU6MBCYdfHg", "business_id": "mqIpIqxnT7f94eilrNkZOw", "stars": 2, "user_id": "SZ0LqZ9z5WZAs_QGJmMduA", "useful": 1}, {"text": "Staying at the Elara time share, I wanted to try a buffet but was lazy, so I just headed for Planet Hollywood and walked through the Miracle Mile Shops.  Upon entering the casino, I looked for the buffet, which was sort of hidden.  \n\nIt was late dinnertime so there weren't a lot of people but they still had a ton of food.  I immediately went to town and grabbed the \"exotic\" dishes like kabobs, lambs, etc. and then noticed that you can make your own burger, so I proceeded to request two medium well's with cheese.  \n\nI must have eaten around like 4 or 5 platefuls then it was time for dessert.  They had like a cupcake bar.  Tons of cupcakes, and I tried maybe 6 of them.  \n\nI recommend this place only if you are nearby and if you're lazy.  Otherwise I should have just gone out and ate somewhere else.", "cool": 0, "date": "2013-06-05", "funny": 0, "review_id": "WjWEjv_3cWn9jldh-vSfng", "business_id": "Fi-2ruy5x600SX4avnrFuA", "stars": 3, "user_id": "SZ0LqZ9z5WZAs_QGJmMduA", "useful": 0}, {"text": "I didn't have high hopes for the barn since a friend had visited it the year before and was unimpressed. But, being haunted house aficionados, we know that building your attraction each year is expected and can completely change a haunt from one year to the next. We were pleased to see that they had apparently added a 'room' visible from the long line-up. Unfortunately, the changes were mostly cosmetic without much real consideration of the suspense and attention to detail that makes a good scare. \nThe Barn has no story; doesn't create a  mood;  uses too bright and boring lighting; and relies almost entirely on expensive looking props that don't move or do anything particularly scary. The few actors we met didn't bother with timing and seemed bored- as were we. \nIncredibly disappointing for an adult. Might be fun for kids. I get the feeling it stopped being fun for the owners as well.", "cool": 0, "date": "2011-10-22", "funny": 0, "review_id": "cUipSJGYnA_nLb9b_Vh-ZQ", "business_id": "6Y4b4SqKBPimBvKgzhBpFA", "stars": 1, "user_id": "RQVS259GV25z54izXAQgTw", "useful": 2}, {"text": "I am gonna be nice, but honest.  Service and ambience is good, perhaps above average. But the BBQ here is sub-par.  Not sure which city of Greenville Lucille grew up in (Wisconsin as stated by our server), but this place seems to try to grasp all styles of regional bbq....I had the \"Texas-style\" brisket and was truly disappointed.  I was recently in San Antonio and had true roadhouse bbq.  The first thing you experience is the smell of oak, hickory, mesquite in the air....not so much here, just fryer oil.  The meat had a good black crust and a nice pink smoke ring, but no smoke flavor.  As mentioned by others, it seems more like pot roast.  Tender yes, but Texas-style brisket, it is not.  \n\nBeyond that the food was not hot upon arriving at the table...not sure how they pickup each order, but perhaps they need to rethink that process. \n\nThats it.  Next time I go to bbq, unfortunately Lucille's will not be on my list.", "cool": 0, "date": "2009-12-16", "funny": 0, "review_id": "-tXa4oi6dLSe86jxuxkCKQ", "business_id": "0ldxjei8v4q95fApIei3Lg", "stars": 2, "user_id": "wwDkSvC-LMjko3inNe9pXg", "useful": 0}, {"text": "Larry was inside sales and Arnie was the tech who arrived to do our install. Fast, great pricing and really knew what they were doing. Installed an entire new opener on our third bay garage. Thank you for being honest, and arriving on the time you said you would. I would highly recommend this company for your garage door needs, as I am super picky and these guys past with flying colors. \n\nThank you", "cool": 0, "date": "2016-08-04", "funny": 0, "review_id": "2sDu6YM4fkYnamZHvfvdBg", "business_id": "HdCbbeg5JHR0orgQ7rEQbw", "stars": 5, "user_id": "OzTTBPFMsfvatexzhGN4VQ", "useful": 0}, {"text": "Had a fantastic dinner at the Grovewood tavern and wine bar with my coworkers. The waitress was a little behind in keeping up with our table, however we enjoyed the abundance of this location along with the freshly made bread that was delicious. Everyone had the opportunity to try something different for dinner- I ordered the Bison brisket and it along with the other entrees were delicious. Great wine selection and deserts rounded out our evening.   I was very happy with this recommendation.", "cool": 0, "date": "2015-03-24", "funny": 0, "review_id": "zh749Zc9JbXodL_AlgObiA", "business_id": "BLfCMa2yWNo70D3wwAxwow", "stars": 4, "user_id": "zeZifS-75M7HSL_-1yVR5w", "useful": 0}, {"text": "Won't be back.  This place was horrible. Not even kidding. Won't be back at all. The bagel was stale and tastes horrible. When I asked for a new one they just have me excuses and finally gave me a new one and the new one was still horrible. Won't be back.", "cool": 0, "date": "2014-06-11", "funny": 1, "review_id": "vEfTlheTNPICKyDB4f66tQ", "business_id": "3QGcupWVaYsFJyL1gDt6kA", "stars": 1, "user_id": "tc7P9ycWZDWmqbnHapbIQQ", "useful": 1}, {"text": "Honestly, I've only ever had the Daeji-Bulgogi; but it's so damn delicious, I don't want anything else!! Mmmmmmmm! Don't be fooled by the exterior!! It's clean, professional and always great service!", "cool": 0, "date": "2014-07-11", "funny": 0, "review_id": "wjth9HX2rwSt-5ywMgpIcw", "business_id": "6RSbdKeccFWbCOIQHKbK7A", "stars": 5, "user_id": "Zk8Ci229LJkMsTPtD_qcMw", "useful": 1}, {"text": "These guys made an appointment, and gave a rough estimate to pump my septic. They called to change the appointment after running late, and gave us a new time. They were late again, and showed up near the end of the day.\n\nAfter looking for the tank, he said he would need the camera that was on the other truck. Since the work day would be over when he got back it would be $150 an hour for overtime. If we wanted them to come back Monday (it was Friday ) then there was no charge for the looking they had done. If not, it was $90.\n\nI called the office to try and figure out why I was going to have to let my drains keep backing up, or pay $150 an hour, when the issue was the guys were horribly late and didn't bring their tools. The guy in the office was nice, but unhelpful. He described it as a unique situation with stuff under the ground in the yard making it hard to find my tank, and suggested I get someone with a backhoe.\n\nI had someone else come out with a metal poker and a tape measure and mark the tank off in less than half an hour, and charge me $25.", "cool": 0, "date": "2016-04-12", "funny": 0, "review_id": "v-mb1UaeUxTVj-oGSDfePg", "business_id": "vo-EekrtBvIRZvy1GALPRA", "stars": 1, "user_id": "wZQNKDBEkJpsEGri7HM3JQ", "useful": 1}, {"text": "OK.  Now were talkin'.  The food here is yummie-delicious.  I had 2 quesadillas-one w/chicken and one w/mushrooms.  What a delightful surprise-especially the mushroom.  Everyone loves my special mushroom dishes and this one at La Palapa is just a different taste profile and better than mine.  A friend of mine had the mole-she is an excellent cook and loved the mole.  Another friend had chorizo quesadillas and also had great appreciation for his dish.  We also had the watermellon juice which I believe was special for the day.  I've only had this concoction in Soho in NYC (much more $) and this libation equally good and in prettier glass. \nAnd the price-forget about it-downright cheap.  Can't wait to return and have the dessert.  I love flan and I'll bet theirs' is excellent.  I was there on Th. afternoon and 2 other tables were taken-so you should be able to find accomodations.  I couldn't be happier to have this place in my neighborhood-never leave!!", "cool": 0, "date": "2015-08-21", "funny": 0, "review_id": "atgLnQNySE1wsivtu5-Yeg", "business_id": "qHseX2NHeUUedIgs_VasZA", "stars": 5, "user_id": "z79yVa08rPPugXlg4z7FgQ", "useful": 1}, {"text": "As a Boulder City local who eats out a lot, this is officially my favorite breakfast spot currently.  Their breakfast potatoes are flavored with rosemary, and are very unique and flavorful.  My 4 yr old son orders french toast, and I'm happy that they will include bacon or sausage, fresh cut fruit, and make only one slice of french toast for him.  He gets what he wants, but its a well rounded, healthy breakfast that you can't find at any other place in BC.\n\nMost of the restaurants in BC serve pretty unhealthy food of \"diner\" quality.  At the hotel you can have higher quality for about the same price.", "cool": 0, "date": "2012-05-17", "funny": 0, "review_id": "02mWtWHSLaDJU2OFqb7peA", "business_id": "sINy8CmxisQlnHgd1Uex8g", "stars": 5, "user_id": "DQb5QFRO_EoA3JbREscEDA", "useful": 0}, {"text": "Service is all over the place.  Inconsistent.  Aloof.  Partial treatment.  One of the young waitresses caters to regulars.  For example, the other day she went out of her way to hand plastic cups to her group of friends and offered to individually pour them water.  Why not treat  all of your customers that way?  I felt like I was in high school again: extremely cliquey. \n\nI've also observed that one of the male workers gave free desserts to a family and a big block of feta cheese to a couple next to us.  Perhaps they were good friends.  But that's irrelevant.  Again, why not hand out free desserts & blocks of feta cheese to all of your customers?\n\nInconsistent quality of food.  One day my falafel sandwich was amazing - a mind-blowing experience.  But then a month later my falafel sandwich was a dismal disappointment.  There was no plump, well-cooked warm falafel inside of my pita sandwich.  Instead there were tiny bits of cold leftover crumbles of falafel thrown inside a soggy, almost inedible rubbery pita.  I complained to the waitress expecting a brand new falafel wrap to be made.  Instead she came back and handed me a plate of four disproportionately sized falafel; not a single one was in the nice shape of a medium-sized ball - one looked like an elongated, stretched out elephant turd, the other was in the form of a tiny black dot.  Plus it was overly cooked (crispy & burnt).  I'm guessing this was left over scraps from a burnt stove.  She told me to just \"throw it in\" my wrap as she quickly walked away.  \n\nWhat's the point in eating \"good tasting\" food if you're preoccupied with horrible customer service?  You cannot enjoy the food much less digest it properly.\n\nAlso, the establishment seems to exude a certain element of Arabic/Lebanese elitism.  Which probably explains the partial treatment of their \"favorite\" customers.\n\nFYI: I strongly encourage you to go to Haji Baba.  Consistent, excellent quality of food and most importantly: impartial treatment & welcoming/friendly customer service.", "cool": 1, "date": "2015-06-28", "funny": 1, "review_id": "0CXzLugj0rzV7ShZlwIhuQ", "business_id": "tnG4_L5bZiffTbaFru9EBg", "stars": 1, "user_id": "X3P9Yc4OC7jDkWpBPgu07w", "useful": 4}, {"text": "Best karaoke in town! Having been to multiple karaoke spots in town I have to say this is my favorite spot! Cheap drinks and fun singing. Would choose this place over any other karaoke spot in town.", "cool": 0, "date": "2015-09-07", "funny": 0, "review_id": "5NEESe7gURGCc0IRsf0csA", "business_id": "l3joBBpkq0ib11dKUpKMAw", "stars": 5, "user_id": "Eve-8Glwh0jCMVo_6xbYdg", "useful": 2}, {"text": "Ice cream.  Who doesn't like ice cream?  My friend and I decided to go get ice cream to satisfy our sweet tooth, and the fact that I have always wanted to try it.  Being that Taste of Little Italy was going on, the place was crowded, but the staff were very nice and patient.  I got to sample Mickey's Birthday Cake (I didn't like it, but for those of you who like Betty Crocker's icing, you may like it), and went with the Brownie Toffee Crunch ($5.75).  The waffle cone was fresh as it came right off the waffle iron, and the ice cream was delicious!  They even gave me a mini Oreo cookie to top off the cone :)  The only downfall was that I didn't taste any toffee.  Although the number of cow pictures, figurines, and stuffed animals kind of freaked me out, I would totally go back again.", "cool": 2, "date": "2011-06-24", "funny": 0, "review_id": "SgxBxl-exD2tdKailM9NSg", "business_id": "IOFzd7mBYCopQQUlRivPCw", "stars": 4, "user_id": "wCz8mxvqFFIhPnk_2LTOFQ", "useful": 1}, {"text": "Staff here need an attitude adjustment. Seems unless you are a regular, you are an outsider. Super rude, I should be lucky to be served by them. Apple juice is much smaller than other Country Styles I've been to. Tiny english muffins, I had to ask if it was the right size. Won't return.", "cool": 0, "date": "2014-07-24", "funny": 0, "review_id": "wIhEujEWI-SfZgXXlKHFTw", "business_id": "haV5maGtPDXYPCnrf3z9VQ", "stars": 1, "user_id": "HfdfE4lFt2AkB-zOi_dkTw", "useful": 0}, {"text": "It used to be so much better when it was \"Fernwood\" but the new management company \"greystar\" messed it up! Very unprofessional staff, not quite nice people working there, terrible in communicating with customers. the girl who usually works there doesn't know what the heck is going on most of the time and it's absolutely useless help! they do not care about customers or renters.\nBut, nice and decent apts, good rent rates compare to other complexs if you're looking for a small apt in for one or two person in a good neighborhood.", "cool": 0, "date": "2015-09-21", "funny": 0, "review_id": "15PJNEGsA9NXWBrKb_eCrA", "business_id": "Kp-w6l1IrOT9P8-3u4oRJw", "stars": 1, "user_id": "wCDPh6llGrImrI0BrR77nw", "useful": 3}, {"text": "I ordered a gluten free coconut cake. It was AMAZING!! No one knew it was gluten free! Everyone said it was the best cake they ever had! I highly recommend this place!!!!", "cool": 0, "date": "2016-07-31", "funny": 0, "review_id": "1uVtZrl3DlLVb3-1_bmi_A", "business_id": "s9bbDYkvgw1t95iPFwn9Ow", "stars": 5, "user_id": "N2JYv9hZULO2sTe3ARcyAw", "useful": 0}, {"text": "Went with Acrilics that were done elsewhere that still looked perfect and asked for cuticle removal and gel on top of the whole thing, even though it would be a bump it was ok. The guy started by cutting my perfect Acrilics nails taking them off (hurt like hell) the owner/manager came by saying \"beauty hurts hahaha\" I asked why he was removing, I did not understand what he said, then when he was done with the cuticles, he brought he gel colors for me to choose and I said that I did not want to put gel anymore because he had already removed the nails and now I just wanted regular polish. The owner/manager came back and they both started insisting that I had to do the gel and I finally said NO! And explained that I did not get what I wanted in the first place so I wanted the simplest thing. So they accepted - after lots of insistence - and for the first time ever I did not tip. Will never go back, never recommend to anyone. Horrible.", "cool": 0, "date": "2013-04-10", "funny": 0, "review_id": "BYuZ0pg0ISC55-hiZWMlxg", "business_id": "G4ASg6mSW739ru0eKs5Y5Q", "stars": 1, "user_id": "tlGGrCVbWBQu4ZxJNHw33g", "useful": 3}, {"text": "Came here recently, this time for breakfast. Loved the bacon, but the eggs were abit runny. They had salmon and beef tenderloin and it was delicious. The price for breakfast is a great price, $15.99. Waffles were so-so, I wish they had the regular normal sized.", "cool": 0, "date": "2011-06-18", "funny": 0, "review_id": "D9QRKdbYeqH392_XLBEnqw", "business_id": "ujHiaprwCQ5ewziu0Vi9rw", "stars": 4, "user_id": "iB3iW2re2A4LQEFcpXExFw", "useful": 0}, {"text": "We've been going for here for a few months regularly and keep coming back because the food is really good and really affordable. If they don't give you one ask for the special menu with prices from $4.95-$8.95. This place has the best fried chicken with crispy skin and moist juicy meat for $6 for a whole chicken. Yeah, a whole fried chicken. We always order orange chicken, Singapore noodles and xo green beans. The beef dishes we've had were yummy too. They could do with a thorough cleaning starting with the bathrooms and table tops and some remodeling too.", "cool": 0, "date": "2013-07-24", "funny": 0, "review_id": "zwU3cJRjyvdjZSk08eSLFQ", "business_id": "L6qd3x0bHymyxub9dF7lIA", "stars": 4, "user_id": "sNqnKBO0r7VlwOr9A-vdaQ", "useful": 1}, {"text": "Luxury Suites has come a long ways!  Customer service is finally on point and rooms are nice.  Just spent 2 nights in tower 1.  Loyalty is key, and the firm does a good job recognizing its repeat clients.  Special thanks to Bryan W. for enabling our reservation on a busy weekend, and helping ensure a satisfactory stay.", "cool": 0, "date": "2015-09-08", "funny": 0, "review_id": "bjJq5hDLy5RTHYu4paXnVA", "business_id": "HzvKe4EbQF0Wtf_WzIcvQA", "stars": 4, "user_id": "9PNtRBUiXVoopAU-uU0ODg", "useful": 0}, {"text": "Convenient off Stephanie/Warm Springs lots of parking, I ordered chicken curry and fresh watermelon slush. Curry's flavor is perfect ..green beans, tomatoes and vegetarian chicken slices and noodles \nOrder taker is very friendly and knowledgeable of food allergies...will be back", "cool": 0, "date": "2017-08-29", "funny": 0, "review_id": "xtf7SxIr6YrOGMtVI6F4Zw", "business_id": "SgoPKzmU5CjuD5ewuoJ7oQ", "stars": 5, "user_id": "n_TY6rd1wXZBczBaOaK6Rw", "useful": 1}, {"text": "This place is amazing, i have 13 cavities and Dr. Douglass fixed every single one! What a place to be! Recommend to everyone", "cool": 0, "date": "2016-03-14", "funny": 0, "review_id": "0hpBujTU0HuDLUNXUQIW0Q", "business_id": "S7UVTD4ZFbk-gflrMhPkCA", "stars": 5, "user_id": "I0PnYhy7uyflx2NcfnNQMg", "useful": 0}, {"text": "just moved here from BC, I was suggested to them by the registry. I needed a bunch of work done and they were really reasonable and explained everything. they even got a windshield replacment company to come down and do it mobilethere. one stop shop. super helpful to a new comer", "cool": 0, "date": "2015-12-03", "funny": 0, "review_id": "P1vYT8lMJMQTMsqOfshq-w", "business_id": "BIpyVndcsAxZyBI3IqWtLQ", "stars": 4, "user_id": "iyMLcgOjOKU0ZxInkfctjw", "useful": 0}, {"text": "I contacted Cactus Flowers to have flowers sent to my aunt that had lost her son recently.  It was her birthday and after such an awful thing to happen I wanted to make her birthday as special as possible.  Then last minute I found that my aunt was leaving town to spread my cousins ashes and had to reschedule the delivery.  Cactus Flower florist was so good about rescheduling the delivery date.  They told me they would would put together a nice arrangement and they followed through with exactly that.  My aunt was very happy as well as myself.  I was very happy that I selected Cactus Flowers to arrange my aunts flowers and deliver them.  I would rate their customer service very high and I was very well taken care of.  I will use them for all my future orders, and would highly recommend them.  Thanks Cactus Flower for a fantastic arrangement!", "cool": 0, "date": "2015-11-08", "funny": 0, "review_id": "vE1qlLXciY449eqx_8pBhQ", "business_id": "PxZcX5rxuIA1EWMhgFeEnQ", "stars": 5, "user_id": "CSOLmeRhOxJf7LfGjNsc0g", "useful": 2}]